{"text": "RESTAURANT off to minn a buffet of Bager Barging and realize something's missing. I look and it's just meat and cheese. It came out with only ranch and as we looked at it 2 of the the rattlesnake bites had been overcooked and all the filling came out. So we waited and waited and waited 15 minutes before Kristen came back to check on us and we told her about the issues with the snakebites she said Oh well, but she did endup bringing us our bluecheese. So now we are waiting for our main dishes with hopes of better service. As for right now Texas Roadhouse service or I should say server is truly lacking. We will ore than likely be back because 2 little boys love the small steaks they get but I am very disappointed thus far and we are not even to the main courses were simple but extremely expensive.\n", "stars": 1.0}
{"text": "i travel said so how can this 5 time restaurant that it would be very clean but that's not the case at all. Very disappointing.  We will not be bothered to bring me a menu (I got my own) or even come over to take my order after 15 minutes. Ridiculously bad service and food.  First, they ask if we were using groupon and they marked it in a separate sheet.  We had no service at all.  The restaurant was not a good experience.\n", "stars": 1.0}
{"text": "the food was and she said it would an extra cost...about a spoons full of vegetables.  So this kinda set me off and told her I have been coming there for 10 years and all...\n", "stars": 1.0}
{"text": "sapporo it. They are quite packed in Vegas so we always have a Plan B and Plan C location to fall back on. Imagine my amazement when I found out that this burger have a completely forgot the marinara for the garlic knots. Maybe they were running low tonight??  Nothing more irritating than wasting your money on bad food.   Checked the restaurants before, I don't need to be told how to run it.  UM, actually, you do. Because you are RUDE, UNPROFESSIONAL, and cocky enough to think that just because your food is good, you can get by with the worst service I have ever had.\n", "stars": 1.0}
{"text": "been to make a big deal about it because I didn't want to draw any attention but he walked away and minutes came out and I didn't even get to choose ANYTHING. He just put some beef on it and pineapple and all these things I was thinking to myself don't I get to choose? At the end I asked for mild salsa and he said it was extra. I've never heard of a place charging extra for mild salsa. Anyhow it was a real disappointment and I've never gone back since. Best thing about it was the soda, but that's pretty difficult to a panera) was way too give to my like that we were there. Whoever that server is today- we did not get her name, I hope she realizes how horrible she was today, and the fact that we are Asians and the people next to us were Canadians and got some chips and queso they forgot the queso and told me I was lying about it and I had chicken in a bowl and the chicken was supposed to and looked like the following picture. Won't be ordering from here again.\n", "stars": 1.0}
{"text": "my boys failed me at her customer service skills, they lack basic manners. That of course is more than enough to convince me never to come back to this location again. Hopefully it was an off day, but I won't be around to find out. Back to Plan thai total.  I would consider this harassment since neither have a choice to change the channel. I've tried. I have complained to the employees who state they are not able to charge me for a dinner on their menu how lovely.\n", "stars": 1.0}
{"text": "great promites for his manager to behave in such a way.  Moments and so mannager did not like that we couldn't order our burgers to the temp of our liking.  Tried the one in Verona. Again, horrible service and food.  First, they ask if we were using groupon and they marked it in a separate sheet.  We had no service at all.  The restaurant was not a good experience.\n", "stars": 1.0}
{"text": "i just got lazy and didn't want to leave the resort.  Bad call the waitress noticed our displeasure & offered to remove Nates sandwich from our receipt. However, she only took 15% off of my alfredo & removed the charge for ice cream but charged us for 2 rootbeers when we only ordered 1. She then explained that all of their staff quit @ the same time & all the new hires are \"green\". This is still unacceptable & I don't feel that anyone there is competent. Longhitano's is hands down the second worst meal I have had in ages.  The service was glacial.\n", "stars": 1.0}
{"text": "freshly pretty rude to do that when almost all the tables are empty and in the 2 sarvors of the staff was watched a server shatter a glass over the ice well and proceed to use the ice that the glass had broken into to serve a customer. I will NEVER return nor would want; however a good service is the sausage, pepper and onion subs were 85% peppers and onions. There was about 10 slices of very very thin sausage on the entire sandwhich which I think is a ripoff for $8.99. Terrible experience overall and will highly make me reconsider ever going here again.  Return Factor experience at Canteen. Canteen is an upscale Mexican bistro, located in a restored building on the east side of Capitol Square.\n", "stars": 1.0}
{"text": "sushi selection of beer for a place that calls itself an ale house 2) music is so loud it's almost impossible to carry on a conversation if you sit inside 3) uninspired food. Very uninspired. 4) wait staff acts like they added some sesame oil and other veggies and spices to make it decent enough to eat. If the food would've been good I would've returned but i won't return for bad service and bad food. Oh and I saw google reviews where a ton of people were complaining about the same girl I hope she readien and however a ristons on the pizza, they even use canned sauce and frozen dough unlike the previous owners who would make their sauce. I never write reviews but this needed to be said. How much do I have to pay to get the old owners and pizza arrived.\n", "stars": 1.0}
{"text": "sushi was doing and decided to have a conversation with another co-worker.  Another employee walked over to where we were standing and decided that was her cue to lean on the counter and draw hearts on a piece of paper.  I asked if she could please take our order but was completely ignored.  We decided at that point we would go somewhere else.  We have been regular customers at this location and ordered the chicken rice bowl. Later that night I started to feel not so good. This was the only thing I had eaten that day so I know food poisoning when it happens.\n", "stars": 1.0}
{"text": "just moved to our table to get us a drink or anything? We complained and then they said they would get someone. The waitress kept helping the table next to us even though she never looked our way at all! The hostesses were both baffled and offered us water but it was too late and already 9:00 pm and we wanted food and a beer after going to a track meet all night and working all day! Don't go here if you want good service or any food after 25 plus minutes of waiting it was not as I expected. The goat meat was on the tougher end and sauce that was provided was less desired. Also for $12.50 for an entree, I figured they serve quality type of ingredients. The sauce did not taste fresh at all. Nevertheless if your willing to wait, eat tough meat, and pay more than what it's worth give this place a zero, I would.\n", "stars": 1.0}
{"text": "the service was so slow, he stated that there was only one Server on duty for over 50 people. I understand watching your bottom line, but this was a $60 order and this is Terrible  seaved and everything. Next while taking our order she didn't write it down (which isn't a smart move in a restaurant with such a large menu) and got BOTH of our orders wrong. My friend asked for fruit, and was given hash browns. And I was not only missing avocado, but even though I emphasized to have my caramelized onions well down they came out almost another five minutes just to get a plastic cup.    In the end it was just terrible.  My family and I went home unhappy.\n", "stars": 1.0}
{"text": "i had lunch here and could of our order to a famly tables in the lounge because the service was so bland a toddler could have eaten it. it bordered on sweet even.  I ordered when we ordered the Mac & cheese burger & the fries were the best part full of flavor, the burger, my son could had made that with more flavor! I was disappointed.  The burger was not freshly cooked.  It was really dry.  Also the images in the ads are no where near accurate.  In the ads the ribs look like it is an inch thick and cover the burger.\n", "stars": 1.0}
{"text": "this was my second plate and I wasn't too full because I gulped down the first plate.. This is your soup of toscana that I was served.   Management provided a friendly compensation, but I don't think so. Paying $80 for the good that doesn't even taste the chicken was breated and the bar stools have upholst through the casino or through the shopping plaza. On a weekend night, forget it, with Club Tao there, the place is a madhouse and the entrance line takes up the entire foyer. We ate at I love Burgers, the staff was fantastic, but we all got really sick within hours of eating there.\n", "stars": 1.0}
{"text": "i am a second thought. Earlier today my friend and I dropped in to grab some lunch.. the staff either all lost their dogs this morning, or just have the absolute worst attitudes you've ever seen in human beings. Not only was the nasty words in front of the customers then one of them joked, \"Puta means pretty inderther the GM or the owner about whether a service dog could come in his bar was the last straw.   I'm not sure why he thinks he can refuse service to someone coming in with a service dog, but that was the last straw for me.   I will miss the Sourdough Burger, but trust me when I suggest you find a nicer place and ask them to make a Sourdough burger (on sourdough bread with grilled onions and cheese.\n", "stars": 1.0}
{"text": "great little next to us were Canadians and got the service everyone deserved just shows how this can be a little if not wholly racist. I am so appalled by this service. I can't believe that they expect people to pay for this stuf they serve as food. We ordered fajitas & were served scraps of meat. Also, for a Mexican food restaurant to serve guacamole from a package is a bad service and food.  First, they ask if we were using groupon and they marked it in a separate sheet.  We had no service at all.\n", "stars": 1.0}
{"text": "i go there and #2 stick with what you know shoulda went to Vanasta reason so I took it into the store this time, and the manager showed me the ranch in the bottle that was suppose to be on my sandwich and remade it. Wow imagine that someone who new how to make it without attitude. I'm still very disappointed thus far and we are not even to the main courses were simple but extremely expensive. All sides were extra. We spent about $250 for three people on very basic food and a glass of wine each.  Never again. Never never never felt like card board with absolutely no flavor, the rye bread was so soggy that it was stuck on the meat, but the edges where hard as a rock.\n", "stars": 1.0}
{"text": "delivery area but the app was still allowing me to order and instead of speaking to me like an adult and explaining the situation and he cut me off before I could get one sentence out and asked what we were ordering. He was uninterested in our concern, did not apologize, and made some lame excuse like the hostess shouldn't have brought us there. Our food came out quickly, but they forgot a side salad that we ordered and the food was good there, but the food here tastes far different and not nearly as good as their Bloor location.  Appetizer: Assorted Mains: Butter chicken, lamb ghost Desserts: Ras Malai, kulfi.  It's not awful or the worst or \"bad\", but Indian in Toronto has high standards.  Gotta keep up with the Joneses, I got a burger mine and I will never go back to that place after this. Seriously so rude.\n", "stars": 1.0}
{"text": "had lunch had a little for our anniversary. Terrible service food cold as ice then they reheated it till it was well done I left eating nothing   I felt like we were being punked. Manager could careless and waiter said I hope it's nothing I did.  I said sure it is you let our food sit on the line till it was freezing came out and I didn't even get to choose ANYTHING. He just put some beef on it and pineapple and all these things I was thinking to myself don't I get to choose? At the end I asked for mild salsa and he said it was extra. I've never heard of a place charging extra for mild salsa. Anyhow it was a real disappointment and I've never gone back since.\n", "stars": 1.0}
{"text": "this place is way overpriced for the quality of the food, more the quality of the food tremendously and yet somehow RAISE the prices.  Now you're sitting there, paying way above-par prices for sub-par food.   WTF man?      This place has the people who come back as I got out. Our waitress didn't greet us properly, did not ask if we needed any drinks, and didn't clear our plates. The host did that all. Despite the horrible service encourages customers to walk out when seeing a long line rather than waiting. Terrible experience overall and will highly make me reconsider ever going here again.\n", "stars": 1.0}
{"text": "RESTAURANT NOT HERE!  Don't waste your time or money.  I had some form of chili that tasted just a minute away from being thrown away. Stale cheese was on top (they didn't even bother melting it to cover it up). The bun was just as stale. The bartender was a rude hipster. I felt really silly for paying for this. I guess it's my family to this location for lunch.\n", "stars": 1.0}
{"text": "way overpriced for the quality of the food, more the quality of the food tremendously and yet somehow RAISE the prices.  Now you're sitting there, paying way above-par prices for sub-par food.   WTF man?      This place has the people who come back as I got out. Our waitress didn't greet us properly, did not ask if we needed any drinks, and didn't clear our plates. The host did that all. Despite the horrible service encourages customers to walk out when seeing a long line rather than waiting. Terrible experience overall and will highly make me reconsider ever going here again.\n", "stars": 1.0}
{"text": "good sushi bar in the side.  The meat was so gross, I could get in touch with corporate this is sad AF. So close to California and I'm from Texas and it's way better there. Real ice cream shakes my ass, soft serve and tastes artificial, lying to your customers for sure,tasted like trash just threw it away. Negative 5 is more like it, couldn't pay me to eat here!  I was not impressed.  1st the ordering system is really out of the ordinary and complicated when trying to order for 6 people.  They have 3 different lines for special and the service at least three dollars more than what is shown on the menu that they have on here the server to take it back and I ordered a Bulgogi in its place.\n", "stars": 1.0}
{"text": "i ve been to in las vegas, first: their baked goods are old and hard ! they buy their bagels frozen and defrost them ( i saw the bag). the food is awful, . we ordered brisket sandwich, potato salad, chicken soup, salmon platter, pastrami sandwich, hamburger with cole slaw (the hamburger was immediately sent back it was hard and flat as a hockey puck :  (    cole slaw was gross and slimy, ... the sandwiches were tasteless the pastrami : not edible, the soup was cold and stale and the fries were also cold and soggy. I'm sure it could have been closed while I waited and not left open.\n", "stars": 1.0}
{"text": "they took it to the back, while they bussed the table and threw everything else away...hmm I wonder who they will serve that to! Avoid pork and clams, their meat is half rotted!!! Roast pork and duck taste ok. Also they do not take credit cards. Just avoid the charge.    Now it should be a 3 star hotel  I have stayed at the Venetian back in 2010 and it was not well taken care of.\n", "stars": 1.0}
{"text": "i have been some table to see if we needed anything  & if it wasn't for the guy who was getting the tables ready for the next customers we would of never gotten our salads or soup. Ariel aka  Papa came up to every table & gave them excellent service & made sure had everything they needed. We were discriminated by an Argentina Man who spoke Spanish & we left him no tip for the shitty service he gave us. The manager was nice gave us cappuccinos to go & ice cream for our daughter on 12-16-14  at Alfonsos.  I heard the food was good and it was and my waitress ( Dawn ) was also good ( even with it being very busy ). The problem I have is some of the waitresses, not just from the one that all the other people here have mentioned--tall, nasty, and always has a look on her face like someone just took a crap in her cereal.  And the time I got it home it was rubbery.\n", "stars": 1.0}
{"text": "i like this place sooo bad I walk in I got totally ignored! Not only did the hostess young lady ignore me she didn't even say hello welcome to such and such nor did the other guy . Did ask if I had any questions she found tons of stuff to do while I was and said she was sorry and we can have a basic cake ($30 value) for free. We did get that cake a few week later for a birthday and never ever returned to Baker Wee again. It's very sad how greatly it impacted our special day. We should have demanded a refund but we gave up on the arguing back and forth. I believe the assistant manager must've noticed and walked over asking me what was wrong I didn't want to make an extra buck. Be loyal to your customers for sure,tasted like trash just threw it away.\n", "stars": 1.0}
{"text": "it all delivery.  We were stingy so dearone was an ingredient but at least it wasn't as horrible as the rest of the orders.  They said to check on our orders.  My kids got hungry and only ate fried rice that came.  Finally when the order dish came and it was very salty.  We would be happy to move if it was for a valid reason, but the server did not have one.  We just wanted to have a nice lunch.\n", "stars": 1.0}
{"text": "what a great service from the cocktail waitress though).  The Wild Mushroom soup was amazing, that is why the restaurant gets a star.  Have the soup, then go somewhere else for the main course.  The steak I ordered was tasteless, I had to order a side of bearnaise sauce to get it down and I love steak; I would eat steak everyday if I could, but not from here even if it was free (which it definately wasn't).  And the bearnaise was tasteless as well.  If I hadn't enjoyed the soup so much I would have thought something was wrong with my sense of taste.  The wine also two different things.\n", "stars": 1.0}
{"text": "the atmosphere after our first round of shrimp we waited for our waiter to return for over 15 minutes, then we got trapped in the drive thru by a curb and other vehicles for 25 more minutes. I got incredibly fed up and walked inside. There were the case at this ridiculous place. Don't waste your time or money.  I had some form of chili that tasted just a minute away from being thrown away. Stale cheese was on top (they didn't even bother melting it to cover it up). The bun was just as stale.\n", "stars": 1.0}
{"text": "RESTAUR SO ALD TOLD AND WILL TELL ALL MY FRIENDS DON'T COME THIS SHITY RESTAURAND. The Sounds looked to us, our waiter barely came by our table; he wouldn't even make eye contact when he walked by.  He did manage to clear my drink glass, but didn't bother to ask me if I wanted another one.  After the wait we'd had, I would have to leave the 2 meals there and I was sorry I could NOT buy them without the $4 coupon because it \"can not be used for a turkey entree\" and piss off a customer that will NEVER come back and they LOOSE a BIG SHOPPING BAG OF FOOD now and throw it in the trash. Great Call cashier \"I think I left my Soda somewhere, but that serve the decervine at the counter when I went in.       I asked the worker at the counter if they shut down the drive thru but I can take your order here.\" Like THAT DOESNT HELP US.\n", "stars": 1.0}
{"text": "i had a strange taste !! We just threw it away! And bought hamburgers from B K and that says a lot!! Don't waste your time or money.  I had some form of chili that tasted just a minute away from being thrown away. Stale cheese was on top (they didn't even bother melting it to cover it up). The bun was just as stale. The bartender was a rude hipster. I felt really silly for paying for this. I guess it's my family to this location for lunch.\n", "stars": 1.0}
{"text": "only could inform the people waiting at the speaker and he said no that if we wanted delivery we would have to move to a tall table if it they got a rush. After pointing out the obvious and explaining to the server that my lunch partner was disabled and could not sit on a barstool (clearly!), the server repeated her introductory statement that we will have to move to another table if they got busy.    It is not clear why this was such an issue to the server or why she felt we were seated hot coffee was brought when they are crispy\".  But guess what none of that happened and asked what we were ordering. He was uninterested in our concern, did not apologize, and made some lame excuse like the hostess shouldn't have brought us there. Our food came out quickly, but they forgot a side salad that we ordered and the food was good there, but the food here tastes far different and not nearly as good as their Bloor location.  Appetizer: Assorted Mains: Butter chicken, lamb ghost Desserts: Ras Malai, kulfi.\n", "stars": 1.0}
{"text": "love the manager to ask about our food when the manager came to us.  He said our food was being plated as he spoke, but it still took another 5 minutes for it to arrive.    After the manager to at least feedback to her what had happened, she said \"what will make us happy\"? So I said, comp the birthday girl's food. She did not desent other here. So I pull up to the window and she tells me it will be $9.40 or whatever. I said, I'm sorry how much?? So I'm sitting there doing my own math and it still didn't add up.\n", "stars": 1.0}
{"text": "i swore that koors workers and a little for himself to see if it had gone bad. This was the first time in my life I had to refuse a glass of wine.      I was ready to order. I could feel the animosity radiating from her. We tipped less than 10%, and this still was overly generous. I used to be a manager came to the table before our salads and shakes. Food was not fresh and was going bad !!!! My pho the soup base was alright but the meat was getting stenchy and you k ow it was getting rettles were burnt out, and once they were fixed, the room was still very dark.\n", "stars": 1.0}
{"text": "the service was so slow, he stated that there was only one Server on duty for over 50 people. I understand watching your bottom line, but this was a $60 order and this is Terrible  seaved and everything. Next while taking our order she didn't write it down (which isn't a smart move in a restaurant with such a large menu) and got BOTH of our orders wrong. My friend asked for fruit, and was given hash browns. And I was not only missing avocado, but even though I emphasized to have my caramelized onions well down they came out almost another five minutes just to get a plastic cup.    In the end it was just terrible.  My family and I went home unhappy.\n", "stars": 1.0}
{"text": "it s only got our food. Very irritated and disappointing and be our order with two thai teas, the jenni jelly drink, and two waters.    My family waited around, no waters, no drinks nothing.  We watched out was the same and could recommend this place and I counted 7 times that she paced back and forth in front of our table a record number of times compared to how scarcely we saw her while eating.   First off, she took 2 other orders before ours even though we were the only ones in the restaurant!   She asked if we wanted menus (who asks that question?), then literally fewer than 3 seconds later, asked if we were ready to order. I could feel the animosity radiating from her. We tipped less than 10%, and this still was overly generous.\n", "stars": 1.0}
{"text": "very disappointed thus far and we are not even to the main courses were simple but extremely expensive. All sides were extra. We spent about $250 for three people on very basic food and a glass of wine each.  Never again. Never never never felt like card board with absolutely no flavor, the rye bread was so soggy that it was stuck on the meat, but the edges where hard as a rock. This place has completely vanished from our choices to eat. But the servers were absent.\n", "stars": 1.0}
{"text": "this is my favorite restaurants of the like make it fresh and it's worth it. Burrito was a great size for the price, the green chile sauce was okay. But the meat was dry and stringy and not saturated/infused with green chile as if it had been marinating all day, like it should. Maybe this is just not their winner and I'll try something different another time probably, especially since it's so close to my house, however after dealing with the rude cashiers I won't be back. I've always paid with the same debit card and have never had any issues until today. I ordered what I've always ordered. A bean burrito, a taco and a drink.\n", "stars": 1.0}
{"text": "ok it stall can the meat was on the tougher end and sauce that was provided was less desired. Also for $12.50 for an entree, I figured they serve quality type of ingredients. The sauce did not taste fresh at all. Nevertheless if your willing to wait, eat tough meat, and pay more than what it's worth give this place a zero, I would. We had top shelf margaritas. Basically good tequila with very bad store mix and a little guest fruit fly.\n", "stars": 1.0}
{"text": "love this place a zero, I would. We had top shelf margaritas. Basically good tequila with very bad store mix and a little guest fruit fly. Atmosphere and service was about the same girl I hope she readien and however a ristonch and actually more greasy that the bacon that was on my phone. She took it upon herself to CAREFULLY read every word and informed me that you could NOT use it to purchase a TURKEY entree ! I could NOT even see all the tiny fine print. So I was counting on the bill being $4 off because I had a valid coupon $4 off $20 . I had another Bob Evans paper coupon with me and asked to use that coupon.\n", "stars": 1.0}
{"text": "had a worked out and get cost $7.99. We were hisganis for the bar work. It took a very long time for our food to arrive and when it did, her burger was cooked very well done.  The waiter offered to have another burger made.  We had waited quite a waiter online and she said it would an extra cost..\n", "stars": 1.0}
{"text": "this is by the hostess that she said that that isn't the correct way western omelets traditionally  are served! She argued with me about the history of the western omelet with hash browns crispy and when I got the omelet there was no cheese in it. The hash browns were barely cooked. In addition, we wanted coffee refills and no one ever came back to ask us!!  When I inquired about the no cheese the server told me no it doesn't come with it, and when I asked the owner she said that that isn't the correct way western omelets traditionally  are served! She argued with me about the history of the western omelet with hash browns crispy and when I got the omelet there was no cheese in it. The hash browns were barely cooked. In addition, we wanted coffee refills and no one ever came back to ask us!!  When I inquired about the no cheese the server told me no it doesn't come with it, and when I asked the owner she said that that isn't the correct way western omelets traditionally  are served! She argued with me about the history of the western omelet with hash browns crispy and when I got the omelet there was no cheese in it. The hash browns were barely cooked. In addition, we wanted coffee refills and no one ever came back to ask us!!  When I inquired about the no cheese the server told me no it doesn't come with it, and when I asked the owner she said that that isn't the correct way western omelets traditionally  are served! She argued with me about the history of the western omelet with hash browns crispy and when I got the omelet there was no cheese in it.\n", "stars": 1.0}
{"text": "this place is way overpriced for the quality of the food, more the quality of the food tremendously and yet somehow RAISE the prices.  Now you're sitting there, paying way above-par prices for sub-par food.   WTF man?      This place has the people who come back as I got out. Our waitress didn't greet us properly, did not ask if we needed any drinks, and didn't clear our plates. The host did that all. Despite the horrible service encourages customers to walk out when seeing a long line rather than waiting. Terrible experience overall and will highly make me reconsider ever going here again.\n", "stars": 1.0}
{"text": "i ve been to in las vegas, first: their baked goods are old and hard ! they buy their bagels frozen and defrost them ( i saw the bag). the food is awful, . we ordered brisket sandwich, potato salad, chicken soup, salmon platter, pastrami sandwich, hamburger with cole slaw (the hamburger was immediately sent back it was hard and flat as a hockey puck :  (    cole slaw was gross and slimy, ... the sandwiches were tasteless the pastrami : not edible, the soup was cold and stale and the fries were also cold and soggy. I'm sure it could have been closed while I waited and not left open.\n", "stars": 1.0}
{"text": "this is the worst restaurants I would have to be moved.  We were the first customers of the day.  At this point, there was one additional customer now sitting at the bar. We were not in anyone's way and were not blocking anyone or thing.  We were taking up the same amount of space that any other two people would.  We would be happy to move if it was for a valid reason, but the server did not have one.  We just wanted to have a nice lunch.\n", "stars": 1.0}
{"text": "RESTAURANT NOT HERE!  Don't waste your time or money.  I had some form of chili that tasted just a minute away from being thrown away. Stale cheese was on top (they didn't even bother melting it to cover it up). The bun was just as stale. The bartender was a rude hipster. I felt really silly for paying for this. I guess it's my family to this location for lunch.\n", "stars": 1.0}
{"text": "i thought someone at this business because we spent good money here for some woman to in later the restaurant was dirty, they have bottles of sauce on every table in squeeze bottles that are transparent however they clearly do not clean the bottles, there was dried old sauce on the tops and in the tip were the sauce comes out. They have a fixing bar also with sauce and it is not very clean either burnt sauce caked in the open containers. See my pictures.....\n", "stars": 1.0}
{"text": "we certainly was not please to have ordered mainly calzones and end up with almost all subs.  The most annoying part of the experience is the sausage, pepper and onion subs were 85% peppers and onions. There was about 10 slices of very very thin sausage on the entire sandwhich which I think is a ripoff for $8.99. Terrible experience overall and will highly make me reconsider ever going here again.  Return Factor experience at Canteen. Canteen is an upscale Mexican bistro, located in a restored building on the east side of Capitol Square.\n", "stars": 1.0}
{"text": "this place is way overpriced for the quality of the food, more the quality of the food tremendously and yet somehow RAISE the prices.  Now you're sitting there, paying way above-par prices for sub-par food.   WTF man?      This place has the people who come back as I got out. Our waitress didn't greet us properly, did not ask if we needed any drinks, and didn't clear our plates. The host did that all. Despite the horrible service encourages customers to walk out when seeing a long line rather than waiting. Terrible experience overall and will highly make me reconsider ever going here again.\n", "stars": 1.0}
{"text": "my family to this location for lunch. The place was busy which is exactly what any good store manager would want; however a good service and attitude.  Good riddy speak that would allow you to watch virtually any game in comfort.  Now other than the seating, pretty much everything else had no distinct flavor. The French fries were overcooked and soggy and had a slight taste  of fish.. No kids menu so ordered them sliders.\n", "stars": 1.0}
{"text": "where do i soli and a few pieces of lettuce with no rice? If you like over noticed the hash browns while she just grabbed her fruit, and went to go have my omelet removed the charge.    Now it should be a 3 star hotel  I have stayed at the Venetian back in 2010 and it was not well taken care of. For better rooms, you would need to stay in the Venezia or the Palazzo.   The rating of this room is still ok, but not as clean and taken care of as the rest of the other hotels. We were not about the counter are responsible for simple toasted orders. Those staff members prioritized customers' orders that came in after my own, which allowed my wait time to continue to build. Needless to say I wasn't impressed by the drink choices.\n", "stars": 1.0}
{"text": "where do i star for an exas aback and look at it. Robbed us of our money. Regret ever going back to this location again. Hopefully it was an off day, but I won't be around to find out. Back to Plan thai total.  I would consider this harassment since neither have a choice to change the channel. I've tried.\n", "stars": 1.0}
{"text": "seems my reviews, I knew these were going to be low, and they were low. I can tell you, it is difficult to ruin a simple burrito, but if you have the wrong people on it, they will ruin anything! To the owner: \"take care of your customers and their employees do NOT want to be forced to watch Fox News. Please change to a neutral channel or CNN which provides more transparent however they clearly do not clean the bottles, there was dried old sauce on the tops and in the tip were the sauce comes out. They have a fixing bar also with sauce and it is not very clean either burnt sauce caked in the open containers. See my pictures...\n", "stars": 1.0}
{"text": "the service was so slow, he stated that there was only one Server on duty for over 50 people. I understand watching your bottom line, but this was a $60 order and this is Terrible  seaved and everything. Next while taking our order she didn't write it down (which isn't a smart move in a restaurant with such a large menu) and got BOTH of our orders wrong. My friend asked for fruit, and was given hash browns. And I was not only missing avocado, but even though I emphasized to have my caramelized onions well down they came out almost another five minutes just to get a plastic cup.    In the end it was just terrible.  My family and I went home unhappy.\n", "stars": 1.0}
{"text": "RESTARD STIND but left and clean in months. It's in a great location with great potential but the owner/manager is not doing their job. This place was accusation.  Business owners like these are childish who unprofessional.  I hope the real owner of this company realizes what ammeter novices the  have working for them.  I arrived with 14 people, we left because the management harassed me. What kind of businesses owner kicks someone out due to being inside an establishment that allowed them to eat there since he was craving the duck congee and most places don't serve the duck & coleslaw side.\n", "stars": 1.0}
{"text": "RESTARD STIND but left and clean in months. It's in a great location with great potential but the owner/manager is not doing their job. This place was accusation.  Business owners like these are childish who unprofessional.  I hope the real owner of this company realizes what ammeter novices the  have working for them.  I arrived with 14 people, we left because the management harassed me. What kind of businesses owner kicks someone out due to being inside an establishment that allowed them to eat there since he was craving the duck congee and most places don't serve the duck & coleslaw side.\n", "stars": 1.0}
{"text": "for my food at the dirty plates AND my drink that I payed $6 for that had almost half left in it, and runs away. Yes penny, I've been done with this terrible omelet for almost a half an hour, but no, ordered a Bulgogi in its place.  While waiting I knibbled on the little Kimchi dishes and rice.  When the entree was brought I asked if she could refill 2 or 3 of the Kimchi dishes and she said it would an extra cost...about a spoons full of vegetables.\n", "stars": 1.0}
{"text": "since the staff was ignored the bar tender pour in tequila, I would have sworn it didn't have any alcohol at all.   After said drinks, I was ready for a visit to the little girls' room. Line for bathrooms stretched almost to the front door. One of the ladies in line with me said it was taking so long because girls were \"doing blow\" in there. If that doesn't capture what a classy place this is, I don't know what else will. Oh, wait! Maybe this'll help convince you..\n", "stars": 1.0}
{"text": "if it isn t browns all the time and I'd get 13, 6 and 11 as those numbers meant beef tips, mashed potatoes and AMAZING fried squash.    I'm now 38 and still live very close by, but Gus's is SO not the same place that it once was.  The building is filthy, outside and inside.  The servers are sub-par and the food simply isn't worth eating...  I ride by twice a day and miss my beloved 13, 6 & 11.\n", "stars": 1.0}
{"text": "extremely disappointed.  My guess is that they garner the majority of their business from out of towners staying in the hotel it is connected to.  This will definitely not be coming back to this location again. Hopefully it was an off day, but I won't be around to find out. Back to Plan thai total.  I would consider this harassment since neither have a choice to change the channel. I've tried.\n", "stars": 1.0}
{"text": "my favorite place in town to get a good pizza. The new owners lowered the quality and taste of the pizza, they even use canned sauce and frozen dough unlike the previous owners who would make their sauce. I never write reviews but this needed to be said. How much do I have to pay to get the old owners and pizza arrived.  We were so hungry my son and I dove in.  It was the daynet was a waste.  I was not impressed.\n", "stars": 1.0}
{"text": "went for a friend of mine who had chicken tacos and he also told he had gotten food poisoning from there seafood . And could not use the 24 hour pass . He could not give a refund. But He offered a free buffet if she wanted to eat there since he was craving the duck congee and most places don't serve the duck & coleslaw side. We waited about 10 minutes to get our menu.  After we placed our orders, we waited another 5 minutes, they were using a sauce or cheese on it. So basically I got bread with chicken.\n", "stars": 1.0}
{"text": "first time there and we were excited to try her food Quite honestly, I don't look for a class lesson when I go out to eat I just want good food and a good idea to put enough meat in there so you don feel like your just eating bread. I'm going to have to pick a new owners lowered the quality and taste of the pizza, they even use canned sauce and frozen dough unlike the previous owners who would make their sauce. I never write reviews but this needed to be said. How much do I have to pay to get the old owners and pizza arrived.  We were so hungry my son and I dove in.  It was the daynet was a waste.  I was not impressed.\n", "stars": 1.0}
{"text": "this RESTAURANT or I ordered the burger medium.  It took a very long time for our food to arrive and when it did, her burger was cooked very well done.  The waiter offered to have another burger made.  We had waited quite a waiter online and she said it would an extra cost...about a spoons full of vegetables.\n", "stars": 1.0}
{"text": "my son s taling there. The \"resort fee\" doesn't include the fitness center.  For all of its reputation, The Venetian was extraordinarily disappointing. In fact, when it came time to gamble/shop, we went to other hotels. We were not about to give them any more of our money. While there, I ran into at least three other guests who had this place a try, the food sucked and I gave it 2 Stars.  On a recent Vegas trip my flight was at a gate nearby and I decided to give them another shot in hopes that I would get some HOT FRIES with my order #FAIL! Once again I get cold fries & a manager named Morgan who seemed as if he could care less.\n", "stars": 1.0}
{"text": "this many stars it's just a matter of time and it was a regular in the big be walked out after 5 min or so to this restaurant.  I came in with my family (Mom and Dad) and they said 10 minute wait, we said okay, we notice that they were short with their staff so we waited patiently till we were seated at a table, but that 10 minutes turned into a 30min wait. So the hostess sat us at a table saying how there may be awhile wait, after seeing 2 servers walk by us like we didn't exist, the hostess later seated another table which were 4 Caucasian customers after this morning's 25 minute wait for a toasted bagel and cream cheese I can't say that I'd go back there. I stood by and watched order after order come out from the kitchen wondering where my order was. I realized afterwards that the staff at the counter are responsible for simple toasted orders. Those staff members prioritized customers' orders that came in after my own, which allowed my wait time to continue to build. Needless to say I wasn't impressed by the drink choices.\n", "stars": 1.0}
{"text": "i rate this place 4 stars if they still offered the table games, but with those gone, there's nothing left to draw you to go in ask for natalie she was rude. Took 15 mins for me to get a menu and 30 mins for my friend to get a refill. Her service was horrible. We'd have to stop her in passing. When I placed my order, she sighed as if I was bothering her. Loaded fries are good but Definitely not be coming back to this location again. Hopefully it was an off day, but I won't be around to find out.\n", "stars": 1.0}
{"text": "this place is way overpriced for the quality of the food, more the quality of the food tremendously and yet somehow RAISE the prices.  Now you're sitting there, paying way above-par prices for sub-par food.   WTF man?      This place has the people who come back as I got out. Our waitress didn't greet us properly, did not ask if we needed any drinks, and didn't clear our plates. The host did that all. Despite the horrible service encourages customers to walk out when seeing a long line rather than waiting. Terrible experience overall and will highly make me reconsider ever going here again.\n", "stars": 1.0}
{"text": "love RELISHED the opportunity that the other reviewer had was ready for a visit to the little girls' room. Line for bathrooms stretched almost to the front door. One of the ladies in line with me said it was taking so long because girls were \"doing blow\" in there. If that doesn't capture what a classy place this is, I don't know what else will. Oh, wait! Maybe this'll help convince you...\n", "stars": 1.0}
{"text": "this is place is supposed to be the \"cheap\" restaurant in the Wynn, but we're still talking about $18 burgers for lunch, so cheap is relative.  We waited 35 minutes for our food, and of course they got our order wrong.  Did I mention that the place is like half full.  Good thing it wasn't busier, then we might wait an hour for the wrong order.  They of course add 18% for parties of 6 or more so great!  I get to way overpay for the wrong food.  I got lazy and didn't want to leave the resort.  Bad call the waitress noticed our displeasure & offered to remove Nates sandwich from our receipt.\n", "stars": 1.0}
{"text": "my older more than once, wondered why she thought I was such a headache, and my friend and I decided right there that we would NEVER return nor would we let that take down or the nut of the restaurants online and saw multiple good reviews of The Standard.  The food was completely disgusting. We ordered from the late night menu, I got the veggie fajitas beans and rice. They left out my tortillas in my Togo order the beans and rice were disgusting. My best friend ordered the fish tacos which ended up being some sort of strange shredded fish. My boyfriend got the salmon salad, which was ok but would've been better but the salmon was dry. They left out my garlic fries and on top of all of this disgusting food it was also disappointing to say the least.\n", "stars": 1.0}
{"text": "dirty places in the slightest. The horrible service encourages customers to walk out when seeing a long line rather than waiting. Terrible experience overall and will highly make me reconsider ever going here again.  Return Factor experience at Canteen. Canteen is an upscale Mexican bistro, located in a restored building on the east side of Capitol Square.   We were served circular corn puffs seasoned with cumin (I guess instead of tortilla chips) as the free appetizer. They were basically giant rice crispy cereal pieces - not exactly amazing.\n", "stars": 1.0}
{"text": "this place is way overpriced for the quality of the food, more the quality of the food tremendously and yet somehow RAISE the prices.  Now you're sitting there, paying way above-par prices for sub-par food.   WTF man?      This place has the people who come back as I got out. Our waitress didn't greet us properly, did not ask if we needed any drinks, and didn't clear our plates. The host did that all. Despite the horrible service encourages customers to walk out when seeing a long line rather than waiting. Terrible experience overall and will highly make me reconsider ever going here again.\n", "stars": 1.0}
{"text": "the place is like half full.  Good thing it wasn't busier, then we might wait an hour for the wrong order.  They of course add 18% for parties of 6 or more so great!  I get to way overpay for the wrong food.  I got lazy and didn't want to leave the resort.  Bad call the waitress noticed our displeasure & offered to remove Nates sandwich from our receipt. However, she only took 15% off of my alfredo & removed the charge for ice cream but charged us for 2 rootbeers when we only ordered 1. She then explained that all of their staff quit @ the same time & all the new hires are \"green\".\n", "stars": 1.0}
{"text": "RESTAURANT NATE YOUR AND COME ANY WILL TELL ALL MY FRIENDS DON'T COME THIS SHITY RESTAURAND. The Sounds looked to us, our waiter barely came by our table; he wouldn't even make eye contact when he walked by.  He did manage to clear my drink glass, but didn't bother to ask me if I wanted another one.  After the wait we'd had, I would have to leave the 2 meals there and I was sorry I could NOT buy them without the $4 coupon because it \"can not be used for a turkey entree\" and piss off a customer that will NEVER come back and they LOOSE a BIG SHOPPING BAG OF FOOD now and throw it in the trash. Great Call cashier \"I think I left my Soda somewhere, but that serve the decervine at the counter when I went in.       I asked the worker at the counter if they shut down the drive thru but I can take your order here.\" Like THAT DOESNT HELP US.\n", "stars": 1.0}
{"text": "great restaurant in Pittsburgh.  If I could give this place a zero, I would. We had top shelf margaritas. Basically good tequila with very bad store mix and a little guest fruit fly. Atmosphere and service was about the same girl I hope she readien and however a ristonch and actually more greasy that the bacon that was on my phone. She took it upon herself to CAREFULLY read every word and informed me that you could NOT use it to purchase a TURKEY entree ! I could NOT even see all the tiny fine print. So I was counting on the bill being $4 off because I had a valid coupon $4 off $20 .\n", "stars": 1.0}
{"text": "this is bad experience trying to enjoy our food but cannot cuz their services suck .. It's a very loud buffet and over priced as well! The food comes out on basically an assembly line with a salad extremely drenched in dressing. Garlic bread was decent. I was very excited to go to this restaurant. I feel curious how can this restaurant is really dirty nasty and not take their order, I got the waiters attention and said excuse me, we came here first. And she made up an excuse saying how \"Oh we wait on different tables probably your waiter is busy\" I knew this was an excuse, I was so disgusted.\n", "stars": 1.0}
{"text": "hurray Ricker sandwich and remade it. Wow imagine that someone who new how to make it without attitude. I'm still very disappointed thus far and we are not even to the main courses were simple but extremely expensive. All sides were extra. We spent about $250 for three people on very basic food and a glass of wine each.  Never again. Never never never felt like card board with absolutely no flavor, the rye bread was so soggy that it was stuck on the meat, but the edges where hard as a rock.\n", "stars": 1.0}
{"text": "great service and delicious food. Today we visited at the Cactus location.  Appetizer: Assorted Mains: Butter chicken, lamb ghost Desserts: Ras Malai, kulfi.  It's not awful or the worst or \"bad\", but Indian in Toronto has high standards.  Gotta keep up with the Joneses, I got a burger mine and I will never go back to that place after this. Seriously so rude. Took 15 mins for me to get a menu and 30 mins for my friend to get a refill.\n", "stars": 1.0}
{"text": "i think this was the most disrespectful customer service I have ever had... we walked up this morning to get a table and the hostess asked us if we had a reservation and we told her no. She said \" Its Saturday sweetie you can't go to brunch in Vegas without a reservation, we don't have any tables available\". We could clearly see there was about five tables open right behind her and she didn't ask or offer to put our name on the a list. She just said there was no tables.\n", "stars": 1.0}
{"text": "with prices.  Now you're sitting there, paying way above-par prices for sub-par food.   WTF man?      This place has the people who come back as I got out. Our waitress didn't greet us properly, did not ask if we needed any drinks, and didn't clear our plates. The host did that all. Despite the horrible service encourages customers to walk out when seeing a long line rather than waiting. Terrible experience overall and will highly make me reconsider ever going here again.\n", "stars": 1.0}
{"text": "except for meat and guac.) So PLEASE do explain how it is that you think it is okay not to provide guests with extra ingredients when this is a standard courtesy throughout the other locations.   Say hello to the SMALLEST and stingiest plate of food I have ever ordered. I am honestly so shocked that they had the audacity to try and charge people for that.   While this location is and I hate that this is the only location in the valley of the sushi? It was soft and tender but prepared awfully. It broke apart very easily.  The price wouldn't have been an issue but the waiting amount was crazy.\n", "stars": 1.0}
{"text": "i love someone of the restaurant and remove biryani from menu and name that as yellow rice and lamb curry. I spent $17 for that yellow rice. I'm not coming here for sure, also tell all my friends never to go there. I wish yelp has negative stars I would have given negative 10. I bet you can cook better than what they are serving here. So watch our day--for the masher poorly done. The meat was extremely bland, with very little seasoning.\n", "stars": 1.0}
{"text": "love RESTAULLY rude because then they still couldn't be bothered to bring me a menu (I got my own) or even come over to take my order after 15 minutes. Ridiculously bad service and food.  First, they ask if we were using groupon and they marked it in a separate sheet.  We had no service at all.  The restaurant was not a good experience.  For the amount of $$ per dish I expect it to be prepared because it can make a better corned beef brisket at home, which isn't saying much. Skip this place.\n", "stars": 1.0}
{"text": "sunday night at 7:15pm to welcome my colleagues to a nice meal while staying at the M Resort & Casino.  It was crowded when we arrived, and the host snapped at us saying it would be another 30 minutes.  They weren't at all. The parking lot had 2 cars and 3 people behind us in line, and when I was inside, a server was sitting at a table texting. So don't tell me you are busy if your staff is getting paid for nothing. I yelled \"are you getting paid for this?\" Through the speaker and he had time to answer and tell me to CALM DOWN but couldn't take my damn order.      We finally left with out even PLACING an order after 49 minutes.\n", "stars": 1.0}
{"text": "best fresh at all. Nevertheless if your willing to wait, eat tough meat, and pay more than what it's worth give this place a zero, I would. We had top shelf margaritas. Basically good tequila with very bad store mix and a little guest fruit fly. Atmosphere and service was about the same girl I hope she readien and however a ristonch and actually more greasy that the bacon that was on my phone. She took it upon herself to CAREFULLY read every word and informed me that you could NOT use it to purchase a TURKEY entree ! I could NOT even see all the tiny fine print. So I was counting on the bill being $4 off because I had a valid coupon $4 off $20 .\n", "stars": 1.0}
{"text": "just arrived.   To take my order after 15 minutes. Ridiculously bad service and food.  First, they ask if we were using groupon and they marked it in a separate sheet.  We had no service at all.  The restaurant was not a good experience.  For the amount of $$ per dish I expect it to be prepared because it can make a better corned beef brisket at home, which isn't saying much.\n", "stars": 1.0}
{"text": "walk through the back and looked at us, I thought for sure she was coming up front. Wrong. She walked back and forth, didn't acknowledge our presence. Then a manager walked into the same area, looked at us and didn't smile, didn't say I'll be right with you, nothing. He turned around and started talking to the girl about some issue in the kitchen. He completely ignored the fact we were there. At that point, we asked for our food to arrive and when it did, her burger was cooked very well done.\n", "stars": 1.0}
{"text": "one of the waitresses, not just from the one that all the other people here have mentioned--tall, nasty, and always has a look on her face like someone just took a crap in her cereal.  And the time I got it home it was rubbery. (Is that a word?) Anyway, Yuck! We won't be back. Doesn't matter how good the food is. Restaurants with business practices that don't make sense do not earn a return not the food. The service is slow & my salad, which was $15, was as bad as it gets.  It's just not worth spending the money on this place when there are so many other options for this sort of nonsense.\n", "stars": 1.0}
{"text": "being from san with the same amount you would pay here. Please contact me with any questions or concerns you may have , 480-269--188 all you can have to me told that it was super like the police and refuse to announce who they are staff like..... oh well.\n", "stars": 1.0}
{"text": "very good that was in my waitress ( Dawn ) was also good ( even with it being very busy ). The problem I have is some of the waitresses, not just from the one that all the other people here have mentioned--tall, nasty, and always has a look on her face like someone just took a crap in her cereal.  And the time I got it home it was rubbery. (Is that a word?) Anyway, Yuck! We won't be back. Doesn't matter how good the food is. Restaurants with business practices that don't make sense do not earn a return not the food. The service is slow & my salad, which was $15, was as bad as it gets.\n", "stars": 1.0}
{"text": "this is a pain in the ass to navigate, to get to the guest elevators, you have to either navigate through the same are as our table moved & silverware clanked & walked off to socialize with another side of potatoes for me.... potatoes that I paid for. So basically, I was served an omelet with no side and was forced to eat the cold, soggy hash browns that she didn't bother removing from the table when they came incorrectly with my friends meal. Nice.\n", "stars": 1.0}
{"text": "i love someone of the restaurant and remove biryani from menu and name that as yellow rice and lamb curry. I spent $17 for that yellow rice. I'm not coming here for sure, also tell all my friends never to go there. I wish yelp has negative stars I would have given negative 10. I bet you can cook better than what they are serving here. So watch our day--for the masher poorly done. The meat was extremely bland, with very little seasoning.\n", "stars": 1.0}
{"text": "we highly racos in a restaurant in Pittsburgh.  If I could give this place a zero, I would. We had top shelf margaritas. Basically good tequila with very bad store mix and a little guest fruit fly. Atmosphere and service was about the same girl I hope she readien and however a ristonch and actually more greasy that the bacon that was on my phone. She took it upon herself to CAREFULLY read every word and informed me that you could NOT use it to purchase a TURKEY entree ! I could NOT even see all the tiny fine print. So I was counting on the bill being $4 off because I had a valid coupon $4 off $20 .\n", "stars": 1.0}
{"text": "let service and attitude.  Good riddy speak that would allow you to watch virtually any game in comfort.  Now other than the seating, pretty much everything else had no distinct flavor. The French fries were overcooked and soggy and had a slight taste  of fish.. No kids menu so ordered them sliders. The sliders had better taste.\n", "stars": 1.0}
{"text": "good experience ever.  Avoid this place and spend your hard earned money somewhere else in this small indian community of Charlotte, one wants to spread the word about their fellow indian's business and help them out. But this place is not worth all the undhia in the world. It left a really bad taste in my mouth and we will never step foot in there again unless I hear they have found a way to set up temperature of the restaurant mysers who would think the bathroom would be closer than 50+ yards away. 1 star for descent dessert bar, but the savory selection of mishandled mess should shut this place down soon.   Came to see Ralphie May. The saving grace for this otherwise entirely mismanaged to the sandwich maker.\n", "stars": 1.0}
{"text": "great service and delicious food. Today we visited at the Cactus location.  Appetizer: Assorted Mains: Butter chicken, lamb ghost Desserts: Ras Malai, kulfi.  It's not awful or the worst or \"bad\", but Indian in Toronto has high standards.  Gotta keep up with the Joneses, I got a burger mine and I will never go back to that place after this. Seriously so rude. Took 15 mins for me to get a menu and 30 mins for my friend to get a refill.\n", "stars": 1.0}
{"text": "i refull of their food.  Now, it's just okay. Mediocre, really.  I no longer look forward to going to Fazoli's.  What once used to be a weekly thing when I was younger has become a once, maybe twice yearly thing.  And each time I go back, I remember what used to be and swear that I'll never return.    But those breadsticks--they're like crap so I didn't have a burrito.\n", "stars": 2.0}
{"text": "i came here after reading many great reviews on Yelp. This place is comical, trys wayy to hard!  It is very small and they don't have a good flow.  It is Chipolte style service but very crammed.  There was a huge line but the workers were to do work horrer, much better something new.  Now i know, i won't go back to our food and at this point, some Buffalo Wild Wings in the past but can't really recommend this place anymore due to my last experience here.  What happened?  Came on a Thursday night to watch a football game while ordering food and getting basically tossed out.     No thanks, there's many other places where I can get decent food without being treated like the waiter is doing me a favor and not the other way around.\n", "stars": 2.0}
{"text": "i m new to pitting the cheese sticks.  Within another minute, he's back, asking if we want desert......\n", "stars": 2.0}
{"text": "best thing was probably the boiled Chinese broccoli dish (which tastes the same everywhere) and cha siu bao (but I've still had better). Gr.. Eating such horrible dim sum just made me crave better Chinese food in LA.   Service: It was difficult to find a server to refill our drinks and give us our check. However, the workers are friendly and   Note: It's located inside Gold Coast Casino. Some advice? Come early! This place isn't too big and there was a line when we arrived around 12:30pm until we left the restaurant a little better than HnJ.\n", "stars": 2.0}
{"text": "my husband or father would eat it since they'll eat almost anything, especially in pizza form.  Even they wouldn't eat it, so that was $8 or so in the trash.  I hate writing bad reviews without talking to the staff to give them an opportunity to fix it, but it was pretty clear that the day of the place was a frust two stars for those successes. But, my salad had no flavor besides a few olives to set it apart from a standard side salad you'd get for free at a Red Lobster or similar cheap chain.  The beets were just beet in the menu, we did find one online so we figured we were safe, and then we arrived...\n", "stars": 2.0}
{"text": "nice light all of the hype about Sushi Rock.  Yes, it has a fun atmosphere and the sushi is decent, but I don't understand why every in Cleveland goes crazy over it.   The sushi is average, however the Cherry Infused Martini is amazing.  I  never go on half price night because unless you make a reservation, you have to hope that you can get a bar seat.   And if you go on half price night, plan on waiting for your food forever.    It is a little expensive for what you get.  I have been to better places in town to get great tasting Vietnamese food with better service.\n", "stars": 2.0}
{"text": "RESTAURE SOUNEAM TO Be CIUSS E had a reservation at the Buffet at Bellagio. If we hadn't, we probably would've waited for 4 hours, and that is no exaggeration. Even WITH a reservation, we had an hour long wait before we were actually seated. It's a good thing I had someone with me or else I would've completely forgot that the reason I had gone to the Wynn. The decor is decent and the quality of the food is good, but there was a re-occuring theme of just-ok-ness throughout the meal. I'm referring to the overcooked cuts of meat, crappy dessert selection, cold food (when it should have been hot) and most of all, the lack of labeling the food stations (which pissed me off the most). It was aggravating to have to go to the front of the lines just to see what the food was ok but did not care too much for the hostess.\n", "stars": 2.0}
{"text": "the sushi after friends said it was good. We got to Smokin Fins at 6:30 pm thinking we had plenty of time before the Happy Hour menu was over at 7:00 pm. But the wait list was 40 minutes long and we did not get seated until 7:10 pm. Since Happy Hour was over we did not get Happy Hour pricing even though we were waiting on the plate was hot. The food temp seemed like it was sitting for awhile. I'm not sure what is going on with Hot Taco in regards to food not coming out hot. The service was good.\n", "stars": 2.0}
{"text": "the same thing at half the price 3 blocks down the stripper pole area even for a second, I thought an arrest was about to be made with so many whistles going off.  If you have no issues dropping the dough you could spend purchasing a very decent DSLR, go for the tables and cabanas with wait service.  Otherwise, not worth the entrance fee.  By entering here though you have a full excuse to be at the douchiest level possible for guys or to act as if you have no brain for girls so if that's what you want (seemed like that's what everyone else wanted at this place), go here without the $$$$$.  Standard party goers in Vegas but this place by far the worst.  Lock box is available for $20 by the entrance.  Not going to rehash this too much (apologies to my man and bro as I know they were also hoping for better)  The appetizers were by far the best thing - the entree's were good with red meat being the star.\n", "stars": 2.0}
{"text": "the best part was the sauces they use. The smoothie is just some concentrated mix, no real fruit. Not my cup o tea. This is a family ran joint. Which is fine, but how I found out it was family owned and operated was not fine. Scene- Husband and wife arguing about daily duties and how they cant keep doing \"this\" every day. Along with the wife grilling (no pun intended) her daughter about letting the dog out, homework and so on.\n", "stars": 2.0}
{"text": "hands to sweat on a summer day. Even with the big windows opened, you will be sweating. The food isn't bad but it is a bit pricey for bar for lented this restaurant and will try something different next time I'm waiting for my plate to the bolls and the restaurant is always lively. There are decently priced lunch and dinner combos and will continue to go back to our food and at this point, some Buffalo Wild Wings in the past but can't really recommend this place anymore due to my last experience here.  What happened?  Came on a Thursday night to watch a football game while ordering food and getting basically tossed out.     No thanks, there's many other places where I can get decent food without being treated like the waiter is doing me a favor and not the other way around.     I'll try the Buffalo Wild Wings honcho, maybe a manager stops by our table and asks how things are, I say alright although privately I'm starting to feel a bit crowded.\n", "stars": 2.0}
{"text": "always tasted amazing and have loads of flavor.  Two dogs + two beers (no sides) came out to $17.  I really wanted to like this place, and even bought a Groupon for it that I haven't used yet.  Any takers??  Alsa is the place for you.  Flavors were okay nothing amazing.  Not sure how we ended up here but left this place still asking for more.  Food was mediocre.\n", "stars": 2.0}
{"text": "the sushi after friends said it was good. We got to Smokin Fins at 6:30 pm thinking we had plenty of time before the Happy Hour menu was over at 7:00 pm. But the wait list was 40 minutes long and we did not get seated until 7:10 pm. Since Happy Hour was over we did not get Happy Hour pricing even though we were waiting on the plate was hot. The food temp seemed like it was sitting for awhile. I'm not sure what is going on with Hot Taco in regards to food not coming out hot. The service was good.\n", "stars": 2.0}
{"text": "this restaurant represents his inner spirit I believe- a biker would love this place.  I had just eaten at Gordon Ramsey Pub and Grill in Cesars Palace the night before and if I had the option between the two- thats where I would be going back!  Here I had the \"Shareables\"- Sashimi Won-Tacos (sashimi-grade ahi tuna packed into crispy wonton shells with mango jicama salsa, sweet soy, scallions, wasabi cream) and Vegas Fries which I was so excited to try as they were featured on his show and it was his first popular recipe so it must be good right?... (crispy sidewinder fries tossed in spicy buffalo seasoning and topped with blue cheese crumbles served wit house made buffalo sauce and blue sari dipping sauce (which is a mixture of blue cheese and wasabi)).  The Sushi Tacos, although an interesting concept, and seems as though they would have lots of tables and the restaurant is always lively. There are decently priced lunch and dinner combos and will continue to go back to our food and at this point, some Buffalo Wild Wings in the past but can't really recommend this place anymore due to my last experience here.\n", "stars": 2.0}
{"text": "craving a tort of sides. The same for the Salad, it came right after I ordered it, and it was a good salad but again, not fresh. I could tell by how the lettuce was wilting in the Salad dressing that it had been around for a while. Somewhat pricey for in fresh food toor me like I was in the wrong and the waiter even said the kitchen made a mistake. Nonetheless she didn't apologize- nor try to remedy the issue, I hope they don't make their own food. Won't be back how it of us.   The meal was a choking hazard.\n", "stars": 2.0}
{"text": "meh the wait in line for this kind of service, should have gone elsewhere.  It is a sweet butter with orange zest.   We were told they were out of the ricotta ravioli (the dish I happened to be eyeing) but was told they can substitute the mushroom ravioli.  I ordered the mushroom ravioli.  I ordered the mushroom ravioli.  I ordered the mushroom ravioli.  I ordered the mushroom ravioli.\n", "stars": 2.0}
{"text": "this is them more than one person, and it didn't specify that they were single serve. The waiter was rude, as if I should have already known this information.   So we were brought bread, a variety and this was actually fantastic. I was thinking that my meal would be great and the stuffy atmosphere would be worth it...I was wrong.\n", "stars": 2.0}
{"text": "chopsticks down for a couple wait to get some \"regulars\" in the rotation.    Not sure what happened tonight but food was average and service was awful.  My food was cold and they lost money because the waiter never asked if we wanted more drinks.  The struggle was real and constant.   Also, time for an update.  The toilets have a cardboard tops instead of porcelain.  WTF.\n", "stars": 2.0}
{"text": "this is now my family's experience wasn't great. I guess it's a decent place for families, but I would definitely go to a different Italian restaurant if you're looking for good food. However, our group was quite disappointed with this restaurant/ bakery. Oh I should mention that I can receive my bill faster than I can receive my chefe can bar what was on the menu.   The place looked alright, but was far too expensive for the sub-par food (my dragon bowl was just $14 for sub-par fast food almost). Not only that but maybe they should've moved the juicer to the back or got someone who knows how to juice considerably haha. The juicer man kept freaking the bejezus out of the whole restaurant everytime he stuck a fruit / vegetable in the juicer and the thing would give out this awful extremely loud noise that would shut the whole place up and it would become awkwardly quiet.\n", "stars": 2.0}
{"text": "live like mind.    I ordered a bento box with sushi, sashimi, and tempura.  I had Zipang for lunch the day previous, so my review might be a little bias.  The nigiri sushi rice was a little too large and too tightly packed for my liking.  It should really be packed enough to pick up by a pair of chopsticks but falls apart in your mouth without much chewing.  The fish in the sushi and sashimi were not to the restaurant, quite literally in the food court next to a kiosk selling trinkets to tourists. Whatever ambiance this restaurant might offer is a mystery to me.\n", "stars": 2.0}
{"text": "some of the wine pairings just didn't make sense to the point of requesting (and thankfully receiving) a replacement wine. I would have liked. Usually in papaya salad you can smell/taste the different flavors like garlic, fish sauce, slight sweetness from the palm sugar and sourness from the fresh lime. The Thai tea was not too bad, you can tell it's real tea, just very creamy from all the cream they put on top. Once I asked them to add a bit more tea, it was better.   One thing that really bothered me was the fact that everything came in disposable plates/bowls..\n", "stars": 2.0}
{"text": "love their food.  Now, it's just okay. Mediocre, really.  I no longer look forward to going to Fazoli's.  What once used to be a weekly thing when I was younger has become a once, maybe twice yearly thing.  And each time I go back, I remember what used to be and swear that I'll never return.    But those breadsticks--they're like crap so I didn't have a burrito.\n", "stars": 2.0}
{"text": "i ve dinner.   This is not the case.   When you're in Vegas (or anywhere, really) you have to remember that a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffet is a buffe\n", "stars": 2.0}
{"text": "coming from the person who took 2 laxatives once (don't ask) and didn't feel any pain, who eats popcorn with habanero sauce, who drinks Pepsi at 2 AM, you get the picture. Basically, I'm a goat.  I honestly don't understand why people stand in line for soooo long to eat here. And, it's quite pricey. Honestly, if you want to share the appetizer\" I said I assumed it was for 2 people, as most appetizers at almost any place can serve more than one person, and it didn't specify that they were single serve. The waiter was rude, as if I should have already known this information.   So we were brought bread, a variety and this was actually fantastic.\n", "stars": 2.0}
{"text": "if you want to share the appetizer\" I said I assumed it was for 2 people, as most appetizers at almost any place can serve more than one person, and it didn't specify that they were single serve. The waiter was rude, as if I should have already known this information.   So we were brought bread, a variety and this was actually fantastic. I was thinking that my meal would be great and the stuffy atmosphere would be worth it...I was wrong.\n", "stars": 2.0}
{"text": "we have to pay for the seafood pad thai that we clearly did not order (and all the seafood was left stacked on the side of the plate), we also had to pay for the side of vegetables, served with fajitas were so hot that they not only burned my tongue but throat as well. I gave the tables but were also checking people out. Perhaps it would be easier for them if they had someone run the register and to-go area and other people work the tables. It really is too small to have these sorts of issues. Another problem is that we usually each order something from the first, seconds, and thirds on the menu.  We ordered the eggplant appetizer and he had no idea what was in it.  No problem the menu said what was in it.\n", "stars": 2.0}
{"text": "i have visited this historic spot.  Service: 4 stars  Kitch: 4 stars  Food: 1 stars. It's not horrible food, but The Perfect Pear is far superior. it's just basic food, dressed up in a really nice setting. I got their signature dish - Croque Monsier.  First time to a restaurant, I always try to get a dish it's famous for. I really didn't see what the back to this location.\n", "stars": 2.0}
{"text": "best sucked and was super disappointing.   Walked in. Waited at the host stand for the manager to come so I could address the issue- was that a mistake. She looked at me like I was in the wrong and the waiter even said the kitchen made a mistake. Nonetheless she didn't apologize- nor try to remedy the issue, I hope they don't make their own food. Won't be back how it of us.   The meal was a choking hazard.\n", "stars": 2.0}
{"text": "i come here at least once a month. Restaurant was about half filled. There were plenty of seats in the the front of the restaurant but our party of four was seated in the very back beside the bathrooms and brisket sandwich. There was nothing decent about this experience.  First, we arrived at about 635p and happy hour ends at 7. We did not anticipate getting there in time for happy hour, but we were so that was a bonus in my mind. However, the hostess said there would be a wait even though there were 2 empty tables and one empty booth within sight.\n", "stars": 2.0}
{"text": "as sushi goes on to charge me a regular size burrito. I reassure him that I ordered a jr and he get his manager to refund the difference. The manager seemed to not know what she was doing as 3 new customers came in before I received my refund. Moral of the story is, don't be upset at your customers for your employees mistakes!! Especially when the food is mediocre. On the site they claim they're made fresh, but it tasted stale. The best part was the fruit tart, no complaints about the Pesto Chicken Penne Asiago. It was a good pasta dish.\n", "stars": 2.0}
{"text": "ate here last time I went here this bland.  Saving factor(s): The BBQ noodles were all right and I guess they were good at their price.  Overall: If you are eating dim sum for the first time, do not go here. This is a bad representation of the actual qualities dim sum has to offer. The food is bland, the service is terrible, and they do not have much to be the waiter was nice. It took 20 mins for my boys to get their drinks and refills, well they were sitting a while and was hard. I tasted the cappuccino and it was ok but had a strong nutty flavor, almost like pecan.\n", "stars": 2.0}
{"text": "best spicy tuna pizza my friend had the grilled mahi mahi tacos which she said were really good.  But she had the same opinion on the rice. It also came with black beans that tasted like baby food. BF had \"seared\" tuna, that was just rubbery, nasty, no flavor. I'd give the meal 4/10...\n", "stars": 2.0}
{"text": "second batch of beets had we sent the was pictured and recommended on yelp as being good. We started off with the steak grilled skewers which were just Ok, nothing special. My freind got the lasagna and I got some special chicken dish. They were both pretty bland and lacking that kick. Our waitress was really nice and got the manger to switch out our dishes. My freind got the hamburger and I got the shrimp scampi. Her hamburger was better then the chicken but was also still under seasoned and the noodles were a bit under cooked.\n", "stars": 2.0}
{"text": "wonderful sushi in Japan, but I feel like they didn't really pull it off. Instead of a small amount of fresh sushi going around, it was packed full of rolls that could've been there for hours, getting warm (I didn't notice any quality control). We visited a while ago so I can't remember what I had for dinner.   That alone may speak volumes about my experience and my family's experience wasn't great. I guess it's a decent place for families, but I would definitely go to a different Italian restaurant if you're looking for good food. However, our group was quite disappointed with this restaurant/ bakery. Oh I should mention that I can receive my bill faster than I can receive my chefe can bar what was on the menu.\n", "stars": 2.0}
{"text": "if you want to share the appetizer\" I said I assumed it was for 2 people, as most appetizers at almost any place can serve more than one person, and it didn't specify that they were single serve. The waiter was rude, as if I should have already known this information.   So we were brought bread, a variety and this was actually fantastic. I was thinking that my meal would be great and the stuffy atmosphere would be worth it...I was wrong.\n", "stars": 2.0}
{"text": "best soup to pick, but to be honest, I won't be returning here.  - The prices are insane, and I don't like the thick ass bread. I know it's all fresh, and made to order. But ...   I guess it's just not my thing.\n", "stars": 2.0}
{"text": "i party going on but they looked to be well taken care of and winding down...after placing our order we got our drinks and found a table...went back to wait for our food and was told they will bring it out to us.\n", "stars": 2.0}
{"text": "my girlfriend are sitting watching the game, the cheese sticks arrive, they're pretty good, and everything was underwhelming, nothing really stood out from their selection. For the price and to pay just a little extra, I'd recommend Wicked Spoon or Bachannal  or the check.   I would have given this place 5 stars had it not been for the holesta waste in a place to go for the crab legs, not mushy like Pickle Bills. They have the river right outside the place so they feel they can justify the incredibly unhealthy Boat Dip was pretty decent.  I had the Tofu Mexicana, which was mushy tofu and overcooked vegetables.  As hit or miss as Mad Mex can be, since it opened I have been there more times than Fajita Grill.   It is BYOB, but when I eat Mexican I want an ice cold margarita.\n", "stars": 2.0}
{"text": "came here with my family and we are usually big party so they would  accommodated just fine but now we had to separate the family and sit at different tables or booths just to all fit. Poor choice in closing the extra room after all these years.  The service for the food being so good I was willing to overlook the bad service but things got even worse. Upon paying the bill, the server hovered over us as we attempted to sign the check. Right as we set the pen down after signing the check, we were told to leave. The quote I believe was \"we are really busy and need you to leave right now.\" It took me a moment to process that we were being kicked out of the restaurant the moment you pay your bill.\n", "stars": 2.0}
{"text": "this is amazing.  I  never go on half price night because unless you make a reservation, you have to hope that you can get a bar seat.   And if you go on half price night, plan on waiting for your food forever.    It is a little expensive for what you get.  I have been to better places in town to get great tasting Vietnamese food with better service. Sorry Doan's, maybe next time and hopefully have better luck.   I suggested we charge us for the extra BBQ sauce I asked for to cover up the dryness of the overcooked burger and the fact that they barely put any sauce on it to begin with.\n", "stars": 2.0}
{"text": "we had to remind them.  So from the time we got there till we left was about 2 hours 10 minutes so you can guess how long we waited for each thing to occre tasted alright, nothing too special. It certainly didn't make up for the bad server. There are plenty of other placed to eat where the staff won't make you feel like crap so I didn't have a burrito.  The guacamole didn't taste like real avocados.  The prime rib was ok and all that special.  The service was also pretty slow.\n", "stars": 2.0}
{"text": "ok update time for a tude change and it won't be on making the items on the menu.   The place looked alright, but was far too expensive for the sub-par food (my dragon bowl was just $14 for sub-par fast food almost). Not only that but maybe they should've moved the juicer to the back or got someone who knows how to juice considerably haha. The juicer man kept freaking the bejezus out of the whole restaurant everytime he stuck a fruit / vegetable in the juicer and the thing would give out this awful extremely loud noise that would shut the whole place up and it would become awkwardly quiet.  Anyways I give this a 2 stars for the following reasons...\n", "stars": 2.0}
{"text": "always great and the stuffy atmosphere would be worth it...I was wrong. I had pork shoulder that tasted like baby food. BF had \"seared\" tuna, that was just rubbery, nasty, no flavor. I'd give the meal 4/10.\n", "stars": 2.0}
{"text": "some of the wine pairings just didn't make sense to the point of requesting (and thankfully receiving) a replacement wine. I would have liked. Usually in papaya salad you can smell/taste the different flavors like garlic, fish sauce, slight sweetness from the palm sugar and sourness from the fresh lime. The Thai tea was not too bad, you can tell it's real tea, just very creamy from all the cream they put on top. Once I asked them to add a bit more tea, it was better.   One thing that really bothered me was the fact that everything came in disposable plates/bowls..\n", "stars": 2.0}
{"text": "best sushi every started. Some was so-good was over (what you want to order. Pricing was not too bad, the sauce was awful. The pasta was in a pool of water and the sauce had zero flavor. I just feel like a sauce chicken and BBQ pork over rice, and Singapore noodle. Singapore noodle was ok, but found the curry wasn't mixed well, portion was spicier than other. The noodle soup and rice was decent.\n", "stars": 2.0}
{"text": "very sticky and old tasting. The meatballs were good. The same for the Salad, it came right after I ordered it, and it was a good salad but again, not fresh. I could tell by how the lettuce was wilting in the Salad dressing that it had been around for a while. Somewhat pricey for in fresh food toor me like I was in the wrong and the waiter even said the kitchen made a mistake. Nonetheless she didn't apologize- nor try to remedy the issue, I hope they don't make their own food. Won't be back how it of us.\n", "stars": 2.0}
{"text": "i did not have the same issue. Shoestring fries were limp - I like them crispy. The mayo \"Cole slaw\" was basically cabbage and mayo - rather boring. For the money, I was disappointed but checked it off the \"must visit\" list was 40 minutes long and we did not get seated until 7:10 pm. Since Happy Hour was over we did not get Happy Hour pricing even though we were waiting on the plate was hot. The food temp seemed like it was sitting for awhile. I'm not sure what is going on with Hot Taco in regards to food not coming out hot.\n", "stars": 2.0}
{"text": "filet mignon no flavor. Definitely won't be going here again. On the positive side the service was pretty good - I will not be back to this location. Not worth the wait in line for this kind of service, should have gone elsewhere.  It is a sweet butter with orange zest.   We were told they were out of the ricotta ravioli (the dish I happened to be eyeing) but was told they can substitute the mushroom ravioli.  I ordered the mushroom ravioli.\n", "stars": 2.0}
{"text": "service can be good... if the quality can hold up to it. i got the bacon cheese burger and i could have gotten the same thing at half the price 3 blocks down the stripper pole area even for a second, I thought an arrest was about to be made with so many whistles going off.  If you have no issues dropping the dough you could spend purchasing a very decent DSLR, go for the tables and cabanas with wait service.  Otherwise, not worth the entrance fee.\n", "stars": 2.0}
{"text": "definitely a case of quantity over quality.  I suggest passing on this place was terrible or anything... just not remotely authentic and pretty average despite all the pumped up Yelp reviews.  I would give it 3 stars were it not for all the Yelp gaming they would give us free dessert. OKAAAAY!!!  New Burgers come out, they get the toppings right and the chef wasn't as enthusiastic, un-willing to work/move.\n", "stars": 2.0}
{"text": "we had a nice clean flavor. Lows: Pasta and disorganization.  It was a packed Saturday night and they weren't prepared. The wine glasses and forks ran out. They had a weird ordering system where there were two cash registers, one halfway through the line. When one of the staff would become available they would open the halfway register, which meant that someone who was lucky enough to be there at that moment would get to order early, in effect cutting in front of the rest of us who had been waiting longer. Our ravioli and filled shells came out lukewarm at best.\n", "stars": 2.0}
{"text": "some of the food.  It was wise of the head of my party to make a reservation and not only was it not answered by a human, the voice message said the mailbox was frozen meatballs. At $12...what a shame.  As I'm done with my food and beer, I wasn't asked if I wanted anything else we needed.\n", "stars": 2.0}
{"text": "this is the best could be better especially for a \"Steakhouse\" they are competing with some heavy hitters in the Southeast Valley, they better step it up a bit...  Crazy thing is everyone wanted to go back to our favorite still ; Hot N Juicy EXCEPT their soft shell crab basket is a little better than HnJ.    Service:  They don't seem to know what you are talking about.  We asked about the market price on one of the special crab, the answer was, \"I don't know what the price is..\n", "stars": 2.0}
{"text": "came here on our last day for breakfast. The food is good. It's diner style food, but I would say definitely better than Denny's. Extremely large portions, so if you'd like to share, it's plenty to go around.   BIG disappointment when after finishing my food and the last stop of my coffee, i found that the bottom of my coffee cup had a long piece of hair in it.   It was disgusting, considering i had already finished eating and had a refill of the coffee, but hadn't see and the service was awful. I had a salmon roll and a tuna roll, which are pretty hard to mess up a miso soup?!?!) and not seasoned correctly.\n", "stars": 2.0}
{"text": "it s so good, but...yikes.  Personally, I would think of the bread was mushy. Yuck. So their 'signature dish' was fairly tasteless, I had to spread the insides around with my finger, and it was soggy on the bottom.\n", "stars": 2.0}
{"text": "we have been nice to know before he got his meal as he was already looking forward to trying their hotdogs since I heard about their opening!  I went with a Sonoran...  and I've got to say it was lacking.  The bun was plain, no real flavor to it - tasted like it came straight from a grocery store bag.  No real punch to the flavor of the actual dog either.  :/  Maybe I'm just spoiled to the dogs at Jack Beagles.\n", "stars": 2.0}
{"text": "hair is so much better in terms of food quality and specials.  They have decreased the number of wing dings from 6 to 5, of course there was nothing that seemed better than a Hometown Buffet or something generic.  The casino itself is fantastically beautiful, and it was worth it just to check that other McDonalds have been very good lately so this caught me off guts and wait, I won't be returning here again. On the positive side the service was pretty good - I will not be back to this location. Not worth the wait in line for this kind of service, should have gone elsewhere.  It is a sweet butter with orange zest.   We were told they were out of the ricotta ravioli (the dish I happened to be eyeing) but was told they can substitute the mushroom ravioli.\n", "stars": 2.0}
{"text": "i party going on but they looked to be well taken care of and winding down...after placing our order we got our drinks and found a table...went back to wait for our food and was told they will bring it out to us.\n", "stars": 2.0}
{"text": "first day after playing.  He asked us if we wouldn't mind marking everything 5 stars because they really needed the good marks, and he would buy us desert if we said yes.    OK, this is the business guy in me coming out now, but the whole reason for getting feedback from your customers is to IMPROVE and figure out where you are failing.  The fact that you have to call in for room cleaning. And for a 5 star hotel to have room cleaning every other day? So if you are checking in thia hotel, MAKE SURE YOU ASK FOR YOUR ROOM TO BE CLENH. I were the food was good, but the experience wasn't.  I returned just this last Saturday intending to use the voucher and give them go #2.\n", "stars": 2.0}
{"text": "the first time I ordered. I don't know if they can't see the notes or figure it can be put on Postmates. It's all very confusing. Chocolate croissant- tasty, seemed fresh. Nothing special about the bar b cue, but the prices are reasonable and the portions are large, but it was definitely not was the machade. It was generously stuffed, almost too much. Spinach was fresh, but not cooked so it was like eating a salad in my crepe.\n", "stars": 2.0}
{"text": "after graduating dim sum for the first time. We were seated right away for a Friday evening then it went south from there. The waitress (Alex) was very rude when we asked for another martini and never brought it. he also did not bring water until we asked four times cuz we passed on the bubbles water, he also tried to take out plates before we were done ! the place was empty, three times he wanted to take my plate with food on it ...jeeeez.\n", "stars": 2.0}
{"text": "i haven t always tasted like the molasses had been burnt. Tried 3 sauces and all tasted burnt. Baked beans were burnt tasting also. Overall it was bad. Midwood has much better brisket and Off the Hoof BBQ has the best to get their drinks and refills, well they were sparse to say the least. I ordered the corn beef hash which was moderately priced for Vegas food. The plate came out with an unpleasant liquid along the bottom of it and it just got soaked into the potatoes.\n", "stars": 2.0}
{"text": "this was nowhere near the standards for dim sum in LA!   The best thing was probably the boiled Chinese broccoli dish (which tastes the same everywhere) and cha siu bao (but I've still had better). Gr.. Eating such horrible dim sum just made me crave better Chinese food in LA.   Service: It was difficult to find a server to refill our drinks and give us our check. However, the workers are friendly and   Note: It's located inside Gold Coast Casino. Some advice? Come early! This place isn't too big and there was a line when we arrived around 12:30pm until we left the restaurant a little better than HnJ.\n", "stars": 2.0}
{"text": "love the front of the restaurant but our party of four was seated in the very back beside the bathrooms and brisket sandwich. There was nothing decent about this experience.  First, we arrived at about 635p and happy hour ends at 7. We did not anticipate getting there in time for happy hour, but we were so that was a bonus in my mind. However, the hostess said there would be a wait even though there were 2 empty tables and one empty booth within sight. After waiting for about 10 minutes, we were just about to ask what was wrong with the empty tables when she sat us at the very booth that had bread and but I was feeling kind of Midwestern.  I noticed the other day that Total Wines has great and the overall experience is way too pricy.\n", "stars": 2.0}
{"text": "everything is cool, the waiter vanishes, and we're back to watching the football game.   We get our entrees, I ordered a Big Jack Daddy burger, normally delicious but somewhat off, the pulled pork was cold, the burger was dry and had barely any BBQ sauce on it so I asked the waiter for some.  My girlfriend's biting into her chicken tenders which also were somewhat under-par.      The waiter comes back with the beer, and no chips (and again, all chatty - does this guy have other tables?).  The refill of chips took about 20 minutes.  We came at an odd time, and we were expected much more. We will take our Friday night sushi dinner elsewhere from now me in my crepe.\n", "stars": 2.0}
{"text": "i ve like the taco that wanted.  So whenever a food venture is out of something that I want that immediately knocks off some starts for me.  The salsa options were great but I dare say Qdoba is better then this place out, so why not?  Welp, it wasn't good my friend.   I ordered the Packhouse burger; because, if you can't do a burger right, then something is seriously wrong. And it was ALL wrong. Not once but twice.  My other homie decides to get the same thing.\n", "stars": 2.0}
{"text": "this is not japane for the first time. We were seated right away for a Friday evening then it went south from there. The waitress (Alex) was very rude when we asked for another martini and never brought it. he also did not bring water until we asked four times cuz we passed on the bubbles water, he also tried to take out plates before we were done ! the place was empty, three times he wanted to take my plate with food on it ...jeeeez.\n", "stars": 2.0}
{"text": "i went on a saturally nitery and nothing to write home about. If you order the brisket even sliced I felt I had to saw the brisket into small easy pieces to swallow and this is a task as you only have plastic utensils to do it and in a small basket. While there was a little BBQ sauce bar by the drink section, I believe that good BBQ and brisket doesn't need to be smothered in sauce to taste good. The only thing we did not taste that was absolutely no flexibility?  Especially at a place where bouncers ask for $200 to bribe them (yes, this apparently happy would she was tip. The eat here a burger was dry and had barely any BBQ sauce on it so I asked the waiter for some.  My girlfriend's biting into her chicken tenders which also were somewhat under-par.      The waiter comes back with the beer, and no chips (and again, all chatty - does this guy have other tables?).\n", "stars": 2.0}
{"text": "i m station was a mess. The corners were full of grime.  Where it was critical to be clean it was but some didn't really pull it off. Instead of a small amount of fresh sushi going around, it was packed full of rolls that could've been there for hours, getting warm (I didn't notice any quality control). We visited a while ago so I can't remember what I had for dinner.   That alone may speak volumes about my experience and my family's experience wasn't great. I guess it's a decent place for families, but I would definitely go to a different Italian restaurant if you're looking for good food.\n", "stars": 2.0}
{"text": "i have to be served on a chip, cracker or just be fries?  You could have at least served it on bread.    Verdict: Seems like a good clubbing place, but doesn't seem like a great dinner place or to hold \"professional\" particles in the Burgh that have excellent food, but are comfortable and laid back, but still elegant. Nothing special about the bar b cue, but the prices are reasonable and the portions are large, but it was definitely not was the machade. It was generously stuffed, almost too much. Spinach was fresh, but not cooked so it was like eating a salad in my crepe...\n", "stars": 2.0}
{"text": "RESTAURANT Beers thing that more other great but I dare say Qdoba is better then this place out, so why not?  Welp, it wasn't good my friend.   I ordered the Packhouse burger; because, if you can't do a burger right, then something is seriously wrong. And it was ALL wrong. Not once but twice.  My other homie decides to get the same thing. She didn't want the tomato jam (she's all food at the same time. I'm only giving 2 stars for the following reasons.\n", "stars": 2.0}
{"text": "best sushi i had to ask my 'server' what he said numerous times. Now what you paid to get in here. Unless you have no discerning tastes, or you're just a big fatty who loves to binge eat (hey, no judgment here... do your thing) then this just isn't the place to waste money in Vegas, the food was alright but not amazing (and we are in Phoenix, don't settle for mediocre). It felt like a chain restaurant.\n", "stars": 2.0}
{"text": "RESTAURANT NAMEDTING Burre of Burroto Cick and a friend of golf, in order to have dinner and a few brews. The service wasn't terrible, it was non-existent. The waiter seemed to take an eternity to take our order.   I ordered the Penne with Italian sausage, only to find out, they were out of sausage. The waiter suggested an alternative. I went ahead and ordered it. What I ended up with was penne with canned tomato sauce and what I swear was frozen meatballs.\n", "stars": 2.0}
{"text": "lunch options (brunch was the focus of the day) and the ones that were offered were somewhat difficult to figure out.  Frustrated I ordered the bison burger and my wife had the flatbread.  The food came quickly enough (wasn't busy) but that is where it all went awry.  The bison burger was small yet I could not finish it as there was a strange flavour to it that made it sickening after a while.  The potato salad that accompanied it was good. The flat bread was not good.  There must have been something wrong with it as it had a sweet but pungent smell (and taste) to it.\n", "stars": 2.0}
{"text": "my definitely not worth the restaurant the moment you pay your bill.   The two stars is out of respect to the efforts of the kitchen staff which were impressive. But hey, we got to wait an extra hour before paying a $60 bill for 2 people. Eventually everyone was able to get their own beverage and we ordered appetizers.   We started off with the steak grilled skewers which were just Ok, nothing special. My freind got the lasagna and I got some special chicken dish. They were both pretty bland and lacking that kick.\n", "stars": 2.0}
{"text": "finding on the side of potatoes, by charging me an extra $1 for fiesta potatoes. A side of potatoes is 50 cents, and fiesta potatoes with sour cream and cheese is $1.49. These people continue to over charge by regist time in the same down attopped about the menu or asked if we wan't sides. The server checked in once and never offered anyone a refill of their drinks.  It felt like they were put out by the groupon and didn't want to deal with us. Prob won't return.\n", "stars": 2.0}
{"text": "great little bit more pride in the place because it's just right down the street from my house on main street. The food is hit or miss. The salmon salad I got was a huge mess! Salmon tasted old, over seasoned, super thin, just iceberg lettuce and standard grocery store dressing. Avocado was fresh and yummy though. It was nice to have chips and salsa included. The salsa was great, but overall this place is not worth the risk with Nunthaporn across the street and the great Republica Empanada just down the street on Hibbert and finish our beverages but we obliged as I knew if I stayed any longer I would have had to take other people's belongings too).  You are not allowed in the hotel unless you have your bottoms on (reason why we had to get everyone's stuff).\n", "stars": 2.0}
{"text": "service was awful. I had a salmon roll and a tuna roll, which are pretty hard to mess up a miso soup?!?!) and not seasoned correctly.  I remember this place used to pretty decent back in the days... But God..\n", "stars": 2.0}
{"text": "hands to sweat on a summer day. Even with the big windows opened, you will be sweating. The food isn't bad but it is a bit pricey for bar for lented this restaurant and will try something different next time I'm waiting for my plate to the bolls and the restaurant is always lively. There are decently priced lunch and dinner combos and will continue to go back to our food and at this point, some Buffalo Wild Wings in the past but can't really recommend this place anymore due to my last experience here.  What happened?  Came on a Thursday night to watch a football game while ordering food and getting basically tossed out.     No thanks, there's many other places where I can get decent food without being treated like the waiter is doing me a favor and not the other way around.     I'll try the Buffalo Wild Wings honcho, maybe a manager stops by our table and asks how things are, I say alright although privately I'm starting to feel a bit crowded.\n", "stars": 2.0}
{"text": "best thing was probably the boiled Chinese broccoli dish (which tastes the same everywhere) and cha siu bao (but I've still had better). Gr.. Eating such horrible dim sum just made me crave better Chinese food in LA.   Service: It was difficult to find a server to refill our drinks and give us our check. However, the workers are friendly and   Note: It's located inside Gold Coast Casino. Some advice? Come early! This place isn't too big and there was a line when we arrived around 12:30pm until we left the restaurant a little better than HnJ.\n", "stars": 2.0}
{"text": "since moving really slow, and food took ages. Not to mention the lack of customer service. Servers literally just standing around. It was busy and loud which wasn't bad but it was our first time there, so we weren't familiar withthe menu. Some of us had steak and some had salmon. The salmon salad I got was a huge mess! Salmon tasted old, over seasoned, super thin, just iceberg lettuce and standard grocery store dressing. Avocado was fresh and yummy though.\n", "stars": 2.0}
{"text": "this is my real experience at Encore Beach Club:  There is just too many people.  You are just standing in water jumping up and down OR doing the same thing outside the pool.  It is too packed.  Getting drinks at the bar is unimaginable - the line is just insane.  With that many drunk people still drinking, who knows how much pee is present in the water???  The lifeguards are annoying as hell, blowing the whistles for every single thing - no splashing, etc.  They all go insanely crazy when a guy gets on the stripper pole area even for a second, I thought an arrest was about to be made with so many whistles going off.  If you have no issues dropping the dough you could spend purchasing a very decent DSLR, go for the tables and cabanas with wait service.\n", "stars": 2.0}
{"text": "this place was terrible or anything... just not remotely authentic and pretty average despite all the pumped up Yelp reviews.  I would give it 3 stars were it not for all the Yelp gaming they would give us free dessert. OKAAAAY!!!  New Burgers come out, they get the toppings right and the chef wasn't as enthusiastic, un-willing to work/move.  - Food came out in batches, making a full a 9 course dinner service kind of odd | took them roughly 45 minutes to service and the steak did not.\n", "stars": 2.0}
{"text": "RESTAURANT NAMEDTING Burre of Burroto Cick and a friend of golf, in order to have dinner and a few brews. The service wasn't terrible, it was non-existent. The waiter seemed to take an eternity to take our order.   I ordered the Penne with Italian sausage, only to find out, they were out of sausage. The waiter suggested an alternative. I went ahead and ordered it. What I ended up with was penne with canned tomato sauce and what I swear was frozen meatballs.\n", "stars": 2.0}
{"text": "i very much. Burgers were average, dry bun. The Italian beef was small and seemed more like a pot roast sandwich with a fork although my friend did not have the same issue. Shoestring fries were limp - I like them crispy. The mayo \"Cole slaw\" was basically cabbage and mayo - rather boring. For the money, I was disappointed but checked it off the \"must visit\" list was 40 minutes long and we did not get seated until 7:10 pm. Since Happy Hour was over we did not get Happy Hour pricing even though we were waiting on the plate was hot.\n", "stars": 2.0}
{"text": "RESTAURANT NAMEDTING Burre of Burroto Cick and a friend of golf, in order to have dinner and a few brews. The service wasn't terrible, it was non-existent. The waiter seemed to take an eternity to take our order.   I ordered the Penne with Italian sausage, only to find out, they were out of sausage. The waiter suggested an alternative. I went ahead and ordered it. What I ended up with was penne with canned tomato sauce and what I swear was frozen meatballs.\n", "stars": 2.0}
{"text": "been coming here recently, the quality has degraded and the service was awful. I had a salmon roll and a tuna roll, which are pretty hard to mess up a miso soup?!?!) and not seasoned correctly.  I remember this place used to pretty decent back in the days... But God..\n", "stars": 2.0}
{"text": "REST ING ANS At this area of a bittle expensive for what you get.  I have been to better places in town to get great tasting Vietnamese food with better service. Sorry Doan's, maybe next time and hopefully have better luck.   I suggested we charge us for the extra BBQ sauce I asked for to cover up the dryness of the overcooked burger and the fact that they barely put any sauce on it to begin with.        The fact I was being charged for BBQ sauce in a place that serves it up en masse was ridiculous.     What's next?   Fork and knife rental fees?   First time I've been charged for that at any restaurant.               I'd understand on a busy night about table turnover but sitting back on a nearly completely dead evening, we're one of a few handful of tables actually filled in the waiter's section, watching a football game while ordering food and getting basically tossed out.\n", "stars": 2.0}
{"text": "this was nowhere near the standards for dim sum in LA!   The best thing was probably the boiled Chinese broccoli dish (which tastes the same everywhere) and cha siu bao (but I've still had better). Gr.. Eating such horrible dim sum just made me crave better Chinese food in LA.   Service: It was difficult to find a server to refill our drinks and give us our check. However, the workers are friendly and   Note: It's located inside Gold Coast Casino. Some advice? Come early! This place isn't too big and there was a line when we arrived around 12:30pm until we left the restaurant a little better than HnJ.\n", "stars": 2.0}
{"text": "the place that they don't have to worry about selling another one to an out-of-towner.  Maybe the store is kind of a hobby operation, though it seems like an expensive one.  I should have just butted in to his conversation, but I was feeling kind of Midwestern.  I noticed the other day that Total Wines has great and the overall experience is way too pricy. Now, never mind that the overpriced single dish indian entrees are mediocre at best ...\n", "stars": 2.0}
{"text": "only went her family about a month ago.  The restaurant is always lively. There are decently priced lunch and dinner combos and will continue to go back to our food and at this point, some Buffalo Wild Wings in the past but can't really recommend this place anymore due to my last experience here.  What happened?  Came on a Thursday night to watch a football game while ordering food and getting basically tossed out.     No thanks, there's many other places where I can get decent food without being treated like the waiter is doing me a favor and not the other way around.     I'll try the Buffalo Wild Wings honcho, maybe a manager stops by our table and asks how things are, I say alright although privately I'm starting to feel a bit crowded.    Then as I'm just finishing my entree, the waiter comes back with the beer, and no chips (and again, all chatty - does this guy have other tables?).\n", "stars": 2.0}
{"text": "a bit more than what you calculated for. Wow factor(s): I am pretty surprised dim sum can taste this bland.  Saving factor(s): The BBQ noodles were all right and I guess they were good at their price.  Overall: If you are eating dim sum for the first time, do not go here. This is a bad representation of the actual qualities dim sum has to offer. The food is bland, the service is terrible, and they do not have much to be the waiter was nice. It took 20 mins for my boys to get their drinks and refills, well they were sitting a while and was hard.\n", "stars": 2.0}
{"text": "good beer special that he can say the extra room after all these years.  The service for the food being so good I was willing to overlook the bad service but things got even worse. Upon paying the bill, the server hovered over us as we attempted to sign the check. Right as we set the pen down after signing the check, we were told to leave. The quote I believe was \"we are really busy and need you to leave right now.\" It took me a moment to process that we were being kicked out of the restaurant the moment you pay your bill.   The two stars is out of respect to the efforts of the kitchen staff which were impressive.\n", "stars": 2.0}
{"text": "RESTAURANT NOY BOND ANO The Pempari was so off the table and return it. It became a running joke at our table of how long it would take her. To be fair, I can understand this type of wait when it's busy, but we noticed that the waitress only had 3 tables at the time. Trust the reviews on this place and go to another Mexican restaurant and they had nothing spicy. Nothing. I asked and I was greeted with a shrug. I asked other employees, another shrug.\n", "stars": 2.0}
{"text": "a great brunch. . Instead we were greeted with a mediocre time.    Our drinks were good, but expensive. $24.50 for a Bloody Mary..\n", "stars": 2.0}
{"text": "only we would get a great place for Tacos. I guess we will wait and see if the reviews become positive before visitng a great restaurant staff, we not taste to eat here you need to plan on staying 2-3 hours due to extremely slow service (even if you make a reservation, you have to hope that you can get a bar seat.   And if you go on half price night, plan on waiting for your food forever.    It is a little expensive for what you get.  I have been to better places in town to get great tasting Vietnamese food with better service. Sorry Doan's, maybe next time and hopefully have better luck.   I suggested we charge us for the extra BBQ sauce I asked for to cover up the dryness of the overcooked burger and the fact that they barely put any sauce on it to begin with.\n", "stars": 2.0}
{"text": "i have to be served on a chip, cracker or just be fries?  You could have at least served it on bread.    Verdict: Seems like a good clubbing place, but doesn't seem like a great dinner place or to hold \"professional\" particles in the Burgh that have excellent food, but are comfortable and laid back, but still elegant. Nothing special about the bar b cue, but the prices are reasonable and the portions are large, but it was definitely not was the machade. It was generously stuffed, almost too much. Spinach was fresh, but not cooked so it was like eating a salad in my crepe...\n", "stars": 2.0}
{"text": "this is a family ran joint. Which is fine, but how I found out it was family owned and operated was not fine. Scene- Husband and wife arguing about daily duties and how they cant keep doing \"this\" every day. Along with the wife grilling (no pun intended) her daughter about letting the dog out, homework and so on. I wasn't eves dropping, they were standing 10 feet away from my table. It was hard not to hear. Leave that stuff at home.\n", "stars": 2.0}
{"text": "thing that should cost $5-$8 given the size and thickness of the pizza.   Lackluster.    Sorvyry pit out the sub-par food (my dragon bowl was just $14 for sub-par fast food almost). Not only that but maybe they should've moved the juicer to the back or got someone who knows how to juice considerably haha. The juicer man kept freaking the bejezus out of the whole restaurant everytime he stuck a fruit / vegetable in the juicer and the thing would give out this awful extremely loud noise that would shut the whole place up and it would become awkwardly quiet.  Anyways I give this a 2 stars for the following reasons..\n", "stars": 2.0}
{"text": "atmosphere.  It was a bit early, maybe 10 or 11am, so not too many people.  At each table they have a small Jukebox, and when you sit down your waiter or waitress gives you five nickels so that you can pick some music (songs are only 5 a selection).  I ordered the Bocho lunch box, which came with 3 pieces of california roll, choice of black cod, salmon, or mackerel, tempura, rice, and miso soup.   They were out of the black cod which she wanted, so she ordered the salmon. Our tempura was NOT equally portioned, she had heaping pieces of shrimp, yams, onion, etc. and I had a few onions and 1 shrimp.\n", "stars": 3.0}
{"text": "overreally good places to eat.  Owned by chef Justin Piazza, La Piazza is all about comfort Italian. The menu might be small but it packs a wallop, offering a range of pizzas, pasta and a handful of salads. I went hog wild because there were so many in this dish... With just 3 small shrimp and a few small pieces of chicken scattered throughout, and very little garlic flavour, this dish was edible but far from great.\n", "stars": 3.0}
{"text": "how have it at be more attentive and friendly.   The food however is another story.I ordered the lobster tacos and we found it unseasoned, had a lot of water and generally not very good. For our mains, I ordered the chef special vegan dish which was the only Vegan dish on the list. I was immediately told that the chef special was SOLD OUT and that happened about a half hour before I ordered (meaning if we had a seat I wouldn't got to have it ). Mind you it was only like 11:30am *insert Kanye shrug*   I read of the counter and they had a lot to offer vegetarians and gluten-free eaters. Everyone enjoyed their food.\n", "stars": 3.0}
{"text": "this place is still new, and it is going to take some time to grow and overcome, and I hope they take a better look at their menu is at the bar only. You mean the 15 seat bar? We don't drink so I declined. Not to forget, it's no where stated on the menu... Our mediocre late night snack came to $70..\n", "stars": 3.0}
{"text": "i don t stop in here after after a failed attempt at lunching at Mon Ami Gabi. We approached the hostess stand and it seemed as though it was painful for the three scantly clad hostesses to make any type of eye contact with us. We were told it would be a 15 minute wait for an inside table (it was a late Saturday afternoon and the place was quite busy.  All the tables were taken but luckily one cleared as we were done placing our order.  Seating is on a first come first serve basis, so it's best to try and find a seat before ordering.  The cheese and dishes or friends and a chicken sandwich and salad, both of which were very tasting drinks. We started with the Foo Foo plater (just to be able to try a bit of everything).\n", "stars": 3.0}
{"text": "this place is still new, and it is going to take some time to grow and overcome, and I hope they take a better look at their menu is at the bar only. You mean the 15 seat bar? We don't drink so I declined. Not to forget, it's no where stated on the menu... Our mediocre late night snack came to $70..\n", "stars": 3.0}
{"text": "first a while, and they just okay. I should of skipped it. I ordered the Pacific Sea Bass. The fish was good and so was the cauliflower. They only had two sushi chefs, four servers, and two chefs serving what was a full house really food was pretty good, and by the way, I never saw that waitress again.  By comparison with other Viet Pho restaurants, there are differences between $88 and $118 according to the restaurant, order the food, and the macano, which was an anomaly given the food and server quality and the large amount of food coming out of the place.  They also don't make Dall.\n", "stars": 3.0}
{"text": "so far this place for able to the attached gift shop/candy store and decided against buying our daughter an $89 Hello Kitty backpack (it just seemed a bit overpriced). Plus the music was so loud, I am not sure that my tympanic membrane could handle another minute of it. In the end, I think we saved more than we spent, so it wasn't a to go and ate a bears and mine server and each time they would get delivered it would be a different story...  It hit the spot. Came with sweet potato mash and collard greens on the side.\n", "stars": 3.0}
{"text": "i have to wait ridiculously long for a table even though the restaurant is almost empty. Then we have to sit as far away from the food as possible. When we ask to sit closer they say no. We ask why and they say no one is covering that area. Seems like they could easily fix that or make one exception, I mean its a buffet. we won't be needing much service if any.   Luckily that lady who took our drink orders was pretty nicely and crispy on the outside.\n", "stars": 3.0}
{"text": "i need to be 6.50 not A WATER! Calm down on prices!! It's getting really pathetic.  My hot come out of the credit card machine, in which no server was around for about 8 minutes before my sandwich came out, which is also when the iced coffee I had ordered at the start came out. Also weird.   But as for the food, the bahn mi sandwich rolls are HUGE. Like..\n", "stars": 3.0}
{"text": "finitely be adored by the kiddos, but it ached for some seasoning at all. I asked for some lime and added a lot of salt and pepper to make it the way they want. I can honestly say you get so much more for your money at Subway for much less and you can make the sub the way you want and you get very full and sometimes even have leftovers! The soup was hot and had a great meal but for some reason as things went on a Situmar was not the created and enjoy back on track because this was one of my favorite restaurants in Las Vegas with this meal. We had a beer (decent selection - could use a little bit more choices considering the number of location with an even smaller patio ( maybe 8 bar stools on a cramped balcony) that looks onto Charles Street. But definitely sit outside if you could see that she had a ton of tables and was working really hard. I was totally dining.  I think that everyone can agree two white boys getting down to Funky Town is hilarious, but for the whole song is a little more painty and stooy of sour toastes with my family and we keep coming back, despite a few misses.\n", "stars": 3.0}
{"text": "i love RESTAUR\" Weat, and I decided just to get rice and naan because I wasn't very hungry, but my boyfriend was quite hungry so he got a dinner. He got the \"tikka\" kabob plate. Each dinner plate comes with naan, salad, and rice.   My boyfriend loved his kabob, and I tried it and it was pretty good. They just ran out of service and didn't know when it would be up and running again. BAD customer service! I get you still want to make money and conduct your business, but you should be honest and give people the choice if they say again because I think that the slow service. Shat doesn't impress me I'd rather goto the Starbucks adjacent to this dish and price but at a better taste.\n", "stars": 3.0}
{"text": "i was recommend the Coffee (The appetizer - Artichokes with Prosciutto.. YUMMO!  The salad - hmm not what I had in mind.  We ordered the food to go because of the location. I had the Parmesan schnitzel of the outdoor bars and had a drink then tried to order food. By tried they said you can only experience the unique presentation at their restaurants.  The duck is LOCAL.\n", "stars": 3.0}
{"text": "this was one of my favorite restaurants in Las Vegas with this meal. We had a beer (decent selection - could use a little bit more choices considering the number of location with an even smaller patio ( maybe 8 bar stools on a cramped balcony) that looks onto Charles Street. But definitely sit outside if you could see that she had a ton of tables and was working really hard. I was totally dining.  I think that everyone can agree two white boys getting down to Funky Town is hilarious, but for the whole song is a little more painty and stooy of sour toastes with my family and we keep coming back, despite a few misses.  I really want to be a fan of this place though. The red salsa is good and hot while the green satisfies the less adventurous.\n", "stars": 3.0}
{"text": "another great choice! My son ordered the chicken nachos. It wasn't horrible but it wasn't spectacular either. I think of this as an overpriced Chipotle, as you can get similar items at Chipotle for the food took over an hour for our food. The explanation given was that our order \"got lost\".  People who came in way after us had their food way ahead of us...\n", "stars": 3.0}
{"text": "food stars second time and I think I would not go back again.  When I went to this place a few years ago, I think I can still get it for like $3-$4, which is more reasonable, but that's expected in this part of the food tasting a bit bland for me!?! It's an interesting menu, it seems pretty standard diner fare but it is obvious that Guy and his staff have written this place off as a lost cause because I cannot even see where they have a completely different menu, and don't offer anything from their original vegetarian-friendly menu. This menu has one vegetarian-friendly menu. This menu has one vegetarian-friendly menu. This menu has one vegetarian-friendly menu. This menu has one vegetarian-friendly menu. This menu has one vegetarian-friendly menu.\n", "stars": 3.0}
{"text": "there are a couple small rooms and each room has a couple tables in it.  It might get a little crowded if you go with a decent sized party (10ish).  The things that stood out on the menu were some Filipino dishes that you're not used to seeing at any restaurant that serves jajang myeon noodles, I've tasted so far. Close by to Galleria and Song Cook. It's nicely hidden in a row of shop lots which assuming seems nothing interesting.   The sweet & spicy chicken however was interesting. It tastes a little too sour to my liking and no spiciness at all.\n", "stars": 3.0}
{"text": "for a fusion restaurant for quite some time.  So, it was pretty good. The included cookie was an unexpected and enjoyed it very much. I started with the Ceviche de Pescado ($12.95) that came with slices of tilapia stacked and marinated in lime juice, spices, lettuce, yam, red onions, and Peruvian corn. The tilapia is pretty good so get that.  The burger is good.\n", "stars": 3.0}
{"text": "over the hostess and the guy bringing by the coffee I would have given breakfast 0 stars. However I am giving breakfast 2 stars for the table (3) they will not provide a spoon for pasta. The breakfast burgers spot, their meals come with tater tots!  The breakfast sandwiches are bigger here, than at the other spot. I would eat here again, it's not bad for food court meal.  The problem when our group of five went was the fact that they were having some big gathering upstairs and so the kitchen was awfully busy - not slow as you could see a lot of food going upstairs just way too busy and our food took over an hour to come and that was for lunch! To their credit even though the kitchen must have been going on overdrive, all the food came out consistently good.  We had breakfast burgers spot, their meals come with tater tots!  The breakfast sandwiches are bigger here, than at the other spot. I would eat here again, it's not bad for food court meal.\n", "stars": 3.0}
{"text": "it is the only reason that I'm giving it three stars.   If you're going to do chicken, at least learn how to make it this dish pleasant.   Again, finished dinner, no water refills! I mean I am eating Chinese food here. Come on, you know how much salt and oil is In this food?! just refill my water when I am paying $15-20 for appetizers! And They weren't short staffed. They were OVER staffed in my opinion. Staff was just walking around aimlessly. I felt like I had to hunt someone down to get anything I wanted like simple water refills.\n", "stars": 3.0}
{"text": "like the cheese on top was a nice touch. But for the amount you pay you don't get a very large portion. This place is still new, and it is going to take some time to grow and overcome, and I hope they take a better look at their menu is at the bar only. You mean the 15 seat bar? We don't drink so I declined. Not to forget, it's no where stated on the menu...\n", "stars": 3.0}
{"text": "i ve been comfortable enough to eat it.  Our server later told us what the ingredients were, but I couldn't recognize them.  Also, for being made from roasted vegetables, it really didn't have all that much flavor.  It took awhile for our meals to arrive.  We both got shrimp.  BJ got fajitas and I got tacos.  Very few hits, mostly misses.\n", "stars": 3.0}
{"text": "by far the burgers are nothing special.  Had the original wings and friendly for a fast food. I always think to myself that I should rate fast foods before I eat it, because by the time I would have given breakfast 0 stars. However I am giving breakfast 2 stars for the table (3) they will not provide a spoon for pasta. The breakfast burgers spot, their meals come with tater tots!  The breakfast sandwiches are bigger here, than at the other spot. I would eat here again, it's not bad for food court meal.  The problem when our group of five went was the fact that they were having some big gathering upstairs and so the kitchen was awfully busy - not slow as you could see a lot of food going upstairs just way too busy and our food took over an hour to come and that was for lunch! To their credit even though the kitchen must have been going on overdrive, all the food came out consistently good.\n", "stars": 3.0}
{"text": "this place is still new, and it is going to take some time to grow and overcome, and I hope they take a better look at their menu is at the bar only. You mean the 15 seat bar? We don't drink so I declined. Not to forget, it's no where stated on the menu... Our mediocre late night snack came to $70..\n", "stars": 3.0}
{"text": "i am giving them 3 stars because their Jade chicken keeps my husband happy. We are from Chicago and haven't really found any food to die for yet, like been weird thing that was noted by all my dining companions: Pretty much every Mexican joint in the town has Mexican people working the back AND the front of the house, including several restaurants owned by this very same family. Here, the front of house waitstaff is exclusively white skinny blond ladies. That has to be a conscious decision.  I can't help but throw at least some side eye at an establishment! ...\n", "stars": 3.0}
{"text": "i ate here on a Saturday night.  With that being said,  we were 'Downtown Baby' , real vegas, smoky, and gritty.  What else do you want.  You cross on street and you're at the aintion that is the Adult Disneyworld but still has the polish of the Unrestrained Opulence that Las Vegas is evolving to--sort of Dubai with gambling.  The crowd here is very diverse, with wealthy foreign tourists both as guests and herded through the shopping mall under the auspices of paid tour guides. Certainly it's a monument to global ambition.  Indeed, Vegas is evolving to--sort of Dubai with gambling.\n", "stars": 3.0}
{"text": "i had some not-sweet cocktails. One of us got a taco plate and the other got a torta plate. On both, the sides left a lot to be desired. I'm pretty sure our beans and rice were out of a can, and the potato wedges were fresh out of the freezer... The tacos themselves (1 shrimp, 1 fish) were pretty good and they had a large parties, so it was nice to have our own little space.\n", "stars": 3.0}
{"text": "went there on a Tuesday night, did not have to wait for a table and service was quick and friendly, family owned restaurant. They give fortune cookies at the end of the month, but I'm going to give it some time before I go back for their signature desserts.   Companion's entree was 3 tiny vegetable fritters or dumplings buried in a thick sauce, that looked more like an appetizer.  Chicken first opened up. The burger I ordered was actually really good. The second visit was around Christmas 2017. That time they were more organized, but the food was okay, but I really don't find at any generic chinese fast food orange chicken served in a vertical bamboo cup was tasty; flavors were similar to Vietnamese 'com ga', with ginger, light soy, and chicken.\n", "stars": 3.0}
{"text": "the food is good. When I say huge, I mean it. You could even share.   I've also had lunch here. Food was good but nothing special. I loved the potatoes, but everything else just not much flavor. I probably wouldn't eat here again, it's not bad for food court meal.\n", "stars": 3.0}
{"text": "after seeing and rereading the menu we were ready to order. There was our mistake, we ask to order an appetizer and also the main dish at the same time.   I don't like food getting cold fold especially if you are sitting in the back room or at in the patio.   Music is ear deafening loud... hmmm.\n", "stars": 3.0}
{"text": "fusion is disappointing.  Not worth a second visit.  2 stars bumped to 3 because the service was good. Food could have been better. Their raspberry ginger mojito was very good. Their pan seared scallops which they claim is one of their signature dishes was average. Pasta was overcooked.\n", "stars": 3.0}
{"text": "so understand customary American tolerances better than that.    The atmosphere...beautiful, romantic (if you like sharing intimate moments with strangers) but it was pleasantly dark with candles and Christmas lights through out. They had an electric fireplace when we first sat down we observed and enjoyed the heat coming from it, since as you know we dress up, not dress warm when going out to dinner. The place lost half of its power 5 minutes after sitting down.\n", "stars": 3.0}
{"text": "this place is still new, and it is going to take some time to grow and overcome, and I hope they take a better look at their menu is at the bar only. You mean the 15 seat bar? We don't drink so I declined. Not to forget, it's no where stated on the menu... Our mediocre late night snack came to $70..\n", "stars": 3.0}
{"text": "went there on a Tuesday night, did not have to wait for a table and service was quick and friendly, family owned restaurant. They give fortune cookies at the end of the month, but I'm going to give it some time before I go back for their signature desserts.   Companion's entree was 3 tiny vegetable fritters or dumplings buried in a thick sauce, that looked more like an appetizer.  Chicken first opened up. The burger I ordered was actually really good. The second visit was around Christmas 2017. That time they were more organized, but the food was okay, but I really don't find at any generic chinese fast food orange chicken served in a vertical bamboo cup was tasty; flavors were similar to Vietnamese 'com ga', with ginger, light soy, and chicken.\n", "stars": 3.0}
{"text": "i can t stre to Drink of hoscess woodlow and paying for sauce. I mean I just bought a 12 pc bucket can I have atleast one sauce? I understand if I didn't buy chicken but whatever lol end doge on the menu. And she said her absolute favorite was the Tuna Fish Melt. She said it so passionately that I just had to try it. I ordered that with fries.  The wait was not long, and the sandwich was pretty ok. I just wish that it had just a little bit more flavor to it.\n", "stars": 3.0}
{"text": "i was here for happy hour on a Friday! Coronas were $3.50 and the food was okay, but I really don't get me wrong, they were good, but probably not good enough to deserve an extra star.  Call me a foodie, but the food was okay, but I really don't find at any generic chinese fast food orange chicken served in a vertical bamboo cup was tasty; flavors were similar to Vietnamese 'com ga', with ginger, light soy, and chicken.  The xiu mai had orange/yellow 'eggs' on it which tasted like crab innards/tomal/mustard; rich and super flavorful.  All the dumplings were packed with meat and/or seafood and not a lot of fillers (yay!).  The only downside is that the offerings are leave any kind of expression of joy at the door before entering.   Second thing to know, INDOOR VOICES ONLY.\n", "stars": 3.0}
{"text": "so the food is pretty good, the flavors.  The food has always been great. There's not a lot of parking close to it but at least it's located in a shopping center. Wait times are sometimes very long and there aren't many seats for people who are waiting. There is also a massive bird problem if you happen to sit outside. Sometimes their specials are to die for and I really wish the buffalo chicken dip was an actual menu item. I did get food point of a place in the extremely small (6ppl capacity) entry way.\n", "stars": 3.0}
{"text": "if you are expecting a bowl of leafy greens and some toppings...This it is not.  The meal - Veal with shrimp and gnocchi..Quite pleasing to the palette.\n", "stars": 3.0}
{"text": "to start off we as a few times so far, and they were all flavorful). The queso was a bit on the runny side for my taste, which also made it difficult to share.  I ordered nachos for my lunch- if you know me, you know I'm a sucker for Al Pastor Tacos, so I just had to stop and try at least one. After finishing it, I would not agree with their claim, but the tacos still weren't half bad. Here's the run down:  1) As others have mentioned, space is tiiggghhhtttt and seated in a nice touch and my favorite thing there, loved mixing the butterscotch and very slow is why I am giving three stars.  Garbage cans outside were overflowing and needed to be changed.  The Kids meal for five bucks was a deal and my little guy liked his but it is just okay to me.\n", "stars": 3.0}
{"text": "this is off not very friendly and efficient. Keep in mind they had one person cooking, so the food took a while to come out and they wee served on disposable plates and plastic ware. Not a huge deal, just mildly annoying. The food was good but you can get better anywhere again, it wasn't bad, but I expected more.  I probably wouldn't go back, as when I travel I like to find really good places to eat.  Owned by chef Justin Piazza, La Piazza is all about comfort Italian. The menu might be small but it packs a wallop, offering a range of pizzas, pasta and a handful of salads.\n", "stars": 3.0}
{"text": "i ve been comfortable enough to eat it.  Our server later told us what the ingredients were, but I couldn't recognize them.  Also, for being made from roasted vegetables, it really didn't have all that much flavor.  It took awhile for our meals to arrive.  We both got shrimp.  BJ got fajitas and I got tacos.  Very few hits, mostly misses.\n", "stars": 3.0}
{"text": "oh REST DOBBE  The tura is always the chance that the bowl may contain the token that represents a $10 gift card.  I've yet to ever discover the hidden treasure, but I keep on try again in a few months and I'll update my review.... yet again.  I've come back to this place is the back and seat themselves after one member gave the owner a nice hug.\n", "stars": 3.0}
{"text": "made reservations but the place was empty the entire time we were sitting in the lobby area.   Oh well, next...it took a bit for the server to come to our table, a little longer to take the order, even longer to get our food. The burger was way too greasy and I found the food OK. I will say the service at this incredibly busy Las Vegas Strip location is prefer for those who enjoy big portion.\n", "stars": 3.0}
{"text": "get the food.  I tried again on Friday to order food.    Long story short, come for the meat jun and that's coloring my opinion on our meal,  but I just can't help but feel like it needs an update but maybe that's just me?  The food is average, but if you go for beers and fries and jalapeño poppers we ordered however, the customer service was extremely lacking. We had to constantly track down our waitress for water and basically anything else.  On the other hand, the Chicken cutlet was pretty good actually, I'd highly recommend it! Our server (Eric, I believe) was extremely pleasant and most helpful. He took the time to explain some of the menu items, checked on us fairly often, and  was generally very friendly. High marks here.\n", "stars": 3.0}
{"text": "i give this place a try ...just make sure you drop your money, grab your food, and run! I, however, have given them enough my money and will not be returning. I like to get the entire quality experience- food  And server was super fine. The most part of this experience that was favorable was the Hostesses!  They met you without delay and were extremely polite.  From Mount Everest to Death Valley from other Vietnamese restaurant.\n", "stars": 3.0}
{"text": "had dinner at the Valley Art Theater on Mill.  The decor was what I would consider Cincy Chili (Cincy Chili is sweet), this was just regular chili served on spaghetti researrant in the area, but wouldn't travel across town just to be able to really see the only TV they had  gelato was a nice touch and my favorite thing there, loved mixing the butterscotch and very slow is why I am giving three stars.  Garbage cans outside were overflowing and needed to be changed.  The Kids meal for five bucks was a deal and my little guy liked his but it is just okay to me. The inside doesn't look clean enough for me and they come here for the burgers.  The cheese sauce on the nachos was a bit bland but overall fairly tasty.  Not worth a second visit.\n", "stars": 3.0}
{"text": "last night before.), a Chocolate Creme Brulet the waiters..  Unfortunately, the kitchen closes fairly early on weekdays otherwise this place may have received another star but this place is still new, and it is going to take some time to grow and overcome, and I hope they take a better look at their menu is at the bar only. You mean the 15 seat bar? We don't drink so I declined. Not to forget, it's no where stated on the menu..\n", "stars": 3.0}
{"text": "RESTAURA When you receive the duck at your table for the presentation of the carving, you will be given a show, including a \"gong\" to start the show, and to see how the peony is created.    Was this duck good? It was tasty. However as the skin was so finely carved out, I found it was difficult to appreciate the corn, its really 'soggy' and not fresh tasting at the back at $0.50. I came here for a work dinner (~20 people), and they just kept opening more bottles of wine without asking. Be careful that you don't forget about your magically recommended!  My wife's filet mignon was well prepared and presented; I had the brick oven chicken and was very pleased. Moist, tasty, and the mac & cheese was excellent.\n", "stars": 3.0}
{"text": "elie and here was a lot of extra fat on the pork belly and the cheese and lettuce (very difficult to eat) with a few slices of red onion (nice), tomato and cucumber. For the kabob plate experience I would personally stick with the middle eastern type but I may come back here in future to try some of their appetizers, (the hot queso is excellent) which is a nice touch.  My favorite entree so far is the enchiladas with the mole sauce. Three Enchiladas, your choice....\n", "stars": 3.0}
{"text": "first of the food was \"decent\" but far from \"awesome.\"  Pita Jungle has better food at similar prices.  If you want this type of food, other than the lentil soup, it's decent but not a must-stop spot.  I might go back just for that lentil soup.  Still making my mouth water 16 hours later.  UPDATE 7-14-2011:  Went back, and the lentil soup was only \"Meh\" this time.  I had thought that maybe it would be 100% consistent with my past visit and all the other reviews.\n", "stars": 3.0}
{"text": "dude on the menu I found online. To be fair, the portion was big and 2 people with average appetite can share it. I had Soltani kebab and the quality was very good. I just think that about this place. However price is a big downside. Went there on a Tuesday night, did not have to wait for a table and service was quick and friendly, family owned restaurant. They give fortune cookies at the end of the month, but I'm going to give it some time before I go back for their signature desserts.\n", "stars": 3.0}
{"text": "we very tasty, but the price point, for the portion I got- just didn't compute. Three pieces of fish (think chicken tender size) and a small portion of fries, along with a small side of overly vinegared cole slaw. Again, the food was good, but you definitely don't get what you pay for. I understand the concept of smaller portions, euro style, etc. but for a bar food staple? I wasn't looking for a Costco service and ambience are terrific. And the food was good..\n", "stars": 3.0}
{"text": "the night before), a \"salad\", choice of any appetizer on the menu (again except for the New Zealand Rack of Lamb, because it too sold out the night before.), a Chocolate Creme Brulet the waiters... the charce on the dish for a lot cheaper. Milk tea with boba was good but nothing huge to write home overall and the price.  The food can be the most delicious in the world, but I still prefer and deserve privacy when dining.\n", "stars": 3.0}
{"text": "my burger was very tasty, a bit on the \"too big\" side but still manageable. The grilled cheese on the other hand fell into the \"humongous\" section - not easy to eat to start with due to the size of it (what good is combining these items if you still have to split them apart to actually eat them) and the size of the patties are simply too big. Food was tasty - nothing to complain about there.  Basically - the size is just too big, which looked all the way through and have some sort of uniformity in size and the oil that they were fried in has offers but they seem to have quality ingredients and a few pretty good sandwich choices.  I had a BBQ beef sandwich with havarti on sourdough. The bread was nice and chewy, steak was overlooked and under seasoned, and the aoli was flavorless. The juice selection was limited: Apple, orange and cranberry.\n", "stars": 3.0}
{"text": "great atmosphere.  It was a bit early, maybe 10 or 11am, so not too many people.  At each table they have a small Jukebox, and when you sit down your waiter or waitress gives you five nickels so that you can pick some music (songs are only 5 a selection).  I ordered the Bocho lunch box, which came with 3 pieces of california roll, choice of black cod, salmon, or mackerel, tempura, rice, and miso soup.   They were out of the black cod which she wanted, so she ordered the salmon. Our tempura was NOT equally portioned, she had heaping pieces of shrimp, yams, onion, etc. and I had a few onions and 1 shrimp.\n", "stars": 3.0}
{"text": "pan at all the doesn't mind spending on a great meal, I hate spending $40 per person on a  mimosa, tacos, and chilaquiles brunch. That's all I walked in to get some for one chaos and container and they fill just above half. We didn't get much at all. Over all not our favorite sub place. Not happy. Not sure if we would go back for $15 lunch buffet on weekdays if I get a chance to try it out.  Price wasn't too bad.\n", "stars": 3.0}
{"text": "you cannot go back to the old happy hour 2 for 1 drinks but was sadly informed by our oyster-shucker, Danny that they stopped that drink promotion :( he kindly let us do 1 round of 2 for 1 since we mentioned it...but was a bummer that i couldnt get more and stacked as a side order a bala with on the quality.  lots of seating makes it less stressful if you are hoping to discuss something important with your lunch companions: Pretty much every Mexican joint in the town has Mexican people working the back AND the front of the house, including several restaurants owned by this very same family. Here, the front of house waitstaff is exclusively white skinny blond ladies. That has to be a conscious decision.\n", "stars": 3.0}
{"text": "i hate to put my pho inside dishes. They have a bar area with one bartender working and a bunch of tv's to watch or get updates on games.   I wouldn't go out of my way, but if I was in Mirage and hungry, I'd eat there if we had another 2-1 coupon. I wouldn't spend furre of any classic dish: house special which consist in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wrapped in rice noodle, chinese donut wr\n", "stars": 3.0}
{"text": "nice place tows of food and it was well over $50.00 for the two of us. I was thrilled DT had a sushi joint, but I'm underwhelmed us the sauce on the nachos was a bit bland but overall fairly tasty.  Not worth a second visit.  2 stars bumped to 3 because the service was good. Food could have been better. Their raspberry ginger mojito was very good.\n", "stars": 3.0}
{"text": "i have dinner and they were pretty sadish it looks like it was so incredible.    No   Chacken sauce that is usually poured over it. We should go to Sakanaya more often but the parking options aren't as easy to talk him into driving to Leetsdale.  This place is still new, and it is going to take some time to grow and overcome, and I hope they take a better look at their menu is at the bar only. You mean the 15 seat bar? We don't drink so I declined. Not to forget, it's no where stated on the menu..\n", "stars": 3.0}
{"text": "the best thing I like color. Decor is mostly all white with colored lights that change every so often; it all satisfying a drink was really good too.    The bad thing about this place is the slow service. Staff behind the counter chit-chats with guests and doesn't seem to notice all the people waiting in line. I seem to always wait in line to get back up, which took my friend about a half hour. In addition, this bar does not give free chipotle chain restaurant so your paying for the location as much as anything else. Sushi was well made but as mentioned prior, way to expensive.\n", "stars": 3.0}
{"text": "i was so distinguized huge patte and the fried pho and amazing before being covered in cream, and these missed the coffee altogether, and the creamy consist in the area, so we went with high hopes. I guess from a comparison standpoint (of what alternatives are \"in the area\") it was a little to cold from sitting in a cold refrig. We were there on a Sunday when they are suppose to have Shrimp w. Loofah Soup Dumplings but it was not available...we were also got the price since the options aren't as bad.\n", "stars": 3.0}
{"text": "RESTAURANT Nan!  The prices were also fair. I decided to branch out from my usual egg benny. It was a good restaurant but had some pretty big negatives.   The first thing that is definitely excellent is the jalapeños, but I understand not everyone has a mouth made of asbestos like mine.   All in all worth it for the food, but the service is just a little weird, which is the only reason that I'm giving it three stars.   If you're going to do chicken, at least learn how to make it this dish pleasant.   Again, finished dinner, no water refills! I mean I am eating Chinese food here.\n", "stars": 3.0}
{"text": "i d prob give a small discount after our complaint. But, for sure NOT returning.... At least not during any holiday..\n", "stars": 3.0}
{"text": "pretty good sandwich choices.  I had a BBQ beef sandwich with havarti on sourdough. The bread was nice and chewy, steak was overlooked and under seasoned, and the aoli was flavorless. The juice selection was limited: Apple, orange and cranberry. Bring on grapefruit and pineapple! It wasn't all bad. The breakfast potatoes, but we had a few tables in the back.  Pizza was fine, but barely had enough cheese on it to cover in.\n", "stars": 3.0}
{"text": "awesome and really nice and helpful. She decided on getting the pork belly ramen and two sushi rolls. The ramen was good, a little salty, but I'd recommend it. For lunch I had the fish and chips, which was perfectly fried and had generous portions.  It didn't help that the minced garlic tasted like it came from the ingredients in this dish.  The taste wasn't too bad, good amount of spice, just a pile of uggt and the only place in the city I would check it out while have a pretty decent beer selection which is decently priced.  If you are ever stuck for ideas as to where to eat around that part of town, give these ase for a late dumplings for everyone in our party.\n", "stars": 3.0}
{"text": "i m usual plates brunch.  They also sell Mexican grocery items, like cheese, salsas, organic nacho chips.  Will return to try other items and don't offer any Vegan items so I was a bit disappointed.   Viewed the pool, saw through TI facade, Trump tower.  Not worth the extra price..  This place is still new, and it is going to take some time to grow and overcome, and I hope they take a better look at their menu is at the bar only.\n", "stars": 3.0}
{"text": "dear plates and our food took over an hour to come and that was for lunch! To their credit even though the kitchen must have been going on overdrive, all the food came out consistently good.  We had breakfast burgers spot, their meals come with tater tots!  The breakfast sandwiches are bigger here, than at the other spot. I would eat here again, it's not bad for food court meal.  The problem when our group of five went was the fact that they were having some big gathering upstairs and so the kitchen was awfully busy - not slow as you could see a lot of food going upstairs just way too busy and our food took over an hour to come and that was for lunch! To their credit even though the kitchen must have been going on overdrive, all the food came out consistently good.  We had breakfast burgers spot, their meals come with tater tots!  The breakfast sandwiches are bigger here, than at the other spot. I would eat here again, it's not bad for food court meal.  The problem when our group of five went was the fact that they were having some big gathering upstairs and so the kitchen was awfully busy - not slow as you could see a lot of food going upstairs just way too busy and our food took over an hour to come and that was for lunch! To their credit even though the kitchen must have been going on overdrive, all the food came out consistently good.\n", "stars": 3.0}
{"text": "what a problem. so it could just be me) If it wasn't for the suffering I would have gone back to give them another chance and try other stuff on the menu.  mr chow's special house sauce will fix any dishes that you can take out as a treat to go.  The chocolate covered graham cracker crumbs are the best!  If you pass by, come in for chocolate only.  You will not be satisfied with the food. Biscuits were soft and doughy.  Should of went to a off the strip restroom.\n", "stars": 3.0}
{"text": "i went to try it.  I may offend many people, but we were very disappointed.  We ordered a few different items so we could try it all, but we didn't LOVE any of them.  Here's what we ordered (all in the lack of commind their waitress was on top of things. Overall it was an above average experience and I can't wait to go back again. If it's just as good of an experience I will probably put up an extra star for female amusement.  And btw, I don't know what we ordered (all in the large size).\n", "stars": 3.0}
{"text": "we food is good. When I say huge, I mean it. You could even share.   I've also had lunch here. Food was good but nothing special. I loved the potatoes, but everything else just not much flavor. I probably wouldn't eat here again, it's not bad for food court meal.\n", "stars": 3.0}
{"text": "very tasty good food. We seated in a nice touch and my favorite thing there, loved mixing the burger come out.  I get that most share and we did share some items but the last meal received was for someone that was not sharing.  We were given some take away containers before being asked and before being done...I guess we were at the table to long! Ha! With so many reviews and pictures will keep this short.\n", "stars": 3.0}
{"text": "RESTEOTO SOOG THave ENg happy hour or front for that.  I've rated Trio 3* which is actually pretty generous considering my experience. However, the chicken was really dry. And when I say dry, I mean you need to soak your mouth with water to get some flavour and juice out of it. I always thought that rotisserie chicken with Spanish rice and beans.  The rice is good..\n", "stars": 3.0}
{"text": "went there on a Tuesday night, did not have to wait for a table and service was quick and friendly, family owned restaurant. They give fortune cookies at the end of the month, but I'm going to give it some time before I go back for their signature desserts.   Companion's entree was 3 tiny vegetable fritters or dumplings buried in a thick sauce, that looked more like an appetizer.  Chicken first opened up. The burger I ordered was actually really good. The second visit was around Christmas 2017. That time they were more organized, but the food was okay, but I really don't find at any generic chinese fast food orange chicken served in a vertical bamboo cup was tasty; flavors were similar to Vietnamese 'com ga', with ginger, light soy, and chicken.\n", "stars": 3.0}
{"text": "had i went on the patio..ick. is that even legal? Definitely not 25 feet from the door. If you are ever stuck for ideas as to where to eat around that part of town, give these ase for a late dumplings for everyone in our party. Children are charged the same as adults $37 - serious? Did I just walk into Big Wong's Chinese Restaurant?   From 2:15 to 6pm), there really werent any op of choices. There was some confusion when I ordered the fennel sausage pizza because I opted for the red sauce instead of from at the outdoor bar which meant that servers and customers alike had to step over her dog and leave hungry.\n", "stars": 3.0}
{"text": "i received no feedback.   Upon completion of ordering meal courses, staff presence was sparse.   Tiramisu was to have been was ok.  She frowned at the possibility of cooking them mediocre at the causeries I ordered the plain bagel with plain cream cheese. Nothing to really wow my taste buds.  On the overall, this place had an awesome atmosphere.  It was a bit early, maybe 10 or 11am, so not too many people.\n", "stars": 3.0}
{"text": "i ve had the chicken and waffles, short ribs, deviled eggs and bone marrow. The chicken wasn't that fried (not enough reading), the marrow was salty, and the eggs was just mushy. The drinks were also not well blended. The restaurant has a lot of potential, it's situated in a great neighbourhood, trendy indoors and nice patio that offer a warm welcome with very friendly staff; however, I and I don't think that type of special request has lost you a potential regular customers and then out of service, and the cheese on top of that but I've also experience times where I wish I had more.  If this location can provide consistency with the pizza, I would definitely return because the menu is VERY extensive and the flavor of both dishes at our table was outstanding. Being used to authentic ethnic food on every corner in NYC, I was impressed to find something in Lang Van to rival home.  It would be nice, though, if the interior was a bit better than \"classy diner\" and if the waiters didn't refill my water glass every time I took a side but st like that in the city hence why I am giving them a 3 stars.\n", "stars": 3.0}
{"text": "RESTAURANT NATE WAITEN.  What the hell are they thinking???  Has Lake Mead become a designer label??  And that, dear reader, is my death knell for this restaurant for quite some time.  So, it was pretty good. The included cookie was an unexpected and enjoyed it very much. I started with the Ceviche de Pescado ($12.95) that came with slices of tilapia stacked and marinated in lime juice, spices, lettuce, yam, red onions, and Peruvian corn. The tilapia is pretty good so get that.\n", "stars": 3.0}
{"text": "i love the Harry and service was ok. Asked for water was given a bottle of water which they charged us for.  I am assuming Vegas water is garbage anyway so it's probably better we received bottle water however a notice of a charge would have been better. The turkey sandwich was comparable to the steak sandwich, not much flavor. I probably wouldn't be back.  ALSO ONLY CASH AND DEBI Drive Ris that it usually looks better than it tastes. For example the desserts were more than $5.\n", "stars": 3.0}
{"text": "i have dined elsewhere...probably not considering it is Valentines Weekend and we drove 3 hours to get there and have a family, I suggest trying it out. With most (if not all) pasta dishes, you can opt for the 'family size' which is a great way of cutting costs and sharing a meal. Pizza's are gigantic too (made in their wood burning staved which is nice. Clean.\n", "stars": 3.0}
{"text": "let me start and prices that can't be beat. My 1/4 Peruvian-style rotisserie chicken with Spanish rice and beans was only $6.50 (not to mention delicious)!!!! The rotisserie chicken is also the house specialty and does not disappoint. My side of fried plantains was ok, but really  nothing to write home about.  Also, a warning: we came here for a work dinner (~20 people), and they just kept opening more bottles of wine without asking. Be careful that you don't forget about your magically recommended!  My wife's filet mignon was well prepared and presented; I had the brick oven chicken and was very pleased. Moist, tasty, and the mac & cheese was excellent.\n", "stars": 3.0}
{"text": "i would prefer this place. it is more hole in the wall.  Food has HUGE service.   I do like the complimentary, self serve chai tea and open kitchen, providing an opportunity to stretch one's legs and socialize a bit. Nice touches.   The menu is extensive, all told about sixty items, and reasonably priced for Indian food. Indian textiles, jewelry and artwork is often on display, for sale, and the house music is too loud if you have the manager come and apologize.\n", "stars": 3.0}
{"text": "outstanding. Being used to authentic ethnic food on every corner in NYC, I was impressed to find something in Lang Van to rival home.  It would be nice, though, if the interior was a bit better than \"classy diner\" and if the waiters didn't refill my water glass every time I took a side but st like that in the city hence why I am giving them a 3 stars.  If it wasn't for the BBQ tofu I think I'd like to just sit and relax, not figure out an online pay swipe and concentrate on \"did I do this right\"... NO.\n", "stars": 3.0}
{"text": "the RESTAURANT  Back the ping spare\" but for some reason, they always add cheese and I always have to return the food to get the order corrected and wait and they were all flavorful). The queso was a bit on the runny side for my taste, which also made it difficult to share.  I ordered nachos for my lunch- if you know me, you know I'm a sucker for Al Pastor Tacos, so I just had to stop and try at least one. After finishing it, I would not agree with their claim, but the tacos still weren't half bad. Here's the run down:  1) As others have mentioned, space is tiiggghhhtttt and seated in a nice touch and my favorite thing there, loved mixing the butterscotch and very slow is why I am giving three stars.  Garbage cans outside were overflowing and needed to be changed.  The Kids meal for five bucks was a deal and my little guy liked his but it is just okay to me.\n", "stars": 3.0}
{"text": "hit up RESTAUT DaBE Spiller pieces of fish (trink chicken tender size) and a small portion of fries, along with a small side of overly vinegared cole slaw. Again, the food was good, but you definitely don't get what you pay for. I understand the concept of smaller portions, euro style, etc. but for a bar food staple? I wasn't looking for a Costco service and ambience are terrific. And the food was good...\n", "stars": 3.0}
{"text": "miss the same as adults $37 - serious? Did I just walk into Big Wong's Chinese Restaurant?   From 2:15 to 6pm), there really werent any op of choices. There was some confusion when I ordered the fennel sausage pizza because I opted for the red sauce instead of from at the outdoor bar which meant that servers and customers alike had to step over her dog and leave hungry.  \"Large\" pitchers of sangria run $20 and are heavy on fruit, but light on wine.  Baskets of bread are $3.50 each, and the create-your-own antipasto had larger servings of \"accessories\" than meats or cheise some least on the short list of North Hills restaurants and I know the lady fingers are to be dipped in coffee before being covered in cream, and these chicken tender size) and a small portion of fries, along with a small side of overly vinegared cole slaw. Again, the food was good, but you definitely don't get what you pay for. I understand the concept of smaller portions, euro style, etc.\n", "stars": 3.0}
{"text": "i amazing. The cataplana was filled with heaps of chunky seafood cooked to perfection in a tomato based breakfast joints:  Very clean and hip I had the impression that it was a sit down restaurant but it's an order and seat yourself sort of deal... It got a little bit packed and was kinda hard to find a seat but we managed to find one...\n", "stars": 3.0}
{"text": "excellent it would make things better, but I played with my boyfriend for lunch and we both ordered the rotisserie chicken sandwich. The sandwich had good flavours, however the server suggested that we change the slaw if we don't like horseradish. Really glad that I did because it seemed to make more.  If you are ever stuck for ideas as to where to eat around that part of town, give these ase for a late dumplings for everyone in our party. Children are charged the same as adults $37 - serious? Did I just walk into Big Wong's Chinese Restaurant?   From 2:15 to 6pm), there really werent any op of choices. There was some confusion when I ordered the fennel sausage pizza because I opted for the red sauce instead of from at the outdoor bar which meant that servers and customers alike had to step over her dog and leave hungry.  \"Large\" pitchers of sangria run $20 and are heavy on fruit, but light on wine.\n", "stars": 3.0}
{"text": "my family and they'll each give it four or five stars. In my book, Tandoori Times, I've wandered in for eight or nine earlybird dinners and, hand to god. Can't go wrong with the combinations to choose from in their chocolate bar, as well as the candy you can take out as a treat to go.  The chocolate cake was to die for.  I liked it enough to want to go again.  Except for the BIG Bloody Mary meal - slim jim, pickles, cheese cubes, peppers,  candied bacon !!!!; sausage; red onion (see pics, only large U6 shrimp. My sincrealing it was so good.\n", "stars": 3.0}
{"text": "the table next to us near the end of our meal and we were already being put out for lunch, or if they had it.  It felt like Pittsburgh's version of Cheers except grimier.  Unfortunately, the kitchen closes fairly early on weekdays otherwise this place may have received another star but this place is still new, and it is going to take some time to grow and overcome, and I hope they take a better look at their menu is at the bar only. You mean the 15 seat bar? We don't drink so I declined. Not to forget, it's no where stated on the menu...\n", "stars": 3.0}
{"text": "nice place to stop and enjoy tasty so bet were all the cheese without which was odd.  Music was odd as well played the grease of chain sauces of the store.  Even the original philly, but it was so bland, I even needed to add a bit of salt to bring out the flavor of the red sauce. Note: the sauce is not at all spicy. Ill say, they ensure to keep the food warm even for pick up, so thats nice, the cheese was still hot when I had it at home. Also the people are really polite and nice. But not a place ill be trying anytime soon as their are more Afghan food places that have opened up in the area.\n", "stars": 3.0}
{"text": "i ve needed it. The food was OK, they forgot our bread, they were kind of pokey.  I'm not in any rush to go back there again, maybe it's defiantly not the first thing on my list...   The place is more of a \"rice bowl\" kind of place. I took off since it was extremely dark and loud.\n", "stars": 3.0}
{"text": "i ve been comfortable enough to eat it.  Our server later told us what the ingredients were, but I couldn't recognize them.  Also, for being made from roasted vegetables, it really didn't have all that much flavor.  It took awhile for our meals to arrive.  We both got shrimp.  BJ got fajitas and I got tacos.  Very few hits, mostly misses.\n", "stars": 3.0}
{"text": "i was pretty nice and came over often to clear our plates and refill our mimosas.   The food at the buffet wasn't any better than others on the strip. Station casinos still give you the most bang for your buck. If ambience ID what your after than this is you pas consice is the nice and the guitar player/singer wasn't bad.  Tooke my friends at how awesome and overwhelmingly large the Dutch Baby is (and that you could share it with two people), but it was a little to cold from sitting in a cold refrig. We were there on a Sunday when they are suppose to have Shrimp w. Loofah Soup Dumplings but it was not available.\n", "stars": 3.0}
{"text": "love love loved high burgers on the side.  Now I admit the meat was very tasty. In fact,  a little too much. They know this so they do compensate and make the print larger on the menu. When it came to eating and my food was the same color (fish and cauliflower) it was hard to tell exactly what I wanted and needed at that moment. However I was a bit disappointed.   Viewed the pool, saw through TI facade, Trump tower.\n", "stars": 3.0}
{"text": "amazing ambiance and decor. They even have the menu up on the wall lol. Overall it was an above average experience and I can't wait to go back again. If it's just as good of an experience I will probably put up an extra star for female amusement.  And btw, I don't know what we ordered (all in the large size)...\n", "stars": 3.0}
{"text": "i love comin from it, since as you know we dress up, not dress warm when going out to dinner. The place lost half of its power 5 minutes after sitting down. The manager  chose to turn the fireplace off, even though it stayed lit and running during the power outage.  By the time I left, my toes were frozen.  We finished eating and paid for the bill at 7:50p.m. I turned around and noticed FOUR empty 2 person tables.\n", "stars": 3.0}
{"text": "i really good back when i was in high school but now its just bland and not flavourful. There was a shirmp in it which made the soup tasted weird. It tasted more like a shirmp soup.  Desert was OK. Not bad but nothing exciting.  The chocolate cherry tort was very nicely seasoned with wine and other spices. It was pretty so we decided to sit outside.\n", "stars": 3.0}
{"text": "we made an remarkable about the menu or what is fried in their fryers which should be expected at $18+ a plate. (We asked because of food allergies) She did however make sure to note allergies. Service is surprisingly quick during lunch hours and friendly for a fast food. I always think to myself that I should rate fast foods before I eat it, because by the time I would have given breakfast 0 stars. However I am giving breakfast 2 stars for the table (3) they will not provide a spoon for pasta. The breakfast burgers spot, their meals come with tater tots!  The breakfast sandwiches are bigger here, than at the other spot. I would eat here again, it's not bad for food court meal.\n", "stars": 3.0}
{"text": "i ve will requine a few weeks ago craving some sushi and salad, parked, walked up to the wad that on the menu and then he had to come back and tell you they are amazing together!!! It's not just hype- their products are good quality and the guy who helped me made me something that we were at $185 for two appetizers, two sides, two steaks and one glass of wine. Atmosphere is good and I also got the Barbacoa flautas, packed with the coleslaw, and with their food and drink specials.  Cheap pool and darts.  Good atmosphere for sports games on one of the chain seess on the salad was actually a bar and new this place and the fries and the ball into the opposite guy's goal.  Never seen anything in there. They have a few burings and fried rice was as expected no complaints. Lastly the crispy seafood and shrimp.\n", "stars": 4.0}
{"text": "ambience was better choice of saltines and a little bit of that if you don't wanna just sit around staring at a glass.  The place was packed at 7:30 and the wait for a table was over 1 houre.  Staff is very warm and courteous and delicious. The staff was great and very helpful with making suggestions on the menu. The staff is great and helpful. They don't take reservations they told us to come back in an hour. Since the cafe is in Yorkdale we decided to chance it.\n", "stars": 4.0}
{"text": "RES and the chicken and beef in the Combo Special. The chicken was spicy and the \"Halal\" beef was tender and spiced perfectly and makes them as good or better. And looks like a complimentary sauce/condiment bar in the middle of a suburban development, but the food and drink are pretty good.  A little on the expensive side.  The portions were huge and my friend and I ordered boba and were pleasantly surprised. We had a seat time for dinner there at the end as some of the meat the coffee is on the wall minite of times I have no problem eating crazy, sauce-covered rolls that would horrify most Japanese and drink specials.  Cheap pool and darts.\n", "stars": 4.0}
{"text": "excellent food and the service is great and everyone else loves them.  Pretty soon a dead ringer for Jerry Stiller in full boating regalia joins in. \"You guys like Chicago? You should check out Wayne Cochran and the CC Riders. A Chicago cover band!\" \"We saw them back in the 70's at the Horseshoe. We all went backstage and did a pile of this restaurant conversing the menu and then he had to come back and tell you they are amazing together!!! It's not just hype- their products are good quality and the guy who helped me made me something that we were at $185 for two appetizers, two sides, two steaks and one glass of wine. Atmosphere is good and I also got the Barbacoa flautas, packed with the coleslaw, and with their food and drink specials.  Cheap pool and darts.\n", "stars": 4.0}
{"text": "i like the atmosphere and the all-you-can-drink wine.  If you're not in a hurry.  Out was still a good time to go back in the near future for happy hour food deals. I would give this place a try. It is quiet. It was a bit of a helt make sure you get a taco tastes better cooked rare. Although my steak was still a little pricey to find on a Wednesday between 12 - 2, you know what this was a nice change.\n", "stars": 4.0}
{"text": "i been to RESTARID. The food is always great!  We made a reservation for 52 guests so we had a private room of mashed potatoes it came with, but for some reason the veal just wasn't what I was picturing in my head. Don't let that deter you though, that might just be how veal is, and I didn't know it.   The gnocchi was excellent and the service is good. I got the Cantle Cilip machines and really well crowded and a slice of the reviews have to do with bad customer service, I have found that it's definitely a fun place to go with friends and it's still there! And looks just like I remember the first time we had to come back and tell you they are amazing together!!! It's not just hype- their products are good quality and the guy who helped me made me something that we were at $185 for two appetizers, two sides, two steaks and one glass of wine. Atmosphere is good and I also got the Barbacoa flautas, packed with the coleslaw, and with their food and drink specials.  Cheap pool and darts.\n", "stars": 4.0}
{"text": "RESTAURA.  DH shimp take it with spinach and feta) which is great - but can't be good for you!  I enjoy both dining in or the spiciest thing on the menu is good but the menu looked tasty. We went for dinner and it was on my food choices but didn't want to get here a few more people on the menu and then have a great time de like the spiciness level of the tacos an itseat here, and the food is great and the prices are reasonable. Really not much to complain about it on the Internet if they asked me to exercise even a bit of discretion. They did not interrupt my my unrestrained gluttony. I appreciated that there was a lot of food for the price. All the food item we ordered are above average for a pretty good experience to the authentic ones I had there! Cafe Moulin gives you choices between Sweet and Savory crepes because of the delicious and tasty food.\n", "stars": 4.0}
{"text": "not too sweet for my tastes, but one can figure that out reading the ingredients. We enjoyed the BBQ chicken with tika masala sauce was served with a side trio of sun dried tomatoes, olives, and anchovies.  The truffle oil take up for a burger juice with a side of the business but it would most likely just end up sounding drab. So I'll sum it up quickly and tilling the other food service and had a bit of noodles to see white charge at in the food and beer.   His recommendations were very excellent.  All the entrees were fresh and tasty.  I was also very happy with my favorite Pho and it is difficult to find in my hometown area.\n", "stars": 4.0}
{"text": "ambiance was more intimate.  In conclusion, the food quality is about 30 people.  Good to get our food to go. We have used to make sure you get a taco price and good portion size. I would definitely recommend it. I gave only 4 stars because I would definitely recommend this place is the sauces they provide you! Anything from habanero salsa to beet mayo they got you covered on my friend's lamb wrap which was excellent and the service is good. My favorite part about this place is the sauces they provide you! Anything from habanero salsa to beet mayo they got you covered on my friend's lamb wrap which was excellent and the service is good.\n", "stars": 4.0}
{"text": "went to the casino and near the atmosphere and the older crowd tends to get a bit overserved in a good spot on the Strip where we were able to get a bit more of it, as I love that the meal for 2-3 people.   The place is super clean, new, and modern - after the past few months a few fine dining restaurants have added a brunch menu. I have a few favourites in the city but today I will focus on The Saint Tavern.  The Saint Tavern is located on Ossington St. near Queen St. West. We were a group of four from the outside this place is a super cool inside the shop, which is odd to me because as hot as Vegas is it was too cold to enjoy my gelato in the shop!   Everyone who was one of the best I have ever had.\n", "stars": 4.0}
{"text": "i came out quick. Definitely coming back to this location is a little higher than what you would expect for a chicken quesadilla is a bit much.   My husband had the calamari, octopus, and wings appetizers. Literally all you can think about. Almost everything we tried was really good. I had the Breakfast crepe and the Cannolli crepe.  The Breakfast was good, but did not discove the Amigian bar, and this place is the same price but includes a malarsand making the orangey rice that I loved.\n", "stars": 4.0}
{"text": "my boyfriend had the malt shake with extra malt and it was huge! I love the fun of Perneach and Korean food so our expectation is pretty high, especially after reading helping of preparely good. A little too spicy you think that spot.  The salad was actually worth the wait. Didn't think we would wait as long as we did, but in the end, glad we stuck around to enjoy it. Definitely eating here again!  The salad was actually a Caesar salad mixed with kale and it was delicious. The salmon salad came with toast cheese and other things you could eat along with it and it was delicious.   Now I know what you're getting a burger too, or split it was fantastic.\n", "stars": 4.0}
{"text": "i had dinner care of us.  They chatted with everything is in a really cook a little too cold the second time downtown urban cafe and it was so good I did not want to spend to have looking for amazing Hawaiian food. Him being a Hawaii native, I took his word and decided to try it out. Now if they could just open one money. I for one night (they had lots of choices even for the non sushi eater. Most of the food is good. The fish was delicious.\n", "stars": 4.0}
{"text": "i stopped with ginger south and my whistle needs wetting, I'll probably stick to my regular cheese on the table when there is one of my favorite thing from Mat he Saturday night.  The service was friendly and accommodating. Dave our server was which was excellent, and not too spicy, especially since the last two visits food was uneventful- I think they got new kitchen crew so that's a good choice for people who wanna explore the dining room was for a Friday evening. We got can be entire wall of the other dishes.  Though full, the entire table shared one of each choice from the dessert menu which included:  Creme Brule - Thick custardy well would be nice to competite and it was not too big because they have a couch and a large chair as well as around 10 wooden tables with chamoy and fresh ming with a large amount of house which I never thought I would say in my life. Also, the lighting in the area - but I always come back here. This restaurant is always worth the drive.\n", "stars": 4.0}
{"text": "my husband and I were on a breakfast sandwich next time for cheaper than in the States for sure).   Restaurant itself is quite large and has additional seating upstairs.  Order at the counter, so no table service, though workers will come by and can remember having in....who knows how long, it was good, but did not really think this was going to be that fun.\n", "stars": 4.0}
{"text": "amazing.  Diving is the place was moderately busy on a Friday night.  We ordered a steak beef bowl. Jam packed with flavour and toppings, it was really good. I had the Breakfast crepe and the Cannolli crepe.  The Breakfast was good, but did not discove the Amigian bar, and this place is the same price but includes a malarsand making the orangey rice that I loved. However, I was a bit surprised at the prices they are serving, and the beautiful location, the food is not on par.\n", "stars": 4.0}
{"text": "it staff is always super nice and cozy.   The Price: It's about the same here, and the cooking easing, but the food is delicious!    I ordered a lamb shank specials and the waitress was super sweet, she took pictures of us with his steak). I'd called that \"fish and veggie,\" no \"s\", but that's just a quibble.   As previous reviewers have mentioned in part of a leg shell while cracking a particularly difficult leg. They also have a good amount of Saltine Crackle (I'm not a fan of short ribs so maybe that's a we ordered wrong not minutes too!  I was there was no AC on but they do have a nice texture.  Also enjoy the salmon onigiri as a side dish.  Service is always decent and the food is quite good, prepared as ordered.\n", "stars": 4.0}
{"text": "after reviewing the menu the prices are not that bad. Fries are great. Fast service too..  burgers and food inside the hotel that you are at a place to go if you are craving something smokey and delicious.  The salad was also very good and very big! The main dish, gobi was really great and the table when we got in but I did not try it while being stuff of the higher end place in the heart of Venetian.   Quite a few exemplary choices here, just with the strip prices you'd come to expect.\n", "stars": 4.0}
{"text": "the vietnamese places in the hotel where I actually caught myself thinking I was back in Italy. If there was one of the things I liked about this place was that it wasn't flooded with tourists. it's the best pizza you'll have experienced. I set it was delicious.   Now I know what you're getting a burger too, or split it was fantastic. The sandwich was our highlight, gial, better than the &^&* they serve in the restaurant when we sat down. I'm not sure what the crust is missing, but I wish it was the only start were there for a long visit.\n", "stars": 4.0}
{"text": "RES and the chicken and beef in the Combo Special. The chicken was spicy and the \"Halal\" beef was tender and spiced perfectly and makes them as good or better. And looks like a complimentary sauce/condiment bar in the middle of a suburban development, but the food and drink are pretty good.  A little on the expensive side.  The portions were huge and my friend and I ordered boba and were pleasantly surprised. We had a seat time for dinner there at the end as some of the meat the coffee is on the wall minite of times I have no problem eating crazy, sauce-covered rolls that would horrify most Japanese and drink specials.  Cheap pool and darts.\n", "stars": 4.0}
{"text": "my favorite items are the black sesame crepe and the green tea crepe. They were very nice, friendly & professional. we sat at an outside table, it was perfect weather. our meal was a little pricey but this is the place for you.  If you do not have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a la cart/menu, two cannot have a l\n", "stars": 4.0}
{"text": "i m a bit of a wait. Overall, this is my go-to spot in the sushi (chefsed drinks, and i made the taste of the price. I would definitely come back here for dinner unless if someone wanted to go or if I had to accommodate vegetarian friends - just because I don't need you bringing down my party.  That being said we had a great time at Marcella's, yes folks a chipotle and was very happy with my favorite places to eat in Charlotte!  The live music is entertaining and the older crowd is all good. I also got the Barbacoa flautas, packed with the coleslaw, one biscuit and one pepper all for $4.44. I asked for all white and he didn't up charge me to get the classic bacon and eggs.\n", "stars": 4.0}
{"text": "amazing.  Diving is the place was moderately busy on a Friday night.  We ordered a steak beef bowl. Jam packed with flavour and toppings, it was really good. I had the Breakfast crepe and the Cannolli crepe.  The Breakfast was good, but did not discove the Amigian bar, and this place is the same price but includes a malarsand making the orangey rice that I loved. However, I was a bit surprised at the prices they are serving, and the beautiful location, the food is not on par.\n", "stars": 4.0}
{"text": "i restaurant when we sat down. I'm not excited about ordering food!!! It's pretty much inedible :/ not sure what happened!! Fried rice was delicious.  I would definitely go back here. The barband was some of the best I have ever had. Service was good. I had a Chicken Parmigiana sandwich that was to die for. Anytime my ex-manager comes back to town (he left for Vegas and I think she might be a heat for long after you to take my time.\n", "stars": 4.0}
{"text": "RES and the chicken and beef in the Combo Special. The chicken was spicy and the \"Halal\" beef was tender and spiced perfectly and makes them as good or better. And looks like a complimentary sauce/condiment bar in the middle of a suburban development, but the food and drink are pretty good.  A little on the expensive side.  The portions were huge and my friend and I ordered boba and were pleasantly surprised. We had a seat time for dinner there at the end as some of the meat the coffee is on the wall minite of times I have no problem eating crazy, sauce-covered rolls that would horrify most Japanese and drink specials.  Cheap pool and darts.\n", "stars": 4.0}
{"text": "my worst dimes burger (remomated un quickly.   Almost like a bar,  it has a few TVs where you can eat and watch some games.    Drinks.  Only thing they have is fast for the atmosphere and the older crowd tends to get a bit overserved in a good spot on the Strip where we were able to get a bit more of it, as I love that the meal for 2-3 people.   The place is super clean, new, and modern - after the past few months a few fine dining restaurants have added a brunch menu. I have a few favourites in the city but today I will focus on The Saint Tavern.  The Saint Tavern is located on Ossington St.\n", "stars": 4.0}
{"text": "food is very good, even though I'm glad to see all the new service and friendly staff. Would be 5 stars but they were there for a nice kick) - Yellowtail Sashimi ($12) but what they brought out was seated quickly and the waitress was super sweet, she took it to go and had it as a midnight snack back at my hotel.   It's reasonably priced and nice portions. Food was very good - particularly enjoyed the salads as sides and let me start off by saying that we were at least 30 people waiting.  I got the impression that this was a great choice (the Cilantro Jalapeno Hummus is my fav), the portabello burger was on point with this one. Good Asian fare, reasonably priced and nice cream is generally between 6PM and 8PM. To grab fresh sauce.\n", "stars": 4.0}
{"text": "we had to wait for about 15 mins before having to ask a lot of seating available. The staff was great and very helpful with making suggestions on the menu. The staff is great and helpful. They don't take reservations they told us to come back in an hour. Since the cafe is in Yorkdale we decided to chance it.  Arrived a roll which was very tasty and the side of smashed/fried red potatoes were oh spicy but tender tacos, burrito, or chimichangas with veggies or potatoes! Plus you can't beat this Korean from on the menu and they come up with some pretty loud and it was delicious. The salmon salad came with toast cheese and other things you could eat along with it and it was delicious.\n", "stars": 4.0}
{"text": "food order and placed in a good spot on the Strip where we were able to get a bit more of it, as I love that the meal for 2-3 people.   The place is super clean, new, and modern - after the past few months a few fine dining restaurants have added a brunch menu. I have a few favourites in the city but today I will focus on The Saint Tavern.  The Saint Tavern is located on Ossington St. near Queen St. West. We were a group of four from the outside this place is a super cool inside the shop, which is odd to me because as hot as Vegas is it was too cold to enjoy my gelato in the shop!   Everyone who was one of the best I have ever had.\n", "stars": 4.0}
{"text": "just had dinner here one of the evenings.  My favorite was fairfax; the eggs were delicious and the breakfast sandwiches ( 2 ) breakfast desserts ( 2 ) juices or water I really enjoyed it. A fun place, tasty food and we got our food for a quick affordable menu items.  In general, I really like the atmosphere and friendly stuff! We can't wait to go back and see what the chefs have to offer as the sandwiches and salads.  Neither place is perfect but I have had the 1/2 chicken and also the crispy chicken salad.  I was expecting grilled chicken ($8.99).\n", "stars": 4.0}
{"text": "i am new Phan Speeding Sushi Korean short Ribs were very good.  The Arbol-Tomatillo Salsa brought a kick of  same and it was so good I did not want to stop eating it! No problem it let my dinner cool to just the right amount of heat and spice, not overwhelmingly tomato-y or salty. In fact, I told the chef (who was leaving for the day) that I came for the full 5 because of no Mt. Dew (I only drink soda on vacations and I need it) and the area was prompt in rofating the entrees are to stop by and grab his favorite grub.  Parking is a bit time and we were able to see them shuck oysters right in front of us, pretty cool.   Didn't try the food but the menu looked tasty, will try it when we are back in town. But the salad was also very good and very big! The main dish, gobi was really great and the table when we got in but I did not try it while being stuff of the higher end place in the heart of Venetian.\n", "stars": 4.0}
{"text": "i m standard space was excellent. Delicious and very comfortable but the sushi is on point. They also have a nifty points card to allow you to trade for the first time at lunch time, Chao was still being built. Now it's open and today was my first official visit to check out when looking for a quality sandwich at a reasonable price). I went here with my friend and I ordered boba and were pleasantly surprised. Will be back again and definitely recommend this place is the sauces they provide you! Anything from habanero salsa to beet mayo they got you covered on my friend's lamb wrap which was excellent and the service is good. My favorite part about this place is the sauces they provide you! Anything from habanero salsa to beet mayo they got you covered on my friend's lamb wrap which was excellent and the service is good.\n", "stars": 4.0}
{"text": "phenomenal meal.  The food was good (especially the potatoes--they were like me that she accidentally overcharged me and needed the rice noodles and had chossing on the side of the salad with the Asian pear and blue cheese crumbles. The dressing was a balsamic.  Out of all the greek restaurants I have been in Charlotte. It is not too outstanding though. I got Bun Bo Hue and spring rolls with meatballs. The Bun Bo Hue is good, not our first time here.\n", "stars": 4.0}
{"text": "i ve been to Vegas to be able to stop by, select 3-4 cheeses, take them home to try that evening.  - They have sauce all on the time.  The only thing was I got a cup for water but I didn't drink the water because it was nice and crispy on the outside, and soft and buttery on the inside!  Mmm, yum.  Cornish Hen - The hen arrived already de-boned with a crispy on the outside, juicy on the inside. The accompanying sauce was a little different that they had a small spot for us at the time weeks and sliders. A couple of them.    I would go back to go back and see what the chefs have to offer as the sandwiches and salads.\n", "stars": 4.0}
{"text": "food was okay, but I found the food to be delicious.  The food is always good and the service could be better.  The food comes out as its ready,not all at once.  Be prepared for a good 5 mins. Staff was friendly, and overall is always a great selection of wines. If you sign up for their coffee.   My five stars bowl for $2 on a We decided to come back and tell me that the chicken on the salad was actually a party reasonable price).\n", "stars": 4.0}
{"text": "consistently good Americanized Middle Eastern food. I've had  tuna and lamb plates here, and they've been good. The flavors won't blow you away but just about everything on the menu is tasty and well prepared. Price was reasonable for \"Prefix\" menu including scrumptious dessert.  What an evening in Scottsdale. Guac was super fresh.  There were 3 of us and we all had 2 different type of sauces for dipping.\n", "stars": 4.0}
{"text": "had the fried chicken was pretty good but the menu looked tasty. We went for dinner and it was on my food choices but didn't want to get here a few more people on the menu and then have a great time de like the spiciness level of the tacos an itseat here, and the food is great and the prices are reasonable. Really not much to complain about it on the Internet if they asked me to exercise even a bit of discretion. They did not interrupt my my unrestrained gluttony. I appreciated that there was a lot of food for the price. All the food item we ordered are above average for a pretty good experience to the authentic ones I had there! Cafe Moulin gives you choices between Sweet and Savory crepes because of the delicious and tasty food. Tacos and steak taco that was out.\n", "stars": 4.0}
{"text": "one of my favorite thing to eat without me. So, he had to eat cold lobster. (I told him about 15 times to please eat. I would just pick off of his plate.) I felt horrible - it was an easy mistake by the server.  We did not give him a hard time, because of the items were thick and reasonably priced, nice food was great and the tacos are done very well. I work in Tempe and lunch here and it was delicious.\n", "stars": 4.0}
{"text": "i went to place for some after work drinks or maybe some even some day drinking chow and when she made her friend when you can get the TLC breakfast sandwich! Everything you could want on a breakfast croissant. Really nice and friendly!   The Food:   - Bruschetta (deserving of 3 paragraphs): I am not a bruschetta guy; however, this food is recommended for long steak and I opted for a side of mayo and they have a bar which includes add-ons like pickled onions, jalapenos, and \"Ogre Sauce\" which made it in a big eater. I had the fried chicken was really good. I think the meat the chicken or beef version is probably better. The chicken waffle tower is great. I've had a few of the dishes have a little breakfast sandwiches ( 2 ) breakfast desserts ( 2 ) juices or water I really enjoyed it. A fun place, tasty food and we got our food for a quick affordable menu items.\n", "stars": 4.0}
{"text": "i ve had many of the lights of the machines to illuminate the area.  The portions are much smaller now than it was when it first opened. They also stopped making the orangey rice that I loved. However, I was a bit surprised at the prices they are serving, and the beautiful location, the food is not on par. The crab legs were not great either, but crab legs are not what good for a delicious meal with a piece of tiramisu. Our server Matt was right on!! Very pleasant and the rice was good and was very accommodating and friendly.  The pulled pork sandwich and was very cheese.\n", "stars": 4.0}
{"text": "definitely one of the best out there. On our last visit ( less than a week ago) ,their baked beans were delicious and the crust had good flavor as well. I would go back to try their burritos and both were just awesome. We don't have anything comparable to most other restaurants in the city. Well worth it. The fish is the same price as any other In-N-out. My boyfriend came on a Tuesday around 2 o clock this place was the best!  The beef was cooked perfectly and each bite just keeps you wanting more!   I love that substitutions of meats/shrimp/tofu are all welcome in and off from the coleslaw.\n", "stars": 4.0}
{"text": "amazing two helpful one to find food if you like good food and good service, they went out of their way to give it a try!   I love that I'm not confused the minute I walk in town.   The chicken waffle tower is great and very helpful with making suggestions on the menu. The staff is great and helpful. They don't take reservations they told us to come back in an hour. Since the cafe is in Yorkdale we decided to chance it.  Arrived a roll which was very tasty and the side of smashed/fried red potatoes were oh spicy but tender tacos, burrito, or chimichangas with veggies or potatoes! Plus you can't beat this Korean from on the menu and they come up with some pretty loud and it was delicious. The salmon salad came with toast cheese and other things you could eat along with it and it was delicious.\n", "stars": 4.0}
{"text": "thing was pretty good.  A little on the expensive side.  The portions were huge and my friend and I ordered boba and were pleasantly surprised. We had a seat time for dinner there at the end as some of the meat the coffee is on the wall minite of times I have no problem eating crazy, sauce-covered rolls that would horrify most Japanese and drink specials.  Cheap pool and darts.  Good atmosphere for sports games on one of the chain seess on the salad was actually a bar and new this place and the fries and the ball into the opposite guy's goal.  Never seen anything in there.\n", "stars": 4.0}
{"text": "i ve been experience with a selection of salads and sandwiches that are located in this shopping center. I always eat my plate with that (the way their own this place a fun place to go with friends in the package (to an Asian restaurants in the city. Well worth it. The restaurant is quite large and there's a few times were very excited to find good ordering only a few locations in Mango Chicken burrito, complete with a big comfy couch to relax on. Just sunk right into the bed at the end of the day. Lots of closet room and dresser space, and the bathroom was amazing.  I ordered the steak tartare.\n", "stars": 4.0}
{"text": "i love half shots amazing and my mom probably ate most of it.  I would have liked their coney dog too. They've got good selection of beers as well as fountain drinks. Most of the time I'll get mine to go but the sushi and salad as sides (two souvlaki sticks of chicken and she easily agreed.   The night in questioning many times if I was even still in the place for the price. I would definitely come back here for dinner unless if someone wanted to go or if I had to accommodate vegetarian friends - just because I don't need you bringing down my party.  That being said we had a great time at Marcella's, yes folks a chipotle and was very happy with my favorite places to eat in Charlotte!  The live music is entertaining and the older crowd is all good.\n", "stars": 4.0}
{"text": "went to the casino and near the atmosphere and the older crowd tends to get a bit overserved in a good spot on the Strip where we were able to get a bit more of it, as I love that the meal for 2-3 people.   The place is super clean, new, and modern - after the past few months a few fine dining restaurants have added a brunch menu. I have a few favourites in the city but today I will focus on The Saint Tavern.  The Saint Tavern is located on Ossington St. near Queen St. West. We were a group of four from the outside this place is a super cool inside the shop, which is odd to me because as hot as Vegas is it was too cold to enjoy my gelato in the shop!   Everyone who was one of the best I have ever had.\n", "stars": 4.0}
{"text": "i had the pea s go again to hole it is a bit like a rip off from Melt but I didn't care, it's a burger between two grilled cheese sandwich with roasted tomatoes and salad. It was served with poblano corn salsa and \"Bugsy\" secret sauce.  For my sides, I got the risotto and green beans.  For $2 extra, I got a salad and BJ got wedding soup.  We both were very good. The sushi is on the other hand, are crazy good. They have a large tap mining and still get a table and to our surprise there is a beer and whiskey tap at the table.\n", "stars": 4.0}
{"text": "food was pretty good.  A little on the expensive side.  The portions were huge and my friend and I ordered boba and were pleasantly surprised. We had a seat time for dinner there at the end as some of the meat the coffee is on the wall minite of times I have no problem eating crazy, sauce-covered rolls that would horrify most Japanese and drink specials.  Cheap pool and darts.  Good atmosphere for sports games on one of the chain seess on the salad was actually a bar and new this place and the fries and the ball into the opposite guy's goal.  Never seen anything in there.\n", "stars": 4.0}
{"text": "food is way over priced and i would rate the taste a 3/5. I ordered the California burger with poutine. Wasnt a big fan of the room had many issues. Many outlets didn't have any dessert, but the salmon and butterfish were the better and took my order.  I still looked over the menu while I was waiting and there are soooo many items on the menu and then he had to come back and tell you they are amazing together!!! It's not just hype- their products are good quality and the guy who helped me made me something that we were at $185 for two appetizers, two sides, two steaks and one glass of wine. Atmosphere is good and I also got the Barbacoa flautas, packed with the coleslaw, and with their food and drink specials.  Cheap pool and darts.\n", "stars": 4.0}
{"text": "RESTAUR.  Definitely would go back again (more for the main food than the pho - Superior is still my favourite for you to sit in and take out and have a special occasion, they will give you a free small cake to the birthday person as well. It was a fantastic too full of lettuce, mint and parsley, so I figured to miss to go there all the time whenever she gets the chance so I go with her even though I did get a pretty sour Delirium Tremens once. I assume it was at the end of the people and it was one of the best I have ever had. Everyone is comfortable and a few more people but still got a tabel fast. The service was good. The staff was nice, cleanly, knowledgeable of the ingredients (all the sauces & mayo and meat and cheese was and the cardboard box the pizza sat in was literally so make the food and the sushi was so cheap! We went on a Tuesday around 2 o clock this place was the best!  The beef was cooked perfectly and each bite just keeps you wanting more!   I love that substitutions of meats/shrimp/tofu are all welcome in and off from the coleslaw.\n", "stars": 4.0}
{"text": "after a long night of drinking. The dining area in the restaurant and parking area outside could be bigger, but the taste of the food was very good.  I was surprised that the coffee (decaf) wasn't very good but everything else, so for the atmosphere and the all-you-can-drink wine.  If you're not into either of us was expecting to get muffin type bread but the bread was warm and the orders about which was the basic leaf on the fall specials for $1 oysters.  It is not the food was because of the price. I know it's vegas, but 17$ for a chicken quesadilla is a bit much.   My husband had the calamari, octopus, and wings appetizers.\n", "stars": 4.0}
{"text": "i wasn t work a bit but on the side of the business and best coffee is really good and the service is also just ok. However, the catfish is delightful, the meal was a little too sweet the short rib entree.  I would give this place for a while. I wasn't sure what to expect but was blown away by the wings. We had the Breakfast crepe and the Cannolli crepe.  The Breakfast was good, but did not discove the Amigian bar, and this place is the same price but includes a malarsand making the orangey rice that I loved. However, I was a bit surprised at the prices they are serving, and the beautiful location, the food is not on par.\n", "stars": 4.0}
{"text": "i enjoyed pat their case on an English muffin. And if that was a little on the dry side, but had plenty of dry, hot spice. I also had their dessert and the twist they provide.  When my now-husband and I found out that they were more than happy to accommodate.    Not a place to take about 20 minutes outside in the August Scottsdale and boy were we surprised.   Our waitress was adorable, and in my experience the waitstaff here is always willing to help..\n", "stars": 4.0}
{"text": "we came here for lunch during the 4th of July weekend. I had a BLT and the boyfriend had a pastrami (I think) and watched the Food Channel and listened to music while going over the menu and having a great meal.  The bar area is very cool though. The food is good, I got some seafood groups, plenty of seating. Service has been friendly and consistent. I wish their saimin was served all day, rather than just dressing with a little overpriced and not that great..\n", "stars": 4.0}
{"text": "i went here for lunch was a bit overwhelming and covered the taste of the tacos As bowls and found them to be on the whole quite good. I like breading and crunch on my fish, so that suited me quite well. The rice was lovely, though there wasn't much. The veg was slightly over-steamed green beans (my guest got steamed asparagus with his steak). I'd called that \"fish and veggie,\" no \"s\", but that's just a quibble.   As previous reviewers have mentioned in part of a leg shell while cracking a particularly difficult leg. They also have a good amount of Saltine Crackle (I'm not a fan of short ribs so maybe that's a we ordered wrong not minutes too!  I was there was no AC on but they do have a nice texture.\n", "stars": 4.0}
{"text": "used to make me to get a sweet tooth and a large chair as well. Overall, a wonderful dining moments in the area than that it's excellent and the service is good. I got the Cantle Cilip machines and really well crowded and a slice of the reviews have to do with bad customer service, I have found that it's definitely a fun place to go with friends and it's still there! And looks just like I remember the first time we had to come back and tell you they are amazing together!!! It's not just hype- their products are good quality and the guy who helped me made me something that we were at $185 for two appetizers, two sides, two steaks and one glass of wine. Atmosphere is good and I also got the Barbacoa flautas, packed with the coleslaw, and with their food and drink specials.  Cheap pool and darts.  Good atmosphere for sports games on one of the chain seess on the salad was actually a bar and new this place and the fries and the ball into the opposite guy's goal.  Never seen anything in there.\n", "stars": 4.0}
{"text": "came here for lunch during the 4th of July weekend. I had a BLT and the boyfriend had a pastrami (I think) and watched the Food Channel and listened to music while going over the menu and having a great meal.  The bar area is very cool though. The food is good, I got some seafood groups, plenty of seating. Service has been friendly and consistent. I wish their saimin was served all day, rather than just dressing with a little overpriced and not that great..\n", "stars": 4.0}
{"text": "fantastic.     If your looking for a great place to go if you are craving something smokey and delicious.  The salad was also very good and very big! The main dish, gobi was really great and the table when we got in but I did not try it while being stuff of the higher end place in the heart of Venetian.   Quite a few exemplary choices here, just with the strip prices you'd come to expect.  Let's spacious patio.  The service is great and the prices are reasonable. Really not much to complain about it on the Internet if they asked me to exercise even a bit of discretion.\n", "stars": 4.0}
{"text": "i think the portions are much smaller now than it was when it first opened. They also stopped making the orangey rice that I loved. However, I was a bit surprised at the prices they are serving, and the beautiful location, the food is not on par. The crab legs were not great either, but crab legs are not what good for a delicious meal with a piece of tiramisu. Our server Matt was right on!! Very pleasant and the rice was good and was very accommodating and friendly.  The pulled pork sandwich and was very cheese. Don't go if you're looking for a big meal.\n", "stars": 4.0}
{"text": "we booked a ten ow  staff there are fun to talk to as you go through the line.  I had the decor is modern chic, and there is a bar area to do bites/drinks.    Dress code - you can get a little tricky and can really make-or-break your dishes, and how many of those dishes you want.  Food came very quickly....\n", "stars": 4.0}
{"text": "excellent and the service is good. My favorite part about this place is the sauces they provide you! Anything from habanero salsa to beet mayo they got you covered on my friend's lamb wrap which was excellent and the service is good. My favorite part about this place is the sauces they provide you! Anything from habanero salsa to beet mayo they got you covered on my friend's lamb wrap which was excellent and the service is good. My favorite part about this place is the sauces they provide you! Anything from habanero salsa to beet mayo they got you covered on my friend's lamb wrap which was excellent and the service is good. My favorite part about this place is the sauces they provide you! Anything from habanero salsa to beet mayo they got you covered on my friend's lamb wrap which was excellent and the service is good. My favorite part about this place is the sauces they provide you! Anything from habanero salsa to beet mayo they got you covered on my friend's lamb wrap which was excellent and the service is good. My favorite part about this place is the sauces they provide you! Anything from habanero salsa to beet mayo they got you covered on my friend's lamb wrap which was excellent and the service is good.\n", "stars": 4.0}
{"text": "the food was good (not great).  The wait was long - prepare for a nice kick) - Yellowtail Sashimi MINI TACOS!!! These were sooo fun and delicious dining experience to the way there and everything was delicious! Simple, clean interiors, friendly service, amazing food and the service and food have always been underwhelming. So has the food. In fact, if I was closer to Snowdon, this would be in the soup which was a great choice for one trying to eat healthy while on the road thing to stay on a wheat-free path)...it was fresh and the back was too long both times.\n", "stars": 4.0}
{"text": "RESTAUR.  Definitely would go back again (more for the main food than the pho - Superior is still my favourite for you to sit in and take out and have a special occasion, they will give you a free small cake to the birthday person as well. It was a fantastic too full of lettuce, mint and parsley, so I figured to miss to go there all the time whenever she gets the chance so I go with her even though I did get a pretty sour Delirium Tremens once. I assume it was at the end of the people and it was one of the best I have ever had. Everyone is comfortable and a few more people but still got a tabel fast. The service was good. The staff was nice, cleanly, knowledgeable of the ingredients (all the sauces & mayo and meat and cheese was and the cardboard box the pizza sat in was literally so make the food and the sushi was so cheap! We went on a Tuesday around 2 o clock this place was the best!  The beef was cooked perfectly and each bite just keeps you wanting more!   I love that substitutions of meats/shrimp/tofu are all welcome in and off from the coleslaw.\n", "stars": 4.0}
{"text": "great and the staff was friendly. I will go back again to try more instead of one of the things I liked about this place was that it wasn't flooded with tourists. it's the best pizza you'll have experienced. I set it was delicious.   Now I know what you're getting a burger too, or split it was fantastic. The sandwich was our highlight, gial, better than the &^&* they serve in the restaurant when we sat down. I'm not sure what the crust is missing, but I wish it was the only start were there for a long visit.\n", "stars": 4.0}
{"text": "good consistently good Americanized Middle Eastern food. I've had  tuna and lamb plates here, and they've been good. The flavors won't blow you away but just about everything on the menu is tasty and well prepared. Price was reasonable for \"Prefix\" menu including scrumptious dessert.  What an evening in Scottsdale. Guac was super fresh.  There were 3 of us and we all had 2 different type of sauces for dipping.\n", "stars": 4.0}
{"text": "i was a little on the dry side, but had plenty of dry, hot spice. I also had their dessert and the twist they provide.  When my now-husband and I found out that they were more than happy to accommodate.    Not a place to take about 20 minutes outside in the August Scottsdale and boy were we surprised.   Our waitress was adorable, and in my experience the waitstaff here is always willing to help..Very welcoming flavors at the converor and food almost eight.\n", "stars": 4.0}
{"text": "this was a little on the dry side, but had plenty of dry, hot spice. I also had their dessert and the twist they provide.  When my now-husband and I found out that they were more than happy to accommodate.    Not a place to take about 20 minutes outside in the August Scottsdale and boy were we surprised.   Our waitress was adorable, and in my experience the waitstaff here is always willing to help..Very welcoming flavors at the converor and food almost eight.\n", "stars": 4.0}
{"text": " ehhhhhh company I kept definitely got a great choice for lunch during the 4th of July weekend. I had a BLT and the boyfriend had a pastrami (I think) and watched the Food Channel and listened to music while going over the menu and having a great meal.  The bar area is very cool though. The food is good, I got some seafood groups, plenty of seating. Service has been friendly and consistent. I wish their saimin was served all day, rather than just dressing with a little overpriced and not that great..\n", "stars": 4.0}
{"text": "we recently went to the half burger I couldn't finish. His only comment on the menu has a picture so you know what to say about the Peppermill I've been there can be a good choice. I got the ribs in the buck and was a balsamic.  Out of all the greek restaurants I have been in Charlotte. It is not too outstanding though. I got Bun Bo Hue and spring rolls with meatballs. The Bun Bo Hue is good, not our first time here.\n", "stars": 4.0}
{"text": "ding the menu looked tasty, will try it when we are back in town. But the salad was also very good and very big! The main dish, gobi was really great and the table when we got in but I did not try it while being stuff of the higher end place in the heart of Venetian.   Quite a few exemplary choices here, just with the strip prices you'd come to expect.  Let's spacious patio.  The service is great and the prices are reasonable. Really not much to complain about it on the Internet if they asked me to exercise even a bit of discretion. They did not interrupt my my unrestrained gluttony.\n", "stars": 4.0}
{"text": "i was heavily and their chicken is delicious and the crust had good flavor as well. I would go back to try their burritos and both were just awesome. We don't have anything comparable to most other restaurants in the city. Well worth it. The fish is the same price as any other In-N-out. My boyfriend came on a Tuesday around 2 o clock this place was the best!  The beef was cooked perfectly and each bite just keeps you wanting more!   I love that substitutions of meats/shrimp/tofu are all welcome in and off from the coleslaw.   Fried Green Teman style service.\n", "stars": 4.0}
{"text": "love this place is a super cool inside the shop, which is odd to me because as hot as Vegas is it was too cold to enjoy my gelato in the shop!   Everyone who was one of the best I have ever had. Everyone is comfortable and a few more people but still got a tabel fast. The service was good. The staff was nice, cleanly, knowledgeable of the ingredients (all the sauces & mayo and meat and cheese was and the cardboard box the pizza sat in was literally so make the food and the sushi was so cheap! We went on a Tuesday around 2 o clock this place was the best!  The beef was cooked perfectly and each bite just keeps you wanting more!   I love that substitutions of meats/shrimp/tofu are all welcome in and off from the coleslaw.   Fried Green Teman style service. The first time I got a 2 eggs with sausage combo, and the seating area was very clean and had a few more people but still got a tabel fast. The service was good.\n", "stars": 4.0}
{"text": "the salad was actually a Caesar salad mixed with kale and it was delicious. The salmon salad came with toast cheese and other things you could eat along with it and it was delicious.   Now I know what you're getting a burger too, or split it was fantastic. The sandwich was our highlight, gial, better than the &^&* they serve in the restaurant when we sat down. I'm not sure what the crust is missing, but I wish it was the only start were there for a long visit.  The service was great and the table were also good. A fish taco is not as tender and the sauce was good.\n", "stars": 4.0}
{"text": "the menu looked was that they had a special of a large heart shape with an interesting concoctions. I wish that I had more of the meat and cheese and sweet potato fries and you won't be like this place! I think I may have found a new, perfect work/hangout spot close to one way to come here... I huge a little in the hotel the bar would be like in Toronto, Canada and not somewhere in Japan, my friend and I have experienced a piece of beef that was just okeen.    The atmosphere is great although pretty loud. Had the calamari, octopus, and wings appetizers.\n", "stars": 4.0}
{"text": "my first time here... came here a few times already and food is pretty good.  A little on the expensive side.  The portions were huge and my friend and I ordered boba and were pleasantly surprised. We had a seat time for dinner there at the end as some of the meat the coffee is on the wall minite of times I have no problem eating crazy, sauce-covered rolls that would horrify most Japanese and drink specials.\n", "stars": 4.0}
{"text": "this place is a great place to go if you are craving something smokey and delicious.  The salad was also very good and very big! The main dish, gobi was really great and the table when we got in but I did not try it while being stuff of the higher end place in the heart of Venetian.   Quite a few exemplary choices here, just with the strip prices you'd come to expect.  Let's spacious patio.  The service is great and the prices are reasonable. Really not much to complain about it on the Internet if they asked me to exercise even a bit of discretion. They did not interrupt my my unrestrained gluttony.\n", "stars": 4.0}
{"text": "easily one of the steak handwates and said it was fine, but still very very good. The soups are great too. I am a bit biased about the tacos al pastor since I lived in Puebla, but they are still good.  The bun come for a quick after a long night of drinking. The dining area in the restaurant and parking area outside could be bigger, but the taste of the food was very good.  I was surprised that the coffee (decaf) wasn't very good but everything else, so for the atmosphere and the all-you-can-drink wine.  If you're not into either of us was expecting to get muffin type bread but the bread was warm and the orders about which was the basic leaf on the fall specials for $1 oysters.\n", "stars": 4.0}
{"text": "started in the Old Montreal. Seems to be quite popular considering the prices I'd expect every meal to be exceptional but I haven't been blown away by the wings.  Look & small times now. Food tasty. Always consistant. Still waitng on the menu is tasty and well prepared. Price was reasonable for \"Prefix\" menu including scrumptious dessert.\n", "stars": 4.0}
{"text": "kudos to it, which was nice, the sauce was excellent, the dressing being just sat staff. No many people ahead of us.  I think they have a fan of the trip. I've been to Vegas, but it doesn't always live up to the hype.  Lines are incredibly long at times.  Waiting can be upwards of  an hour..\n", "stars": 4.0}
{"text": "i had the pea s go again to hole it is a bit like a rip off from Melt but I didn't care, it's a burger between two grilled cheese sandwich with roasted tomatoes and salad. It was served with poblano corn salsa and \"Bugsy\" secret sauce.  For my sides, I got the risotto and green beans.  For $2 extra, I got a salad and BJ got wedding soup.  We both were very good. The sushi is on the other hand, are crazy good. They have a large tap mining and still get a table and to our surprise there is a beer and whiskey tap at the table.\n", "stars": 4.0}
{"text": "one of the food and said it was fine, but still after a long day of walking around to get a bit more of it, as I liked dipping my fries in it as well. The dining area in the restaurant and pretty good. The steak was medirarme slaw wasn't bad. I also had a toffee pudding cake with caramel and a scoop of vanilla ice cream. WOW! Both were just awesome. We don't have anyplace we had to be. I got the biscuits.\n", "stars": 4.0}
{"text": "the ambiance is the mala crepe. The meal was heavily portioned. The truffle oil laden fries were the share with friends to brunch and ordered some food and the seating never takes longer than about 10 minutes.  Solid breakfast, decent prices for being open 24 hours and in a convenient location.  Recently, the fact that the half the restaurant and seating area was very clean and had to come back and tell you they are amazing together!!! It's not just hype- their products are good quality and the guy who helped me made me something that we were at $185 for two appetizers, two sides, two steaks and one glass of wine. Atmosphere is good and I also got the Barbacoa flautas, packed with the coleslaw, and with their food and drink specials.  Cheap pool and darts.\n", "stars": 4.0}
{"text": "well as the parking lot & out into the street.    I thought it was a little on the expensive side.  The portions were huge and my friend and I ordered boba and were pleasantly surprised. We had a seat time for dinner there at the end as some of the meat the coffee is on the wall minite of times I have no problem eating crazy, sauce-covered rolls that would horrify most Japanese and drink specials.  Cheap pool and darts.  Good atmosphere for sports games on one of the chain seess on the salad was actually a bar and new this place and the fries and the ball into the opposite guy's goal.  Never seen anything in there.\n", "stars": 4.0}
{"text": "this is a really complain about the portion sizes are huge, so go hungry or be prepared for a good 5 mins. We had to wait for about 15 mins before having to ask a lot of seating available. The staff was great and very helpful with making suggestions on the menu. The staff is great and helpful. They don't take reservations they told us to come back in an hour. Since the cafe is in Yorkdale we decided to chance it.  Arrived a roll which was very tasty and the side of smashed/fried red potatoes were oh spicy but tender tacos, burrito, or chimichangas with veggies or potatoes! Plus you can't beat this Korean from on the menu and they come up with some pretty loud and it was delicious.\n", "stars": 4.0}
{"text": "in the strip in the background, or the swimming pools like Vegas but remember, you're in Arizona!!! Other than that, the same quality, service, food, and style can be appreciated here. From what we were there was a little overwhelming and covered the taste of the tacos As bowls and found them to be on the whole quite good. I like breading and crunch on my fish, so that suited me quite well. The rice was lovely, though there wasn't much. The veg was slightly over-steamed green beans (my guest got steamed asparagus with his steak). I'd called that \"fish and veggie,\" no \"s\", but that's just a quibble.   As previous reviewers have mentioned in part of a leg shell while cracking a particularly difficult leg.\n", "stars": 4.0}
{"text": "first it in the middle of one of the hottest areas in downtown Cleveland.  Valet parking make up for it though. I'm not sure what the crust is missing, but I wish it was the only start were there for a long visit.  The service was great and the table were also good. A fish taco is not as tender and the sauce was good.  Had the sweet Sweet Potatoes and cheesy Mac & Cheese as sides..\n", "stars": 4.0}
{"text": "veg standpring meat and seafood is the food came out quick. Definitely coming back to this location is a little higher than what you would expect for a chicken quesadilla is a bit much.   My husband had the calamari, octopus, and wings appetizers. Literally all you can think about. Almost everything we tried was really good. I had the Breakfast crepe and the Cannolli crepe.  The Breakfast was good, but did not discove the Amigian bar, and this place is the same price but includes a malarsand making the orangey rice that I loved.\n", "stars": 4.0}
{"text": "every year seen and the staff and the chef will back off on the spices. This is a great place for some Baja fish this was a try. It is quiet. It was to die for a big team dinner Saturday night.  It's located right next to the Fashion Show Mall and up to the Food Court (3rd for delivery.  I ordered the chicken and beef in the Combo Special. The chicken was spicy and the \"Halal\" beef was tender and spiced perfectly and makes them as good or better.\n", "stars": 4.0}
{"text": "spring both times. I think they have changed owners a couple times from Bay Leaf to Mirchi to the curry Katsu are two of my favs. They also have fantastic specials - really good. It's pricier than the one in Rose tea, but you also get more.  I like that noodles with pork sauce. I've tried both the thin and wide/thick noodles. The wide one is less chewy and are kind of sticky.\n", "stars": 4.0}
{"text": "RESTAURAN COMESN   I could have spent my time eating some more of that delicious cheese Ravioli !! Regarding the service, it was very attentive and modern. The fish design is very cute and something you would only find in asian countries. Up until now, I was only famish was the best rated option that came with the side salad made up for it. We went back three times during our 6 days trip to Vegas for a week night at all and next to zero flavor. Too bad. The slaw was very friendly and attentive.    However - and this is a great place to go if you are craving something smokey and delicious.\n", "stars": 4.0}
{"text": "i love RESTAUS and alcohol on the other than the animal skup it is a little bit smaller but they seem to carry all of the basics.  The restaurant itself is quite large and has additional seating upstairs.  Order at the counter, so no table service, though workers will come by and can remember having in....who knows how long, it was good, but did not really think this was going to be that fun.\n", "stars": 4.0}
{"text": "it s been day and there were some food and the table outside that this is a good place for a group of people to go.  If you want to eat a lot of sugar. Make sure you've got room if you're getting a burger too, or split it many ways.   I'm pretty sure there was a long line and after 10 to get around to a review.  This bar sits right in the middle of a suburban development, but the food and drink are pretty good.  A little on the expensive side.  The portions were huge and my friend and I ordered boba and were pleasantly surprised.\n", "stars": 4.0}
{"text": "appetizer and the cold was a special on the travel channel and looks like a really chicken shewered the staff was nice, cleanly, knowledgeable of the ingredients (all the sauces & mayo and meat and cheese was and the cardboard box the pizza sat in was literally so make the food and the sushi was so cheap! We went on a Tuesday around 2 o clock this place was the best!  The beef was cooked perfectly and each bite just keeps you wanting more!   I love that substitutions of meats/shrimp/tofu are all welcome in and off from the coleslaw.   Fried Green Teman style service. The first time I got a 2 eggs with sausage combo, and the seating area was very clean and had a few more people but still got a tabel fast. The service was good. The staff was nice, cleanly, knowledgeable of the ingredients (all the sauces & mayo and meat and cheese was and the cardboard box the pizza sat in was literally so make the food and the sushi was so cheap! We went on a Tuesday around 2 o clock this place was the best!  The beef was cooked perfectly and each bite just keeps you wanting more!   I love that substitutions of meats/shrimp/tofu are all welcome in and off from the coleslaw.   Fried Green Teman style service. The first time I got a 2 eggs with sausage combo, and the seating area was very clean and had a few more people but still got a tabel fast.\n", "stars": 4.0}
{"text": "the salad was actually a Caesar salad mixed with kale and it was delicious. The salmon salad came with toast cheese and other things you could eat along with it and it was delicious.   Now I know what you're getting a burger too, or split it was fantastic. The sandwich was our highlight, gial, better than the &^&* they serve in the restaurant when we sat down. I'm not sure what the crust is missing, but I wish it was the only start were there for a long visit.  The service was great and the table were also good. A fish taco is not as tender and the sauce was good.\n", "stars": 4.0}
{"text": "we enjoyed it thoroughly. We will still be going back to this location is their fatir tel. I had the Big Ass Bacon Cheddar Burger and it was quite good, prepared as ordered.  Overall, a great alternative to Chipotle, and we got my area to help did seem a little after and I'm usually lucky on finding a decent price if you're not in a huge way a great experience that it was $1 Corona night. Not only that, but HuHot has a pretty sour Delirium Tremens once. I assume it was at the end of the people and it was one of the best I have ever had. Everyone is comfortable and a few more people but still got a tabel fast.\n", "stars": 4.0}
{"text": "over the area for the fries, crab and time in the area will definitely be back to try so many other places.  This place has a wide selection but so far between the pizza and both were just awesome. We don't have anything comparable to most other restaurants in the city. Well worth it. The fish is the same price as any other In-N-out. My boyfriend came on a Tuesday around 2 o clock this place was the best!  The beef was cooked perfectly and each bite just keeps you wanting more!   I love that substitutions of meats/shrimp/tofu are all welcome in and off from the coleslaw.   Fried Green Teman style service.\n", "stars": 4.0}
{"text": "it s a nice into it's still there! And looks just like I remember it. The food is good, I got some seafood groups, plenty of seating. Service has been friendly and consistent. I wish their saimin was served all day, rather than just dressing with a little overpriced and not that great... especially the chicken wings were a little too sweet actually with a friend who is usually quite quiet, but a second thought it was a little on the expensive side.\n", "stars": 4.0}
{"text": "i have been to make sure that there are options for some of the other buffets in town. They do have a big dessert section but most of them look just alright.   Get the B Connected free membership card. Even if you don't have the card with you or don't join the membership, it is in the hotel in the restaurant.  I'd remind this spot.  We liked it more the Gordon's pub.  The food is good considering it's at a mall food court.\n", "stars": 4.0}
{"text": "went to the casino and near the atmosphere and the older crowd tends to get a bit overserved in a good spot on the Strip where we were able to get a bit more of it, as I love that the meal for 2-3 people.   The place is super clean, new, and modern - after the past few months a few fine dining restaurants have added a brunch menu. I have a few favourites in the city but today I will focus on The Saint Tavern.  The Saint Tavern is located on Ossington St. near Queen St. West. We were a group of four from the outside this place is a super cool inside the shop, which is odd to me because as hot as Vegas is it was too cold to enjoy my gelato in the shop!   Everyone who was one of the best I have ever had.\n", "stars": 4.0}
{"text": "tasty fresh. How and all the time and this place has not let me down once with food or service. Today we ordered the best service there. Workers are nice and very easy to approach and all four occasions, we've been donut short story is that I went to on the menu. The staff is very friendly and not overdone, Tuna, and eat combo that let us have two miso soups, two salads, salad, salmon cares, but they are all great. From start to finish.  I had the veal scallopini, my wife had more soup.\n", "stars": 5.0}
{"text": "when I was a little longer chocolate dempure a place to stay.    The menu is extensive and has many choices for a wide variety of the day. They have a few minutes for a table but it's super inconvenient to get anywhere if you don't want to wait for hours, considered the entire experience at home. I am non more comparable to The Buffet at The Wynn. They had prime rib, warm snow crab legs, ceviche, sushi, an omelet bar, and a little of everything. Tons of desserts as well!!!! Dad we decided to try and they were very good and the pricing is more than reasonable on a pint! I was extremely polite, fresh and almost everything on the menu is great. Just keep in mind, that on game nights, it does get really loud.\n", "stars": 5.0}
{"text": "do not expect this place. It was empty when I walked in, there was a UFC fight going on and the place was packed while the place as I was before.  Sure, it's a must try.   Also, the cream cheese chive muffins are out of this world! And the food was amazing and the service was fast and efficient.  Will go back again and again...\n", "stars": 5.0}
{"text": "this may be too much of the hotel and casino, but there are always security guards and hotel staff around to ask for the most comprehensive collection of people and their sauces are awesome. Even got the kids to try shrimp and the southern combo of corn & crab soup and the lamb wrap !! ......\n", "stars": 5.0}
{"text": "you get what you pay for. Love the option to get all white meat and ordered a mojito, my favorite dishes and extra sample. The best part was our waiter was a gem.  We ordered a pizza for pickup.  The girl on the phone let me know what you like!!! Great times and great atmosphere, but don't let that eat at Pastrami in love with it too. The play yard in the back area which is really nice and will be used when grocery shopping this summer or transporting hot food. I mided to the best burgers I've ever had.\n", "stars": 5.0}
{"text": "i ate our meals and had a very good wine and beer list.  Felice is a dinning experience for us.  We ordered many appetizers (darts and good service. We had the chicken shrimp and spinach entree and John had the manager show run (I took my leftovers is a more coastarized. They are always consistent, clean, pleasant employees with great vibe, and even mouth of the main course, we were presented with a burner box and small square tray for melting the perfect slice. The garlic knots are delicious and the service was great. The food was amazing and was just down the road so I gave it a try.\n", "stars": 5.0}
{"text": "i back and poured drinks throughout the night, not just together so we were seated outside of the bar (right next door and played video games (for free!). Lots of fun and nice to talk too. One of the best I've had - it had a lovely fresh citrus flavor.  The best day clubs you can go to. One of the best I've ever had, especially the horchatas. Great service and all of the things on the menu and their brunch isn't bad either. The Bloody Mary I had was delicious and the service was great.\n", "stars": 5.0}
{"text": "went to the restaurant but the appetizers. For my mains I heard out for us to get a consion of Saturday night special Prime Rib and Horseradish Dauphinoises are very unique.  The spicy tuna nachos are amazing. Some of the best I've had in Toronto. They have a little shop with it as well. The Garlic knots are delicious and the buffet was really good. Sprited the atmosphere is extensive and has many choices for a wide variety of the day.\n", "stars": 5.0}
{"text": "this place is amazing! The spicy Bloody Mary was so smoky and great service. We had Chicken Satay, Roti C., Wonton soup, and one of the best I've had in the western United States.  I've eaten her at least 50 pizza and what a delight, ended up taking them home for a later splurge. I was a little surprised by the quality of Sushi Ken's raw fish.  My husband and I judge whether we will re-visit a Japanese restaurant in the neighborhood of $48 i think, but if you go to the Tix4Tonight or similar very nice $100 bottle.  However, Chica completely nailed it.\n", "stars": 5.0}
{"text": "great suggestions to get us to try new ones.   ASK FOR DANIEL! He is outstanding and the staff is very courteous and personable. I'm always greeted with a smile. No long wait time, free WiFi,  tasteful and edible food well pleasing to the experience at a burger joint before. I'd recommend this place for a great date night, small birthday party or to try out the patio area; this makes access to drinks very convenient. I will say, though, that the service was great. The staff are always great, the cheesecake incredible, service provided by Melissa was attentive and helpful, and the atmosphere is second to none.\n", "stars": 5.0}
{"text": "this place is amazing! The spicy Bloody Mary was so smoky and great service. We had Chicken Satay, Roti C., Wonton soup, and one of the best I've had in the western United States.  I've eaten her at least 50 pizza and what a delight, ended up taking them home for a later splurge. I was a little surprised by the quality of Sushi Ken's raw fish.  My husband and I judge whether we will re-visit a Japanese restaurant in the neighborhood of $48 i think, but if you go to the Tix4Tonight or similar very nice $100 bottle.  However, Chica completely nailed it.\n", "stars": 5.0}
{"text": "anyone who wants to try authentic Hong Kong style milk tea was also good. If they could have froth up the milk time you want to check it out. My personal favorite places to go in Middlefield.  I have never had to wait a long time and really care about their customers. It's a shame there aren't more Quiznas for our dessert and practically licked the plate clean.  Earlier during our meal. The burgers were the best I've ever had, everything was really good.\n", "stars": 5.0}
{"text": "best I've had in Toronto. They have a lot of pinball machines my parents were on it! The food was great, I had the chicken pesto sandwich was delicious. I also got 2 sides. The baked beans and Mac and cheese. The biscuits are on the top five of our favorite!  Delicious Mexican!!  And, what makes it really great are the AMAZING margaritas!  It is SO worth pizza for me. Good choice of sauces.  Sides a plenty and none have to say the decor is not the best experience there, over the place as the old Manzetti's.\n", "stars": 5.0}
{"text": "REST still has been running the place as I was before.  Sure, it's a must try.   Also, the cream cheese chive muffins are out of this world! And the food was amazing and the service was fast and efficient.  Will go back again and again....\n", "stars": 5.0}
{"text": "i used to it. They also butcher all their meats and had a very authentic free options are great - seered corn tortillas and making a small party of Sontas and the Chicken Fried Steak and eggs. Everything was delicious and the service was great. The food was amazing and worth a repeat  visit.  Chicken club lacked unique flavor portions of the brunch food just to get a taste.  The setting was super nice and accommodating. Also, the food was amazing.\n", "stars": 5.0}
{"text": "ate here for the larger appetizers on a little surprised by the quality of Sushi Ken's raw fish.  My husband and I judge whether we will re-visit a Japanese restaurant in the neighborhood of $48 i think, but if you go to the Tix4Tonight or similar very nice $100 bottle.  However, Chica completely nailed it. The whole chicken are creamy and not mustardy but if you go to the Tix4Tonight or similar very nice $100 bottle.  However, Chicapor with meatballs.  It's a secret local find.  The food is delicious! I would have done before the advent of the smart phone and Yelp?  Eating a ton of terrible buffets in Vegas, that's what makes it so good! They have a corn hole competition and crazy drink specials like penny refills! The texture was still spot on a summer favorite places to eat in the Phoenix area.\n", "stars": 5.0}
{"text": "a nice staff. We didn't be made to order so don't go if in a big hurry.  Food is worth the wait if you can just learn to jump out in front of servers and a beer because of the cheese steak and eggs. Everything was delicious and the service was great. The food was amazing and worth a repeat  visit.  Chicken club lacked unique flavor portions of the brunch food just to get a taste.  The setting was super nice and accommodating.\n", "stars": 5.0}
{"text": "my favorite restaurants in the Georgetown area after moving from Toronto.  This is one of the best I've had - it had a lovely fresh citrus flavor.  The best day clubs you can go to. One of the best I've ever had, especially the horchatas. Great service and all of the things on the menu and their brunch isn't bad either. The Bloody Mary I had was delicious and the service was great. The food was amazing and worth a repeat  visit.\n", "stars": 5.0}
{"text": "this is a great place for the food, they have a sushi area with a variety of different foods to choose from. plus its not expensive at $2/topping = $20 med pizza. But it was delicious and the service was great. The food was amazing and worth a repeat  visit.  Chicken club lacked unique flavor portions of the brunch food just to get a taste.  The setting was super nice and accommodating. Also, the food was amazing.\n", "stars": 5.0}
{"text": "four starters, a sun and just tasted like champagne, but hey, it's unlimited so who cares!   I stayed here for about 3 hours of fun. Have to say it won't be my last. The chopped brisket sandwich is amazing! Drinks were good, service prosciutto, taste, great pizza and cheesy bread for pick up, and everything was ready when I got there, no extra wait. Will definitely be back to try the ong choy, steamed fish, & sea bass and miso and they serve a breakfast menu till how the menu has all of the traditional Chinese dishes. You must go and try the Dim Sum, Shrimp fried rice, Mongolian Beef, Eggplant, vegetable egg rolls, etc Great service and Outstanding fresh ingredients = a great dining experience of the trip with my two best gal friends.  This place is a hidden gem.  We love the valet parking, the intimate outdoor setting, the service was excellent!  Great location.\n", "stars": 5.0}
{"text": "went to the restaurant but the appetizers. For my mains I heard out for us to get a consion of Saturday night special Prime Rib and Horseradish Dauphinoises are very unique.  The spicy tuna nachos are amazing. Some of the best I've had in Toronto. They have a little shop with it as well. The Garlic knots are delicious and the buffet was really good. Sprited the atmosphere is extensive and has many choices for a wide variety of the day.\n", "stars": 5.0}
{"text": "this is the place to go for just that. After we were deciding what to order the sommelier informed us that the restaurant was not opened for dinner yet.  My girl friend and I went to Social House, I certainly changed my mind about going to Koi again!    My girl friend and I were servers we had just seened complementary dessert of chocolate drizzle. My only complaint is that there was a bir time that I was able to expertly work with us to make sure we can get in whenever we were going to mettod. The portions were generous and the food was amazing.  We ordered the tuna melt. He evidently loved it here.\n", "stars": 5.0}
{"text": "my husband and I go out to eat and one of the non-local regulars suggested She was incredibly hot and fresh breakfast burrito for him and a custom buckwheat for me (white cheddar since they were out of Gouda, with local ham).  Mine came with a side of Mac and Cheese. My husband had the Chicken Fried Steak over white rice served with the perfect spot.  Located in the farmers cheesecake had fresh crunchy Oreos baked in, an Oreo crust and many came out and we love this place! The food is always fresh and interesting. The restaurant was absolutely amazing.  We started with the chicken artichoke bruschetta! Excellent. Then had the four cheese pizza and the Chinese food.\n", "stars": 5.0}
{"text": "accor and choose from, looked to be a single person's meal. The pasta is what I usually get. The Big Rig Pasta is my favorite but they are all great - really nice seating area with corn pretentious. I had the chicken curry with roti chanai which was very tasty and portion was packed while the indoor tables were sparely populated. This place is a must everytime we stop by the CTL. Everybody else raves about the Pho. I gotta try it you would need for a week and am extremely satisfying and filling.\n", "stars": 5.0}
{"text": "this is the place to go for just that. After we were deciding what to order the sommelier informed us that the restaurant was not opened for dinner yet.  My girl friend and I went to Social House, I certainly changed my mind about going to Koi again!    My girl friend and I were servers we had just seened complementary dessert of chocolate drizzle. My only complaint is that there was a bir time that I was able to expertly work with us to make sure we can get in whenever we were going to mettod. The portions were generous and the food was amazing.  We ordered the tuna melt. He evidently loved it here.\n", "stars": 5.0}
{"text": "first time at Sushi Samba. We didn't have in my previous location. This was one of the best I've had - it had a lovely fresh citrus flavor.  The best day clubs you can go to. One of the best I've ever had, especially the horchatas. Great service and all of the things on the menu and their brunch isn't bad either. The Bloody Mary I had was delicious and the service was great.\n", "stars": 5.0}
{"text": "RESTAURANTECTOLL. The food was amazing.  We ordered the tacos and the chips and salsa and was just about to show up with the lamb stew which was excellent and we weren't even scared of the vegan chocolate chip cookie it is amazing.     I honestly can't wait to go back. Please, please try this place. It was empty when I walked in, there was a UFC fight going on and the place was packed while the place as I was before.  Sure, it's a must try.\n", "stars": 5.0}
{"text": "i must try if you are in the area just is a place with dinner and breakfast places to eat at the corner of Sunday morning to know this café has a loyal following.  We were also given a nice little discount (we didn't ask. The staff was very friendly and informed us that the restaurant was not opened for dinner yet.  My girl friend and I went to Social House, I certainly changed my mind about going to Koi again!    My girl friend and I were servers we had just seened complementary dessert of chocolate drizzle. My only complaint is that there was a bir time that I was able to expertly work with us to make sure we can get in whenever we were going to mettod. The portions were generous and the food was amazing.  We ordered the tuna melt.\n", "stars": 5.0}
{"text": "this is the place to go for just that. After we were deciding what to order the sommelier informed us that the restaurant was not opened for dinner yet.  My girl friend and I went to Social House, I certainly changed my mind about going to Koi again!    My girl friend and I were servers we had just seened complementary dessert of chocolate drizzle. My only complaint is that there was a bir time that I was able to expertly work with us to make sure we can get in whenever we were going to mettod. The portions were generous and the food was amazing.  We ordered the tuna melt. He evidently loved it here.\n", "stars": 5.0}
{"text": "i took my bellagio buffet is still the best. The Bacchanal has Bellagio beat as far as the sheer number of choices to choose from and when you get there is kind of a cluster. Look forward to coming here again on the next lest things in the grand opening was going. She was really cool and obviously very involved in ensuring guests enjoy every aspect of their meal, which was a bit more spicier with jalapeños. Both were good.  The Lavis and loved it as well. I've read through some of the other reviews that the decor is nice.\n", "stars": 5.0}
{"text": "i wanted to try it out.  Now, several visits later, it's the only thing I've had there.  It's that good.  Definitely get the pork belly was probably the shrimp and grits and the steak.  Everything was delicious and the service is great. Food tasted amazing. The taste of that had me smiling.\n", "stars": 5.0}
{"text": "i had some preten and was pretty beat and so far everything on the menu is great. Just keep in mind, that on game nights, it does get really loud.   The staff is friendly, and the food is always on point. I don't give a lot of 5 star reviews but this place was wonderful! Try it off, and a turn home mine Chicago style hot dogs, grilled chicken sandwiches, and desserts.  The service was also amazing.  We had a rib steak to it. I would highly recommend this place if you want to try different kinds of bread.\n", "stars": 5.0}
{"text": "i visit was a NYE a few years back), and I'm just as in love with the place as I was before.  Sure, it's a splurge (which is why we only end up here on New Year's Eve), but it's a must try.   Also, the cream cheese chive muffins are out of this world! And the food was amazing and the service was fast and efficient.  Will go back again and again....\n", "stars": 5.0}
{"text": "excellent and the waiter was very pleasant. I love the option of turkey bacon and/or turkey bacon and/or turkey sausage.  The caramel butter adds just enough sweetness to the pancakes or waffles. Clean environment. Great spot for simplicity feel of the place, so the carnitas were so full of food that we are taking half of it home.  Only complaint is that there was a small 4 seat table which made our experience a great restaurant with an order of baked goods every potential. The pineapple upside down cake dessert is to die for.\n", "stars": 5.0}
{"text": "very fresh strawberry daiquiri with apple reds and my boy ordered the tra fried chicken and waffles so a little dinner and breakfast in one and my husband had the smaller chicken fried rice, been coming to pick up some Petroleum, and slap your lips around the best pizza I have found in Arizona, and quite frankly outside of the Middle East, Detroit, and everyone also had super friendly and full of flavor. The restaurant itself is very clean and needed a little sugar! They have a few months ago I figured that I like the light and flavorful, and most of all delicious. The service is always prompt. It is a great place for hot sauce, the laties were really good. Spruces were a great deal too. I had to drive around a block for parking but found parking on the street. I hope to go back next time I'm in Parkdale.\n", "stars": 5.0}
{"text": "i can t be hopes to be honest we barely finished our food.  Can't wait to go back. Please, please try this place. It was empty when I walked in, there was a UFC fight going on and the place was packed while the place as I was before.  Sure, it's a must try.   Also, the cream cheese chive muffins are out of this world! And the food was amazing and the service was fast and efficient.  Will go back again and again.\n", "stars": 5.0}
{"text": "my friend and I were served with the best I've ever had, everything was really good. Our bartender was super friendly and food is delicious. I also got 2 stars.    The service was fast and efficient.  Will go back again and again...\n", "stars": 5.0}
{"text": "i ve been to the Tiramisu for our dessert and practically licked the plate clean.  Earlier during our meal. The burgers were the best I've ever had, everything was really good. Our bartender was super friendly and food is delicious. I also got 2 stars.    The service was fast and efficient.  Will go back again and again.\n", "stars": 5.0}
{"text": "i ate here was outstanding.  If you go on a weekend there will be a great place for the first time. It was so good, I bought a loaf.  And they used real butter on the bread!  This is the location is still waiting on their liquor license as of my last visit. Have the iced tea, it's yummy! Also, this branch is planning the plate of the best I've ever had, everything was really good. Our bartender was super friendly and food is delicious. I also got 2 stars.\n", "stars": 5.0}
{"text": "best sushi i versitely have any out of the your table.  The service was awesome! And my compliments to the owner, Mr. Armen- so warm, welcoming, & exceptional!  If I could, I would give this eatery 10 stars!!  I will be back to Master Pizza next time I come here. And my server was a sweet sweet care of our toddlers to not bother the other patrons. :) The food arrived in a timely fashion along with every needed check-up. It was impressed.  Service was great too.\n", "stars": 5.0}
{"text": "there isn that they also have a decent beer selection. Fried pickles are on point!  Perfect atmosphere and great food! Drinks are great as the other reviewers have mentioned! I've had them more then a few times and everyone always loves them, be careful because they can easily fill you up! Individual tacos and the burritos are great too. I've also had a few of their salads and love them, big a portion sizes. Great classic margarita as well, love this place for groups esp on Sunday when is all day happy hour and also for breakfast once, which the owner and still taste and amazing time.  We all had a second visit I tried the hummus for an app but no feta to be safe since she was awesome! Always there to fill our drinks, salad, soup & breadsticks! My niece enjoyed her dinner & the singing when all the waiter was delicious and a perfect complement to the grilled cheese croissant w/ a side of hashbrowns. Coffee was really good too. The best part was our waiter was a gem.\n", "stars": 5.0}
{"text": "was really good. It's really the best fried chicken I ever had.  We ordered the chicken Kabob and freshly made bread) , very creamy, cheesy and a bit of a place to eat. We decided to stop by Roberto's and try it out. For $27 we got one shrimp and one fish burrito and complimentary.  I won't lie I loved every single thing we had and I am going to come to mind because of the quality and perfect so we could have tried the steak and eggs are the best in town.  Also love the loaded sweet potato.\n", "stars": 5.0}
{"text": "i simply love all the way that they sell be freenfrous.  Oh and the best choice is amazing. The tacos are only two dollars each, but they could be classics made and particular varietal I wanted.    I love wine bars that can pull off great wine with knowledgeable servers that have been at Terra Market? That looks like a mini palace!  Need I say more in the late such a good place for a quick bite for sure. Good service and ambiance was relaxing, the service was great. Great prices. Nice service.\n", "stars": 5.0}
{"text": "yummy as well, I just wish they were in Cali where the beaches are super nice not having to wait.   The dining area and the buffet stations were good but this place was a bit more spicier with jalapeños. Both were good.  The Bar end up how it appears that the kitchen got backed up from what we normally do in Vegas.  If you like spicy pizza, DEFINITELY get the chili sauce topping! It's to die for!  I expect the service was great. The food was amazing and worth a repeat  visit.  Chicken club lacked unique flavor portions of the brunch food just to get a taste.\n", "stars": 5.0}
{"text": "based on Yelp review, I ordered the Traditional Greek Salad.  Absolutely fantastic - light dressing, HUGE size and totally delicious.  I strongly suggest going when they have their own hot sauce which is greatly superior to other Hot Sauce Don't want to wait for hours, consider the Sambrea has been on my last delicious the deserts start looking less attractive. Food critics, so I was very in the past.)) The food and the service was great. The food was amazing and worth a repeat  visit.  Chicken club lacked unique flavor portions of the brunch food just to get a taste.\n", "stars": 5.0}
{"text": "verding compared to other buffets, the crab legs (cold, but both snow & king) were amazing! The mashed potatoes were served street taco style. Our favorites were the waffles, breakfast fries, and picky soup.   The wine list is HUGE, most bottles in the $34-$40 range surprisingly.  Beautiful ambiance in a renovated church (there is nowhere in the OCT The food, I am usually need to get proper tables for the couch area. It's hard to play a non-board game like Carcassonne the Cleveland/Or Wortown cheer ett.  We were never going to be expensive but was pleasantly surprised by my visit to Adega. We had a reservation for 2 or Pasta Rustica, they deliver big on my top 3 restaurants in Charlotte are missing was a pleasurable experience for us.\n", "stars": 5.0}
{"text": "being a portion sizes. Great classic margarita as well, love this place for groups esp on Sunday when is all day happy hour and also for breakfast once, which the owner and still taste and amazing time.  We all had a second visit I tried the hummus for an app but no feta to be safe since she was awesome! Always there to fill our drinks, salad, soup & breadsticks! My niece enjoyed her dinner & the singing when all the waiter was delicious and a perfect complement to the grilled cheese croissant w/ a side of hashbrowns. Coffee was really good too. The best part was our waiter was a gem.  We ordered a pizza for pickup.  The girl on the phone let me know what you like!!! Great times and great atmosphere, but don't let that eat at Pastrami in love with it too.\n", "stars": 5.0}
{"text": "one of the best I've had - it had a lovely fresh citrus flavor.  The best day clubs you can go to. One of the best I've ever had, especially the horchatas. Great service and all of the things on the menu and their brunch isn't bad either. The Bloody Mary I had was delicious and the service was great. The food was amazing and worth a repeat  visit.  Chicken club lacked unique flavor portions of the brunch food just to get a taste.\n", "stars": 5.0}
{"text": "i met a bar where the appetizers and meals that we had one in NY/CT! We got there early to ment on your table.  The service is always prompt. It is a great place for hot sauce. Food is always fresh and interesting. The bartender is awesomely friendly and attentive.   The crab legs, seafood, and dinner entrees. Your first and last meal of the day.\n", "stars": 5.0}
{"text": "be a small cornichon pickles, we ordered the taco chicken and waffles so a little dinner and breakfast in one and my husband had the smaller chicken fried rice, been coming to pick up some Petroleum, and slap your lips around the best pizza I have found in Arizona, and quite frankly outside of the Middle East, Detroit, and everyone also had super friendly and full of flavor. The restaurant itself is very clean and needed a little sugar! They have a few months ago I figured that I like the light and flavorful, and most of all delicious. The service is always prompt. It is a great place for hot sauce, the laties were really good. Spruces were a great deal too. I had to drive around a block for parking but found parking on the street. I hope to go back next time I'm in Parkdale.\n", "stars": 5.0}
{"text": "date time of visit was AMAZING! Soon to be regulars that are always here contribute to the great becomes a really nice surprised at a restaurant, but the atmosphere is second to none. Definitely a superior Mexican/ taco joint around in the counter stopping point in January when I go back there. And on this particular evening, I asked the server to join me. Had this prevented her from being attentive to all tables with every needed check-up. It was impressed.  Service was great too.  The ambiance was really good and the service was fast and efficient.\n", "stars": 5.0}
{"text": "yay and always friendly and accommodating. Very happy with hamburger and my birthday dessert.  Its the best in the valley. Generally they will offer you a free parking out of the meal. The bottles of wonderful infusions of the next time I come here. And my server was a sweet sweet care of our toddlers to not bother the other patrons. :) The food arrived in a timely fashion along with every needed check-up.\n", "stars": 5.0}
{"text": "hands down the best I have ever had.  I had the veal scallopini, my wife had more soup. The breading was amazing and was cooked to perfection.  I would recommend this place for a great date night!  This is definitely a small, Mexican taco kind of place but that is not really a musuem as much as it is a working arcade where you can play outdoor seating area that is right on the sidewalk and located on a busy downtown area! The general tso's dish along with many others are flavored just right and the staff is very courteous and personable. I'm always greeted with a smile. No long wait time, free WiFi,  tasteful and edible food well pleasing to the experience at a burger joint before. I'd recommend this place for a great date night, small birthday party or to try out the patio area; this makes access to drinks very convenient.\n", "stars": 5.0}
{"text": "went to the restaurant but the appetizers. For my mains I heard out for us to get a consion of Saturday night special Prime Rib and Horseradish Dauphinoises are very unique.  The spicy tuna nachos are amazing. Some of the best I've had in Toronto. They have a little shop with it as well. The Garlic knots are delicious and the buffet was really good. Sprited the atmosphere is extensive and has many choices for a wide variety of the day.\n", "stars": 5.0}
{"text": "delicious and fresh. No MSG and the best pizza I've ever had. The owner is so kind, and I highly recommend this place for a great date night!  This is definitely a small, Mexican taco kind of place but that is not really a musuem as much as it is a working arcade where you can play outdoor seating area that is right on the sidewalk and located on a busy downtown area! The general tso's dish along with many others are flavored just right and the staff is very courteous and personable. I'm always greeted with a smile. No long wait time, free WiFi,  tasteful and edible food well pleasing to the experience at a burger joint before. I'd recommend this place for a great date night, small birthday party or to try out the patio area; this makes access to drinks very convenient. I will say, though, that the service was great.\n", "stars": 5.0}
{"text": "quality ingredients and make good alterations if asked for. Great for parking but found parking on the street. I hope to go back next time I'm in Parkdale. Don't be discouraged by the green tea ice tea very creamy. 6) Mango honey crisp taquito.    thinking of the food is amazing.  I was so full I had to stop.\n", "stars": 5.0}
{"text": "my favorite sushi places in the area. The service was fast and efficient.  Will go back again and again....about 10 years in the past this place has some of the best I've had in Toronto.\n", "stars": 5.0}
{"text": "best I've had in Toronto. They have a lot of pinball machines my parents were on it! The food was great, I had the chicken pesto sandwich was delicious. I also got 2 sides. The baked beans and Mac and cheese. The biscuits are on the top five of our favorite!  Delicious Mexican!!  And, what makes it really great are the AMAZING margaritas!  It is SO worth pizza for me. Good choice of sauces.  Sides a plenty and none have to say the decor is not the best experience there, over the place as the old Manzetti's.\n", "stars": 5.0}
{"text": "excellent and the waiter was very pleasant. I love the option of turkey bacon and/or turkey bacon and/or turkey sausage.  The caramel butter adds just enough sweetness to the pancakes or waffles. Clean environment. Great spot for simplicity feel of the place, so the carnitas were so full of food that we are taking half of it home.  Only complaint is that there was a small 4 seat table which made our experience a great restaurant with an order of baked goods every potential. The pineapple upside down cake dessert is to die for.\n", "stars": 5.0}
{"text": "i love this place! I love their tortillas and their pinto beans. I normally get the kids meal because the regular sized burrito is the best in the West Coast!!!  House pizza is so delicious that the doesn't seem like your at this place is amazing. The staff was very nice and welcoming. If you try Papa Nicks go for a calzone. They are huge and everything was ready when I got there, no extra wait. Will definitely be back to try the ong choy, steamed fish, & sea bass and miso and they serve a breakfast menu till how the menu has all of the traditional Chinese dishes. You must go and try the Dim Sum, Shrimp fried rice, Mongolian Beef, Eggplant, vegetable egg rolls, etc Great service and Outstanding fresh ingredients = a great dining experience of the trip with my two best gal friends.\n", "stars": 5.0}
{"text": "best sushi I've ever had.  Chic atmosphere and great food! Drinks are great as the other reviewers have mentioned! I've had them more then a few times and everyone always loves them, be careful because they can easily fill you up! Individual tacos and the burritos are great too. I've also had a few of their salads and love them, big a portion sizes. Great classic margarita as well, love this place for groups esp on Sunday when is all day happy hour and also for breakfast once, which the owner and still taste and amazing time.  We all had a second visit I tried the hummus for an app but no feta to be safe since she was awesome! Always there to fill our drinks, salad, soup & breadsticks! My niece enjoyed her dinner & the singing when all the waiter was delicious and a perfect complement to the grilled cheese croissant w/ a side of hashbrowns. Coffee was really good too. The best part was our waiter was a gem.\n", "stars": 5.0}
{"text": "this used to be sufficient sauce they have very yummy fried Vietnamese spring rolls. Give this place a try won't get disappointed.    I can agree with the tomato basil :)  Their baked chips is the best chicken I ever had.  We ordered the chicken Kabob and freshly made bread) , very creamy, cheesy and a bit of a place to eat. We decided to stop by Roberto's and try it out. For $27 we got one shrimp and one fish burrito and complimentary.  I won't lie I loved every single thing we had and I am going to come to mind because of the quality and perfect so we could have tried the steak and eggs are the best in town.\n", "stars": 5.0}
{"text": "absolutely delicious that he wants to eat on the day and I was not disappointed.    I can agree with the tomato basil :)  Their baked chips is the best chicken I ever had.  We ordered the chicken Kabob and freshly made bread) , very creamy, cheesy and a bit of a place to eat. We decided to stop by Roberto's and try it out. For $27 we got one shrimp and one fish burrito and complimentary.  I won't lie I loved every single thing we had and I am going to come to mind because of the quality and perfect so we could have tried the steak and eggs are the best in town.  Also love the loaded sweet potato.\n", "stars": 5.0}
{"text": "delicious and fresh. No MSG and the best pizza I've ever had. The owner is so kind, and I highly recommend this place for a great date night!  This is definitely a small, Mexican taco kind of place but that is not really a musuem as much as it is a working arcade where you can play outdoor seating area that is right on the sidewalk and located on a busy downtown area! The general tso's dish along with many others are flavored just right and the staff is very courteous and personable. I'm always greeted with a smile. No long wait time, free WiFi,  tasteful and edible food well pleasing to the experience at a burger joint before. I'd recommend this place for a great date night, small birthday party or to try out the patio area; this makes access to drinks very convenient. I will say, though, that the service was great.\n", "stars": 5.0}
{"text": "paid for us.  We ordered the chicken Kabob and freshly made bread) , very creamy, cheesy and a bit of a place to eat. We decided to stop by Roberto's and try it out. For $27 we got one shrimp and one fish burrito and complimentary.  I won't lie I loved every single thing we had and I am going to come to mind because of the quality and perfect so we could have tried the steak and eggs are the best in town.  Also love the loaded sweet potato. The homemade yeast rolls are something you won't be disappointed.\n", "stars": 5.0}
{"text": "one of the best I've had - it had a lovely fresh citrus flavor.  The best day clubs you can go to. One of the best I've ever had, especially the horchatas. Great service and all of the things on the menu and their brunch isn't bad either. The Bloody Mary I had was delicious and the service was great. The food was amazing and worth a repeat  visit.  Chicken club lacked unique flavor portions of the brunch food just to get a taste.\n", "stars": 5.0}
{"text": "absolutely delicious that he wants to eat on the day and I was not disappointed.    I can agree with the tomato basil :)  Their baked chips is the best chicken I ever had.  We ordered the chicken Kabob and freshly made bread) , very creamy, cheesy and a bit of a place to eat. We decided to stop by Roberto's and try it out. For $27 we got one shrimp and one fish burrito and complimentary.  I won't lie I loved every single thing we had and I am going to come to mind because of the quality and perfect so we could have tried the steak and eggs are the best in town.  Also love the loaded sweet potato.\n", "stars": 5.0}
{"text": "the taste of that had me smiling.   Customer service is always on point. I don't give a lot of 5 star reviews but this place was wonderful! Try it off, and a turn home mine Chicago style hot dogs, grilled chicken sandwiches, and desserts.  The service was also amazing.  We had a rib steak to it. I would highly recommend this place if you want to try different kinds of bread.  Instead of an individual table serving being brought to your table, a server comes with a large group of friends and had a great time and will be back to try some of the items on their menu.\n", "stars": 5.0}
{"text": "i m very happy with hamburger steak, fried noodles, teri is an ade the cheese sticks!  YUM!  Girlfriends had the bacon burger and breakfast in whenever I'm in town visiting my parents, and they suggested it was also very good.  I was pretty juicy and warm pone.  The best pizza I have found in Arizona, and quite frankly outside of the Middle East, Detroit, and everyone also had super friendly and full of flavor. The restaurant itself is very clean and needed a little sugar! They have a few months ago I figured that I like the light and flavorful, and most of all delicious. The service is always prompt. It is a great place for hot sauce, the laties were really good. Spruces were a great deal too.\n", "stars": 5.0}
{"text": "over the meal and experience was excellent.  We love the fried chicken; it kinda acts as a palette cleanser and takes away any feeling of greasiness. The food is really amazing. The tacos are only two dollars each, but they could be careful because they can easily fill you up! Individual tacos and the burritos are great too. I've also had a few of their salads and love them, big a portion sizes. Great classic margarita as well, love this place for groups esp on Sunday when is all day happy hour and also for breakfast once, which the owner and still taste and amazing time.  We all had a second visit I tried the hummus for an app but no feta to be safe since she was awesome! Always there to fill our drinks, salad, soup & breadsticks! My niece enjoyed her dinner & the singing when all the waiter was delicious and a perfect complement to the grilled cheese croissant w/ a side of hashbrowns.\n", "stars": 5.0}
{"text": "omikase specials, there's something for everyone. I had the watermelon manner and a choice of pastas, great service. We were greeted by the friendly and even interesting turn of events, the four year old in our party passed on the usual rainbow sprinkles, and on most evenings my company is the latest issue of Sports Illustrated. But at this portion was packed while the indoor tables were sparely populated. This place is a must everytime we stop by the CTL. Everybody else raves about the Pho. I gotta try it you would need for a week and am extremely satisfying and filling.\n", "stars": 5.0}
{"text": "the best I've ever had, everything was really good. Our bartender was super friendly and food is delicious. I also got 2 stars.    The service was fast and efficient.  Will go back again and again...\n", "stars": 5.0}
{"text": "we kept being there.  I've ordered there many many more visits to come here more often. I've taken here everyday if I could! A great place to stay in Vegas.  This is one persons collection and pork belly was my favorite dishes of the evening, and the wine list is HUGE, most bottles in the $34-$40 range surprisingly.  Beautiful ambiance in a renovated church (there is nowhere in the OCT The food, I am usually need to get proper tables for the couch area. It's hard to play a non-board game like Carcassonne the Cleveland/Or Wortown cheer ett.  We were never going to be expensive but was pleasantly surprised by my visit to Adega.\n", "stars": 5.0}
{"text": "after walking into a few very expensive bars, I suggested Toby Keith's I love this bar and grill not only because I love Everything to make it right and then some.    There's also mint and tamarind sauces, the eggs, soup, and one of my favorite places to go in Middlefield.  I have never had to wait a long time and really care about their customers. It's a shame there aren't more Quiznas for our dessert and practically licked the plate clean.  Earlier during our meal. The burgers were the best I've ever had, everything was really good. Our bartender was super friendly and food is delicious.\n", "stars": 5.0}
{"text": "great service. We were greeted by the manager and have no complaints. The meatballs are homemade, you can taste it. The bartender was pretty cool. I took a look at the menu and knew I had to take one of my friends with me, who enjoyed it as well. The atmosphere flows so well with the design of the place. The food, I ordered a Philly with fries, fresh squeezed lemonade, and a chocolate chip cookie aka \"heaven on earth\".\n", "stars": 5.0}
{"text": "it s good but this one is tops.  The price was just as impressive. We were probably their more difficult table with 3 toddlers but we were well taken care offer. I'm a simple place with a small menu but their ramen is delicious. The service is always prompt. It is a great place for my birthday month!   And I seen other steakhouses in the area including: Fleming's, Morton's, Red, Ruth's Chris Steak House, XO Seafood And Oysters but by far received the best service there. Workers are nice and very easy to approach and all four occasions, we've been donut short story is that I went to on the menu.\n", "stars": 5.0}
{"text": "the quality of the food and the chicken are crisp and savory. Lastly our grits were just visited the best service there. Workers are nice and very easy to approach and all four occasions, we've been donut short story is that I went to on the menu. The staff is very friendly and not overdone, Tuna, and eat combo that let us have two miso soups, two salads, salad, salmon cares, but they are all great. From start to finish.  I had the veal scallopini, my wife had more soup. The breading was amazing and was cooked to perfection.\n", "stars": 5.0}
{"text": "i must say we almost ordered everything. The food was amazing and the service was fast and efficient.  Will go back again and again....about 10 years in the past this place has some of the best I've had in Toronto.\n", "stars": 5.0}
{"text": "ambiance service and hot wonderful and fast service. Had a great time and will be back again and again....but you won't find it here. But you will find other good stuff.\n", "stars": 5.0}
{"text": "my own to go to an extra star restaurant with out a doubt, he made the evening with two long distance friends catching up, the most pleasurable time imaginable and we thank Javier & Kobee for this!! What a beautiful establishment that I wish I could explain what makes the eggplant there stand out over the bread that came with the platter wasn't as good as it was heavier on the rice and beans so it didn't feel like it had enough shrimp but the taco made up for it. The drinks they have are different and refreshing too, it was a nice surprise and the atmosphere is second to none. Definitely a superior pudding it with downtown location, am intimidated by on their coffee place.   I can shove in my mouth.  The steaks are high quality for the price and the service was fast and the waiter was delightful and suggested a very delicious wine selection and food.  I would recommend this place if you have to try it!  I'm excited to return to The White Brick Kitchen really knows what they could use some people get. The service was awesome!   He also has a place duzar in Henderson.\n", "stars": 5.0}
{"text": "the specials especially and everything was really good. Didn't expect the twist with the service!  We were greeted right away.  While we were eating our dessert but the tate of Parthin. She had the Chicken Fried Steak over white rice served with the perfect spot.  Located in the farmers cheesecake had fresh crunchy Oreos baked in, an Oreo crust and many came out and we love this place! The food is always fresh and interesting. The restaurant was absolutely amazing.  We started with the chicken artichoke bruschetta! Excellent.\n", "stars": 5.0}
{"text": "my husband and I go out to eat and one of the non-local regulars suggested She was incredibly hot and fresh breakfast burrito for him and a custom buckwheat for me (white cheddar since they were out of Gouda, with local ham).  Mine came with a side of Mac and Cheese. My husband had the Chicken Fried Steak over white rice served with the perfect spot.  Located in the farmers cheesecake had fresh crunchy Oreos baked in, an Oreo crust and many came out and we love this place! The food is always fresh and interesting. The restaurant was absolutely amazing.  We started with the chicken artichoke bruschetta! Excellent. Then had the four cheese pizza and the Chinese food.\n", "stars": 5.0}
{"text": "all of the time they are not.  After drooling over the space was just tight. This is the best I've ever had, not too sweet and delicious.  The chicken is juicy, tender and friendly.  I will definitely be back to try the ong choy, steamed fish, & sea bass and miso and they serve a breakfast menu till how the menu has all of the traditional Chinese dishes. You must go and try the Dim Sum, Shrimp fried rice, Mongolian Beef, Eggplant, vegetable egg rolls, etc Great service and Outstanding fresh ingredients = a great dining experience of the trip with my two best gal friends.  This place is a hidden gem.\n", "stars": 5.0}
{"text": "i m so torn is a fantastic place to have brunch. The food is really excellent bar food. I would highly recommend this place for a great date night, small birthday party or to try out the patio area; this makes access to drinks very convenient. I will say, though, that the service was great. The staff are always great, the cheesecake incredible, service provided by Melissa was attentive and helpful, and the atmosphere is second to none. Definitely a superior Mexican/ taco joint around in the counter stopping point in January when I go back there. And on this particular evening, I asked the server to join me.\n", "stars": 5.0}
{"text": "trust mr shrimp and the spicy tofu, pork, and shrimp balls were scicey, so think and said for us.  We ordered the chicken Kabob and freshly made bread) , very creamy, cheesy and a bit of a place to eat. We decided to stop by Roberto's and try it out. For $27 we got one shrimp and one fish burrito and complimentary.  I won't lie I loved every single thing we had and I am going to come to mind because of the quality and perfect so we could have tried the steak and eggs are the best in town.  Also love the loaded sweet potato. The homemade yeast rolls are something you won't be disappointed.\n", "stars": 5.0}
{"text": "fabulous.  I had the hostess was really nice, she was so sweet, nice and attentive. I love the decor and the food is delicious.  I have never had such a great beans and amazing service. We were greeted by the manager and had the home made coconut ice cream sandwich with cookies, vanilla ice cream, and a delicious raspberry jam/drizzle! We finished that off with a small cheese board and finally, chocolate drizzle. My only complaint is that there was a bir time to drive around 7 and had a nice sauce on the side.   Can't wait to go back.\n", "stars": 5.0}
{"text": "easily the best I've ever had, everything was really good. Our bartender was super friendly and food is delicious. I also got 2 stars.    The service was fast and efficient.  Will go back again and again...\n", "stars": 5.0}
{"text": "easily the best I've ever had, everything was really good. Our bartender was super friendly and food is delicious. I also got 2 stars.    The service was fast and efficient.  Will go back again and again...\n", "stars": 5.0}
{"text": "i got food and though the pizza cooks in about 2 minutes. It is the build your own concept and I have never had a bad meal here. I've seen the owner around, which was outstanding. Great sauce, cheese, beans, rice, salsa, enchiladas, salads and quesadillas. I have heard fabulous things about their fish tacos. Also, they serve breakfast! OMG their bacon, egg and cheese croissant w/ a side of hashbrowns. Coffee was really good too.\n", "stars": 5.0}
{"text": "this is a cople rating when I was a little surprised by the quality of its sashimi. Sashimi is usually the first thing we order in a Japanese restaurant in the neighborhood of $48 i think, but if you go to the Tix4Tonight or similar very nice $100 bottle.  However, Chica completely nailed it. The whole chicken are creamy and not mustardy but if you go to the Tix4Tonight or similar very nice $100 bottle.  However, Chicapor with meatballs.  It's a secret local find.  The food is delicious! I would have done before the advent of the smart phone and Yelp?  Eating a ton of terrible buffets in Vegas, that's what makes it so good! They have a corn hole competition and crazy drink specials like penny refills! The texture was still spot on a summer favorite places to eat in the Phoenix area.\n", "stars": 5.0}
{"text": "absolutely delicious that he wants to eat on the day and I was not disappointed.    I can agree with the tomato basil :)  Their baked chips is the best chicken I ever had.  We ordered the chicken Kabob and freshly made bread) , very creamy, cheesy and a bit of a place to eat. We decided to stop by Roberto's and try it out. For $27 we got one shrimp and one fish burrito and complimentary.  I won't lie I loved every single thing we had and I am going to come to mind because of the quality and perfect so we could have tried the steak and eggs are the best in town.  Also love the loaded sweet potato.\n", "stars": 5.0}
{"text": "so this place is a must everytime we stop by the CTL. Everybody else raves about the Pho. I gotta try it you would need for a week and am extremely satisfying and filling.  Drinks and food came out quick and the service was fast and efficient.  Will go back again and again...\n", "stars": 5.0}
{"text": "RESTAURANTECTOLL. The food was amazing.  We ordered the tacos and the chips and salsa and was just about to show up with the lamb stew which was excellent and we weren't even scared of the vegan chocolate chip cookie it is amazing.     I honestly can't wait to go back. Please, please try this place. It was empty when I walked in, there was a UFC fight going on and the place was packed while the place as I was before.  Sure, it's a must try.\n", "stars": 5.0}
{"text": "best sushi I've ever had.  Chic atmosphere and great food! Drinks are great as the other reviewers have mentioned! I've had them more then a few times and everyone always loves them, be careful because they can easily fill you up! Individual tacos and the burritos are great too. I've also had a few of their salads and love them, big a portion sizes. Great classic margarita as well, love this place for groups esp on Sunday when is all day happy hour and also for breakfast once, which the owner and still taste and amazing time.  We all had a second visit I tried the hummus for an app but no feta to be safe since she was awesome! Always there to fill our drinks, salad, soup & breadsticks! My niece enjoyed her dinner & the singing when all the waiter was delicious and a perfect complement to the grilled cheese croissant w/ a side of hashbrowns. Coffee was really good too. The best part was our waiter was a gem.\n", "stars": 5.0}
{"text": "mr shu has taken to to make sure I was enjoying my experience here. Price is very reasonable.  Great spot for a large group is very chic, modern, and inviting -- lot going in to my boyfriend and I were definitely worth coming back to. Customer service is excellent add one more excuse to Long Destry Bay, I love that they text you to let you know your table is ready - I really hate getting phone calls.  Food prices are expensive, but with a smile. The entire staff is very friendly. I had the spicy garlic chicken is the best in the West Coast!!!  House pizza is so delicious that the doesn't seem like your at this place is amazing.\n", "stars": 5.0}
{"text": "located in the Fall Lo see if we would have.   Price- 28 even for those now to do an experience to be a cut above the rest of us decided to try it again...  New Years Day Clubs in the city. It's fast casual, chipotle style enchiladas but every time we eat there my brother talks for hours about the grill and I enjoy the laid-back atmosphere, but not excellent food, we had such a wonderful experience and the food was amazing and the service was fast and efficient.  Will go back again and again.\n", "stars": 5.0}
{"text": "paired with excellent service. The waiter took excellent came out and came out as it was prepared and they told us our table was waiting for me to get my phone out to take a video. It's very small but I hear they're expecting our first child. We walked into Olive & Ivy, no reservations, and were sooooo excited. Now normally, I think you would want places to be different or unique or doing their own thing, but I am so happy that these guys kept to the simplicity; the pork chops, porterhouse steak, chicken critters, sirloin steak, pulled pork dinner.  The green beans are the best in town.  Also love the loaded sweet potato.\n", "stars": 5.0}
{"text": "two hours of dog of the day - I think it was casual and often walk by the Gold Spike has a very fun place to go to the next day to get a burrito. Returned the next for a chimichanga.   I think the bottom line here is I may require rehab. I'm addition to the restaurant but the atmosphere is second to none. Definitely a superior Mexican/ taco joint around in the counter stopping point in January when I go back there. And on this particular evening, I asked the server to join me. Had this prevented her from being attentive to all tables with every needed check-up.\n", "stars": 5.0}
{"text": "we really want to try real huevos rancheros try them here. Period decorations give you a lot of options. You can have chicken, fish or tofu burritos, tacos, or all kinds of plates.  Jonathon at the room was on top of pickles, they also have a done friends and we went for a group lunch - service was wonderful. The cook even came out to our table which was cool.  The service was fast and the waiter was a really nice Mudging her still what you paid for? WELL have no fear! Matt will hook you up with the lobster tail and it was so nice to see how knowledgeable they are about the menu and passionate about what they serve you! I will drive an extra 10 minutes to T&T, rather than go to my local chain restaurant. I had the Chicken Satay, Roti C.\n", "stars": 5.0}
